[
    {
        "id": "1pmjzo6",
        "title": "AITA for buying my daughter a more then twice as expensive Christmas gift then my son?",
        "url": "/r/AmItheAsshole/comments/1pmjzo6/aita_for_buying_my_daughter_a_more_then_twice_as/",
        "body_summary": "I (41F) have a daughter (15) and a son (13) with my husband (49). Let’s call them Emma and John. Emma and John do not have a good relationship (sibling rivalry, accusing of being the favorite child and so on).\n\nMy Husband and I decided to buy my son a Nintendo switch 2 plus a game for Christmas. We spend a little more then 500$. In my opinion this is a big gift and exactly the thing that will make him the post happy.\n\nMy husband wanted to buy my daughter an iPad Air and the pencil as a gift and I agreed to that. But then I found an IPad Pro 512 gb for only 1000 dollars so I bought that instead and told my husband only after buying it. With the pencil it will cost us nearly 1200$.\n\nMy husband freaked out when I told him. He said that this is unfair to John and will only make the situation b...",
        "reddit_judgments": {
            "YTA": 163,
            "NTA": 0,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 164
        },
        "total_judged": 164,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-15T05:18:06.106711"
    },
    {
        "id": "1pmlp9j",
        "title": "AITA Mom mad because I don’t wanna clean her dirty sex sheets",
        "url": "/r/AmItheAsshole/comments/1pmlp9j/aita_mom_mad_because_i_dont_wanna_clean_her_dirty/",
        "body_summary": "My mom travels for work and is often away for months at a time.\n\nWhen she does come home, she usually flies in late, so she likes her room to be clean and her bed freshly washed and made.\n\nI’m happy to oblige because she’s letting me live at home for free while I save up for my own place and it’s a simple request to just want the house clean. Plus, she’s my mom.\n\nShe’s been dating this guy and has him over sometimes when she’s in town.\n\nThe last time she was here was Thanksgiving and this guy spent the night at our place. I know that him and my mom had intimate relations because I could hear it from my room. Yes gross… but she’s an adult and I’m living at her house. So, it is what it is.\n\nAnyways, she leaves to go back to work the next day without cleaning her room/sheets. And now, she’ll ...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 115,
            "ESH": 1,
            "NAH": 4,
            "INFO": 4,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-15T05:18:26.733861"
    },
    {
        "id": "1pm6frs",
        "title": "AITA Friend didn't reply until day before brunch plans",
        "url": "/r/AmItheAsshole/comments/1pm6frs/aita_friend_didnt_reply_until_day_before_brunch/",
        "body_summary": "Am I the asshole for calling off brunch plans with my friend? I texted her on Thursday because I'm coming home from across the country. I have a ton of people I wanted to see because I have been gone for so long and I made time for her. We agreed on a day for Sunday, but she went radio silent after suggesting brunch and didn't contribute to planning it at all. She also mentioned she had something at 4pm on Sunday\n\nIt is now Saturday night and she never responded or contributed to making brunch plans. It was me basically putting options in the chat and not getting a response. The time for Sunday for when we were meeting up was not confirmed either. It's 8pm at night now, and I text her to ask her if it is still on. She then said yes but was still not agreeing to a place and it felt like it ...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 17,
            "ESH": 12,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 39
        },
        "total_judged": 39,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-15T05:18:42.682726"
    },
    {
        "id": "1pmph17",
        "title": "AITA for not wanting to take home what my MIL got my son for Christmas?",
        "url": "/r/AmItheAsshole/comments/1pmph17/aita_for_not_wanting_to_take_home_what_my_mil_got/",
        "body_summary": "Me (33F) and my MIL have a good relationship in general but she has a history of not respecting boundaries. This year we are spending Christmas with my husband’s family and we told our MIL that we wanted just experiences for my son (18 months old) like a membership to the aquarium / zoo, day in Legoland or something like that, and maybe a book or two that he can unwrap. He has too many toys and clothes already and he doesn’t understand yet receiving gifts. \n\nWell, my MIL was beyond herself that she wasn’t able to get my son gifts so she asked for an Amazon wishlist for things she could get that we could use in the future. My husband and I spent quite a bit of time thinking about what to add to that list cause we truly don’t need much for our son. We sent it to my MIL and told her she could...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 92,
            "ESH": 1,
            "NAH": 6,
            "INFO": 1,
            "TotalJudged": 111
        },
        "total_judged": 111,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-15T05:19:00.084786"
    },
    {
        "id": "1pmtmv4",
        "title": "AITA my family “tested” me by getting my sister to ask me if I could get her a vape.",
        "url": "/r/AmItheAsshole/comments/1pmtmv4/aita_my_family_tested_me_by_getting_my_sister_to/",
        "body_summary": "I’m 18F. Which is the legal age to buy vapes where I live. I’ve been vaping since I was younger tho. Which my family’s don’t like. My sister is 17. She doesn’t vape or drink.\n\nSo I was shocked when she came to me and asked me if I could buy her a vape. I asked her why I didn’t think she wanted to try vaping or drinking. She said all her friends vapes and she just wants to try it.\n\nI have a spare vape that I don’t really use as much as my main one right now so I said she can have that if she wants.\n\nI did say don’t do it if it’s simply to look cool or fit in tho. But she’s not even that much younger than me and if she really wanted to vape I’d rather her get it from me than steal it from me or get it from someone else who might’ve tampered with it. Or upsell her.\n\nAnd I felt like I was bein...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 63,
            "ESH": 26,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 100
        },
        "total_judged": 100,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-15T05:19:16.420798"
    },
    {
        "id": "1pmuq6v",
        "title": "AITA for donating some winter coats to two cold little girls?",
        "url": "/r/AmItheAsshole/comments/1pmuq6v/aita_for_donating_some_winter_coats_to_two_cold/",
        "body_summary": "I'm new to reddit but this situation is so confusing to me. Let me explain what happened. It's gotten very very cold recently where I (46F) live in the midwest. My son (13M) has two friends, twin girls (13F) who moved here in September from California. They hang out at our house a lot, one more than the other. \n\nYesterday my oldest daughter (20F) is home for winter break. She came into the kitchen where I was and told me she doesn't think the twins own good winter clothes. When I looked, one was in a hoodie and the other was wearing a jean jacket. My daughter asked me if we had any of her old clothes in the attic that we were maybe saving for my youngest, so we went up to look. \n\nI found lots of nice clothes from when my oldest was younger. Some good quality coats, long sleeved shirts, eve...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 79,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 82
        },
        "total_judged": 82,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-15T05:19:33.692448"
    },
    {
        "id": "1pmhew5",
        "title": "WIBTA if I take my car back from my sister and my dad, leaving them without one?",
        "url": "/r/AmItheAsshole/comments/1pmhew5/wibta_if_i_take_my_car_back_from_my_sister_and_my/",
        "body_summary": "My (25f) sister (29f) and dad have been using my car for the past 4 months. The only reason they got my car in the first place was because I had a stroke and was in the hospital for a month. I allowed them to keep it during my recovery because I was not able to use it, so why not let them rather than the car sit? Besides they were taking my (2) kids back and forth to daycare. (i have since recovered extremely well and have been cleared by doctors to drive) \n\nA little background context:\n\nMy sister does not have her license and does not drive. Our dad lives with her and my nephew and he drives her around. As the title hinted, neither have a car of their own. My dad doesn't really play a big part in this, he's a neutral party. My sister has always relied on other people to take her places; w...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 39,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-15T05:19:49.462180"
    },
    {
        "id": "1pmkrsk",
        "title": "AITA for not allowing my teenage stepdaughter to host a party at my house while I’m away?",
        "url": "/r/AmItheAsshole/comments/1pmkrsk/aita_for_not_allowing_my_teenage_stepdaughter_to/",
        "body_summary": "My 24-year-old biological son moved back in with my spouse and me this summer to get his life back on track. This is meant to be temporary. I’ve been clear that by the end of January he needs a documented plan (school, a trade, etc.), and I’ve even set aside $10k to help cover trade school if needed. He’s made some progress, including paying off about $5,000 in debt by working multiple jobs.\n\nYesterday, my son told me (not asked) that he planned to bring a woman he just met on Tinder to stay at our house for two nights. We live about 100 miles from the city. My spouse was immediately uncomfortable with having a stranger stay in our home. I also had concerns because my son privately told me she is a recovering drug addict and alcoholic, has had legal issues, and is only 22.\n\nI told him that...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 74,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-15T05:20:05.662698"
    },
    {
        "id": "1pmop0u",
        "title": "AITA for putting my foot down on being treated like a free cook for ungrateful people?",
        "url": "/r/AmItheAsshole/comments/1pmop0u/aita_for_putting_my_foot_down_on_being_treated/",
        "body_summary": "I live in my ancestral home, with my elderly parents. I have a sibling that lives on the same property in a financed trailer. Some years ago, I paid to build a rather nice shop building and I installed a BBQ pit on it, for socializing. My sibling's spouse apparently loves my grilling and, for the last 4 months, every Sunday I have been pressured into grilling. They bought only the first time. They washed dishes only the first time. Every time since it has been - our mum buys and preps the patties - I clean my grilling flatware and grill the patties - my sibling walks up takes three patties for his spouse, says 2 words and leaves. \n\nI have been very vocal with our mom that this is not how communal dinners are supposed to work. I have told her I don't want to do it, but every time she pressu...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 14,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 15
        },
        "total_judged": 15,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-15T05:20:21.156868"
    },
    {
        "id": "1pmb4qv",
        "title": "AITA for setting boundaries after a misunderstanding about concert tickets with my artiste friend?",
        "url": "/r/AmItheAsshole/comments/1pmb4qv/aita_for_setting_boundaries_after_a/",
        "body_summary": "I have a close friend, “Jay,” who’s an up and coming artist. I’ve supported him from the very beginning emotionally, financially, physically (this part matters). Whenever he was stressed, touring, or burnt out from studio sessions, I gave him massages for free. Not once or twice. For months. I never complained because I genuinely believed in him and his career. Recently, Jay landed a big concert, his first major one and I was genuinely proud of him. During one of our conversations, he casually said something like, “Don’t worry, you’ll be there.” I took that as him saying I’d get a ticket. I didn’t ask for VIP, backstage, or anything extra. Just a regular ticket so I could support him like I always had. Fast forward to a week before the concert. I asked what time I should come so I could pl...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 15,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-15T05:20:36.597762"
    }
]