[
    {
        "id": "1ovnmia",
        "title": "AITA for saying it should be up to the bride and groom what they serve at the wedding?",
        "url": "/r/AmItheAsshole/comments/1ovnmia/aita_for_saying_it_should_be_up_to_the_bride_and/",
        "body_summary": "My childhood friend ‘Toby’ recently got engaged and is in the planning stage right now. I’m the best man. The thing is, he hates alcohol for what it did to a friend of ours ‘James’, one we also grew up with. The guy went to rehab and is doing a lot better, but Toby still doesn’t want alcohol at the wedding. He also said it won’t be good for James to see others enjoying themselves with champagne, though James said he’ll be okay and can understand if they serve alcohol.\n\nToby said he wants coffee and tea served for the adults instead, and fruit juices to be available for the children. He first said this to me when we had coffee at our favorite place and later suggested it to everyone else. His fiancée agrees. His dad and her parents are quite pleased, noting it would make the wedding cheaper...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 131,
            "ESH": 0,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-13T05:12:07.417012"
    },
    {
        "id": "1ovcrmq",
        "title": "AITA for asking him not to slam the weights?",
        "url": "/r/AmItheAsshole/comments/1ovcrmq/aita_for_asking_him_not_to_slam_the_weights/",
        "body_summary": "Me(M33) and my wife go to our apartment gym together pretty regularly. We usually use one side of the cable machine with a bench, and we're totally fine if someone else uses the other side.\n\nThe other morning, this guy started using the empty side. he had AirPods in, probably with noise canceling on. After ever set, he would just let go of the cable, letting the weights slam down loudly and the handles fly up.\n\nIt was really loud. If i were across the gym, maybe I could've ignored it, but he was right next to me. After about 5 more sets, I finally said, \"Excuse me, can you not slam the weight?\"\n\nI actually meant to say something more polite, like, \"Hey, do you mind setting the weight down gently?\" but it came out a bit harsher than I intended.  He had mixed emotion on his face, finished on...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 70,
            "ESH": 1,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 74
        },
        "total_judged": 74,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-13T05:12:23.251458"
    },
    {
        "id": "1ov0e4v",
        "title": "AITA for \"hiding\" assets from my aunt's estate from my cousins?",
        "url": "/r/AmItheAsshole/comments/1ov0e4v/aita_for_hiding_assets_from_my_aunts_estate_from/",
        "body_summary": "I 40F am the only daughter in a brood. My aunt is my father's only sibling. It wasn't until after my paternal grandparents had died that my aunt revealed to my father that she had gotten pregnant in college at 19 and had given the baby up for adoption. She has been an out lesbian since grad school, longer than I've been alive. She and her late wife never pursued having kids together.\n\nThough she told my father, the whole matter was still a secret until my cousin contacted her on his 35th birthday. He is my cousin. Period. That said, he has his adoptive parents' name, not my aunt's (and mine). Through no fault of his own, he never met my grandparents. My cousin and his son, little cousin, visit my aunt 1-2 times a year and communicate a bit on social media. Cousin has never once celebrated ...",
        "reddit_judgments": {
            "YTA": 56,
            "NTA": 9,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-13T05:12:39.095056"
    },
    {
        "id": "1ov52sr",
        "title": "AITA for leaving during a rosary deticated to my wife’s deceased father?",
        "url": "/r/AmItheAsshole/comments/1ov52sr/aita_for_leaving_during_a_rosary_deticated_to_my/",
        "body_summary": "My wife (23F) and I (22M) got married earlier this year (dating for four years)  and things has honestly been amazing. This week, her dad died due to a long fight of cancer . My wife was completely destroyed.\n\nWe are religious (Catholics), so last night we had a rosary for the dead at our house. This was a very emotional time. My wife was sitting next to me, very upset, but finding a small comfort in the prayers.\n\nWe were praying when we heard a really loud sound of glass breaking from the backyard. My first thought was, \"Someone is breaking in!\" I instantly felt the need to check it to make sure my wife and I were safe from a burglar or something dangerous. If you hear glass smash, you check it RIGHT??\n\nI quickly got up and went to the back. It wasn't a burglar, it was just some kids who ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 79,
            "ESH": 0,
            "NAH": 15,
            "INFO": 0,
            "TotalJudged": 95
        },
        "total_judged": 95,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-13T05:12:55.326117"
    },
    {
        "id": "1ov8l27",
        "title": "AITA for not letting my homeless friend stay at my parents house?",
        "url": "/r/AmItheAsshole/comments/1ov8l27/aita_for_not_letting_my_homeless_friend_stay_at/",
        "body_summary": "I have an old friend from high school, I'll name her Sarah. Sarah and I were briefly friends when we were 16. Over the course of 17 years, we messaged each other no more than 10 times. Recently, she reached out to me and asked for my parents number because she had a legal question about copyrighting an idea she has (my parents are attorneys). Months later, she showed up at my parents house unannounced. She told my parents she has no where to go and wanted to stay the night. My dad doesn't remember her and essentially, she's a stranger. She was having a mental breakdown and claimed she took a bus from Texas to Illinois and her plan was to go to Iowa to see her mom. She gave my parents her moms number, I called and the woman doesn't know Sarah. She lied. Also, I’m not sure she’s telling the ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 30,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-13T05:13:11.121442"
    },
    {
        "id": "1ov0k6q",
        "title": "AITA for asking my groupmate to read my damn source before telling me to change it",
        "url": "/r/AmItheAsshole/comments/1ov0k6q/aita_for_asking_my_groupmate_to_read_my_damn/",
        "body_summary": "So I(17M), recently Ive been assigned a group project for my Molecular biology module, it is a weighted project that carries roghly around 30% of our grade.\n\nWe were assigned to research a certain genetic skin condition, and I in particular was assigned by my leader to finish the slides that address the effects this disease has on the skin cells of a human. To which I spent the entire night researching and editing the slides till I was satisfied with how it looked, as well as providing 2 in depth articles that contains everything regarding the diseases effect on human skin cells\n\nThe problem started when one of my groupmates(lets call him T(17M)), decided to demand that I cjange one of the sources as it was off topic. I replied to him statibg that the article was perfectly on topic and tha...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 10,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 14
        },
        "total_judged": 14,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-13T05:13:26.713213"
    },
    {
        "id": "1ovbo6o",
        "title": "AITA for asking my girlfriend to pack my food for travel if I'll be the only one driving?",
        "url": "/r/AmItheAsshole/comments/1ovbo6o/aita_for_asking_my_girlfriend_to_pack_my_food_for/",
        "body_summary": "24M & 24F, in relationship since 3.5 yrs. Currently, we work in the same city but live separately (planning to move in together soon).\n\nWe like to travel. I've a hatchback. So we travel almost every week to a temple around 1.5 hours far away from one side. We like that place as it also provides scenic views, activities like trekking, rope ways, vivid market etc.\n\nIt takes a total of 3 hours of driving. Sounds little, but it's tiring as the temple is situated on hills. So roads are just 2 lane, curvy and demands 101% attention of the driver. Mentally & physically exhausting.\n\nShe knows driving, but isn't confident enough to drive on that path, that too with a vehicle she isn't used to enough (my car). She doesn't a car her right now. So obviously, the responsibility of driving has totally f...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 61,
            "ESH": 20,
            "NAH": 5,
            "INFO": 9,
            "TotalJudged": 106
        },
        "total_judged": 106,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-13T05:13:44.764042"
    },
    {
        "id": "1ovky30",
        "title": "AITA my coworker will not stop telling me about her niece",
        "url": "/r/AmItheAsshole/comments/1ovky30/aita_my_coworker_will_not_stop_telling_me_about/",
        "body_summary": "Last year I found out I was pregnant after doing IVF. My coworkers who were all very supportive were very excited. One coworker we will call Jane told me her SIL, who also struggled with infertility was pregnant too and had a due date 2 days before me.\n\nI ended up having a miscarriage. There were a lot of complications and it was very traumatic.\n\nI notified my coworkers and everyone was very kind. But Jane kept doing this thing, as soon as 1 week after I returned to work. Any time we worked together she would give me updates on her SIL’s pregnancy. Normally this wouldn’t have bothered me. I don’t mind that other people are pregnant (it might hurt my feelings for me but I’m happy for them) But she would always start our conversations by saying “if you were still pregnant” and then say where...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 60,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-13T05:14:00.684822"
    },
    {
        "id": "1ovm5we",
        "title": "AITA for not letting my friend work from my home?",
        "url": "/r/AmItheAsshole/comments/1ovm5we/aita_for_not_letting_my_friend_work_from_my_home/",
        "body_summary": "For context I'm (F) in my 30s and my friend (M) is the same age. We're located in Jamaica and because of the recent hurricane our community has no electricity. I work remotely so I invested in a solar system due to the electricity issues (before the hurricane). \n\nMy friend also works remotely but is unable to do so because there is no electricity. He has a generator but he thought it would be better/cheaper to work from my home. I advised him I can't accommodate him long term as my home isn't large and I'm a single mother. He said that was fine. \n\nThe first day he came he was drinking our water. I told him to bring his own water as it's somewhat short at this time. Then he used the toilet without flushing. I had to point to the bucket that is next to the toilet to flush it. (No running wat...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-13T05:14:16.171072"
    },
    {
        "id": "1ov9mcj",
        "title": "AITA think I ruined my nephew’s birthday",
        "url": "/r/AmItheAsshole/comments/1ov9mcj/aita_think_i_ruined_my_nephews_birthday/",
        "body_summary": "⚠️This is a burner account, all names are fake as well to keep privacy for those involved⚠️\n\n I (23) have three other siblings but the one I’m talking about will be called Bella and her finance we’ll call David. They both have one child and one on the way. Their current child we’ll call Jimmy, turned 4 last Tuesday and when I say he’s special to the family, I mean it. Not only is he a rainbow baby, but he’s survived countless close calls because of health issues so for him to make it to 4 is a miracle.\n\nJimmy wanted a Minecraft themed birthday party, and I had fully planned on getting him a couple of those Minecraft Lego sets and make him a handmade crochet blanket with a Minecraft sheep face. But Bella had advised not too, because she didn’t want him to become spoiled like our brother, wh...",
        "reddit_judgments": {
            "YTA": 53,
            "NTA": 19,
            "ESH": 16,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 89
        },
        "total_judged": 89,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-13T05:14:32.806376"
    }
]