[
    {
        "id": "1mhahtj",
        "title": "AITA for not caring anymore about my sister’s issues with me showing PDA with my partner?",
        "url": "/r/AmItheAsshole/comments/1mhahtj/aita_for_not_caring_anymore_about_my_sisters/",
        "body_summary": "OP's sister criticizes their & girlfriend's mild PDA (hand-holding, occasional kisses) at events. Sister calls it \"inappropriate.\" OP feels sister is projecting & questions if they're TA for ignoring her feelings on PDA.\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 117,
            "ESH": 0,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 124
        },
        "total_judged": 124,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-05T05:23:58.205519"
    },
    {
        "id": "1mhcvpj",
        "title": "AITA for calling my siblings and mom fat?",
        "url": "/r/AmItheAsshole/comments/1mhcvpj/aita_for_calling_my_siblings_and_mom_fat/",
        "body_summary": "OP, constantly criticized for her weight growing up, lost weight due to illness. Now, her family obsesses over her being \"too thin.\" During dinner, OP snapped, telling her family they only thought she was fat then because *they* were thin, and now think she's too thin because they're fat. OP refuses to apologize, asking if she's the asshole.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 76,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 77
        },
        "total_judged": 77,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-05T05:24:18.950356"
    },
    {
        "id": "1mhd17n",
        "title": "AITA for using a self-printed cart unlocker?",
        "url": "/r/AmItheAsshole/comments/1mhd17n/aita_for_using_a_selfprinted_cart_unlocker/",
        "body_summary": "This past weekend, I went grocery shopping at Aldi (US), where you need to insert a quarter to get a shopping cart. Since I kept forgetting quarters, I eventually 3D-printed a little keychain-sized unlocker. You insert it, the cart unlocks, and you can remove it again.\n\nAs I approached the carts, an older man offered me his. I thanked him but told him I didn’t have a quarter to give him in return. He looked confused and asked how I planned to get a cart without a coin. So I showed him my unlocker tool and briefly explained how it works.\n\nHe immediately got angry and accused me of stealing. He called me a con artist and clearly saw what I was doing as morally wrong. I stayed calm and tried to understand where exactly he saw harm being done. Like, who’s actually losing out?\n\nTo be fair, I ad...",
        "reddit_judgments": {
            "YTA": 18,
            "NTA": 89,
            "ESH": 2,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 111
        },
        "total_judged": 111,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-05T05:24:46.572492"
    },
    {
        "id": "1mhfsfx",
        "title": "AITA for asking my wife to stop sharing all of our arguments with her sister?",
        "url": "/r/AmItheAsshole/comments/1mhfsfx/aita_for_asking_my_wife_to_stop_sharing_all_of/",
        "body_summary": "OP (38M) asked his wife (35F) to limit sharing marital arguments with her sister. The sister's become cold towards OP. Wife accused OP of isolating her. OP feels judged. AITA for wanting more privacy?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 63,
            "ESH": 4,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-05T05:25:30.265098"
    },
    {
        "id": "1mh73wz",
        "title": "AITA for not allowing my mom to refer to her partner as Grandpa to my newborn son? My dad passed 4 years ago.",
        "url": "/r/AmItheAsshole/comments/1mh73wz/aita_for_not_allowing_my_mom_to_refer_to_her/",
        "body_summary": "OP's mom's partner called himself \"Grandpa\" to OP's new baby, which OP felt was disrespectful to his deceased father. OP confronted them, they left, and now OP questions if he was the AH.\n...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 36,
            "ESH": 3,
            "NAH": 4,
            "INFO": 5,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-05T05:25:50.317907"
    },
    {
        "id": "1mh4ro5",
        "title": "AITA for telling my roommate he doesn’t need to invite his girlfriend over every single day and getting mad at him for hogging the kitchen for over 3 hours?",
        "url": "/r/AmItheAsshole/comments/1mh4ro5/aita_for_telling_my_roommate_he_doesnt_need_to/",
        "body_summary": "\nSo my roommate’s girlfriend is at our place literally every single day. She doesn’t live here officially, but she might as well. She’s always around, always in our space, and it feels like we have a 5th roommate. We already have four people living here. It’s cramped enough.\n\nToday I had chicken thawing in the sink because I was planning to cook dinner. My roommate saw it. He even acknowledged it. But then he went ahead and made his own dinner and spent two more hours after that making pancakes “for later.” Like I get cooking dinner, but why the hell are you spending 3+ hours treating the shared kitchen like it’s your personal test kitchen?\n\nI waited patiently for a while but after three hours of not being able to use the space that he knew I needed, I said something. I told him it’s not o...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 17,
            "ESH": 10,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-05T05:26:06.197792"
    },
    {
        "id": "1mhcmmr",
        "title": "AITA for planning to move out with my younger sister without telling our older sister, even though she’s helped us a lot?",
        "url": "/r/AmItheAsshole/comments/1mhcmmr/aita_for_planning_to_move_out_with_my_younger/",
        "body_summary": "I (24F) live with my sisters, Gabriela (35F) and Samantha (18F). For over a year, I’ve wanted to move out because our living situation has become very uncomfortable.\n\nIn 2022, we were renting separate rooms in a 3-bedroom apartment. After a flood, Gabriela took out a $10K loan so we could move. We helped pay it off, and it was cleared last year. I’m grateful for her support.\n\nBut since then, things have gotten worse. In our current apartment, Gabriela has the only bedroom. Samantha and I sleep in the small living room, divided only by a cheap wall partition. We have no privacy, very little storage, and share the same space as the kitchen. There’s also a cockroach problem that the building won’t fix.\n\nLast year, Gabriela brought in a boyfriend who made things worse. They fought constantly, ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 25,
            "ESH": 3,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-05T05:26:21.921765"
    },
    {
        "id": "1mhlnbx",
        "title": "AITAH? Have I overreacted?",
        "url": "/r/AmItheAsshole/comments/1mhlnbx/aitah_have_i_overreacted/",
        "body_summary": "After working a 37.5hr, 5 day week as a Nurse in an outpatient clinic I then worked 2 night shifts as extra. \n\nOn my way home after my 2nd night shift I was almost falling asleep whilst driving so called my boyfriend for him to keep me awake with abit of light conversation. \n\nHe was WFH so I knew he was busy but just asked if he could make conversation until I got home (20mins). \n\nHe then replied with \"How are you making this my problem?\" \"Why if I hadn't of answered the phone?\" \n\nI may of raised my voice at that point but looking back AITAH? Did I overreact? ",
        "reddit_judgments": {
            "YTA": 29,
            "NTA": 11,
            "ESH": 7,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-05T05:26:22.699432"
    },
    {
        "id": "1mhqi2a",
        "title": "AITA for not inviting my partners best friend’s gf to a girls night?",
        "url": "/r/AmItheAsshole/comments/1mhqi2a/aita_for_not_inviting_my_partners_best_friends_gf/",
        "body_summary": "My partner and I get along pretty well. He has a buddy he’s known since middle school. \nHis buddy is ok.  No issues.\nlets call him Doug. \nA few weeks ago a group of my friends that I’ve know a long time wanted to catch up. \nGet dinner and maybe go dancing. \nMy partner mentioned to Doug that I was going out last weekend and Doug told him to tell me to invite his gf. \nI’ve met her a few times. But haven’t really got to know her. \nI didn’t invite her cause I wanted to hang out with my friends and not focus on getting to know her. \nDoug was saying I was kinda an asshole for not inviting her. \n(Not seriously saying it. But was kinda saying it would’ve been really cool if I did invite her.)\nWhat do you all think? \n",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 29,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-05T05:26:23.092187"
    },
    {
        "id": "1mhpdhx",
        "title": "AITA: Mom’s a hoarder and I  pointed it out",
        "url": "/r/AmItheAsshole/comments/1mhpdhx/aita_moms_a_hoarder_and_i_pointed_it_out/",
        "body_summary": "So we’ve got roaches! We’ve officially crossed into the point of infestation. \n\nUntil a week ago I lived at home with my parents. For years we’ve lived with so much stuff in the house that there’s doors that we can’t open, but it was fine. Then we developed roaches and they were at least kind enough to stay out of my room. The exterminator has been coming around for years but keeps telling us that as long as there’s all these things in the house, they’ll never leave. About a week ago I found 1 roach in my room. Then another. Then two more. And the last straw was when I was heading out the door, tried to kill one, and it landed IN my bag and I had to leave my things behind. \n\nBecause of this I decided to stop being at home and I’ve been spending all my time in my car, at friend’s houses, th...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 27,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-05T05:26:39.064907"
    }
]