[
    {
        "id": "1lxxdak",
        "title": "AITA for bringing my dead father up in front of my mother's new husband?",
        "url": "/r/AmItheAsshole/comments/1lxxdak/aita_for_bringing_my_dead_father_up_in_front_of/",
        "body_summary": "OP (27F) is asked if she'll call her mom's new husband \"dad\". OP refuses. Mom and aunt then berate her for mentioning her deceased father, claiming it makes the new husband jealous. OP argues it's natural after 20 years and accuses the husband of unreasonable jealousy. AITA for mentioning her late father?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 136,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 138
        },
        "total_judged": 138,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-13T05:14:17.225403"
    },
    {
        "id": "1ly9ciu",
        "title": "AITA for expecting my husband to not have double standards for his kids vs mine?",
        "url": "/r/AmItheAsshole/comments/1ly9ciu/aita_for_expecting_my_husband_to_not_have_double/",
        "body_summary": "AITA for asking my husband to hold his 26 yr son to the same standard that he holds my 21 yr old son and my daughter’s 12 yr old son? \n\nMy husband requires advanced notice of my son and grandson being at our house (my husband says it’s for “planning purposes”) but when his son showed up unannounced and I asked him to please speak with his son about letting us know when he’s coming, my husband told me, “Kids should feel like they can visit their parents”, and that “Most parents would be happy their kid came to visit”, then he got angry, absolutely would NOT acknowledge that it’s no different than what he asks of my son and grandson, and has now been giving me the silent treatment for several weeks. ",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 83,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 94
        },
        "total_judged": 94,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-13T05:14:18.816849"
    },
    {
        "id": "1lybg4s",
        "title": "AITA for asking for my eggs of toast?",
        "url": "/r/AmItheAsshole/comments/1lybg4s/aita_for_asking_for_my_eggs_of_toast/",
        "body_summary": "OP, a regular, asked a cafe owner to put eggs on toast instead of next to it. The owner acted annoyed. OP got the breakfast as requested but felt embarrassed and now doesn't want to return. AITA for asking?\n...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 106,
            "ESH": 0,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 121
        },
        "total_judged": 121,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-13T05:14:21.557240"
    },
    {
        "id": "1ly1v87",
        "title": "AITA for not allowing my sister to come live with me and my husband?",
        "url": "/r/AmItheAsshole/comments/1ly1v87/aita_for_not_allowing_my_sister_to_come_live_with/",
        "body_summary": "OP refused to house her sister, who's now struggling, due to past rejection when OP was at her lowest. Sister and parents showed up demanding help. OP called the police. Husband wants OP to forgive. AITA for considering a restraining order?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 128,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-13T05:14:24.852691"
    },
    {
        "id": "1ly0e7a",
        "title": "AITA for refusing to help my sister with her baby every day after work?",
        "url": "/r/AmItheAsshole/comments/1ly0e7a/aita_for_refusing_to_help_my_sister_with_her_baby/",
        "body_summary": "OP's sister wants her to babysit daily after work. OP refused due to late hours/home issues. Sister yelled, making OP feel unreliable. OP questions if refusing makes her TA.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 116,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 116
        },
        "total_judged": 116,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-13T05:14:26.712018"
    },
    {
        "id": "1lxv5mr",
        "title": "AITA For not paying for sons car accident?",
        "url": "/r/AmItheAsshole/comments/1lxv5mr/aita_for_not_paying_for_sons_car_accident/",
        "body_summary": "OP's son drove his Jeep (against mom's advice) to OP's house. The son had an accident. Mom canceled the Jeep's insurance/registration, undisclosed to OP. They're being sued. Mom wants OP to pay. OP refuses. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 33,
            "ESH": 3,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-13T05:14:27.993327"
    },
    {
        "id": "1lyehp8",
        "title": "AITA for telling my girlfriend her family can't stay with us for a month?",
        "url": "/r/AmItheAsshole/comments/1lyehp8/aita_for_telling_my_girlfriend_her_family_cant/",
        "body_summary": "I \\[29M\\] told my girlfriend \\[29F\\] that I don't want her family staying with us for a full month once we move in together. She said that if I can’t accept that, she might need to rethink the relationship.\n\nShe’s had family staying with her on and off already, and she’s mentioned that if we have a baby, her mom would be over often or even sleep over.\n\nI told her I need personal space and boundaries. She sees that as not supporting her family values. AITA?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 72,
            "ESH": 2,
            "NAH": 39,
            "INFO": 1,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-13T05:14:30.039432"
    },
    {
        "id": "1lye9uj",
        "title": "AITA for throwing out my friend’s couch after it sat in my garage for 3.5 years, even though I said she could only store it for two weeks?",
        "url": "/r/AmItheAsshole/comments/1lye9uj/aita_for_throwing_out_my_friends_couch_after_it/",
        "body_summary": "Friend asked OP to store a couch. OP reluctantly agreed, setting a 2-week limit. Friend never retrieved it. After 3.5 years, it was destroyed. OP didn’t tell her. Six years later, friend asks for it. OP reveals its fate. Friend is angry. AITA for not telling her sooner?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 54,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 57
        },
        "total_judged": 57,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-13T05:14:31.804432"
    },
    {
        "id": "1ly5kvb",
        "title": "AITA for asking for the window seat?",
        "url": "/r/AmItheAsshole/comments/1ly5kvb/aita_for_asking_for_the_window_seat/",
        "body_summary": "OP got upgraded to first class, then told to take any open seat. An older man took her assigned window seat. OP, a nervous flier needing a window, asked for it. He relented with a rude comment. OP took her original seat back. AITA?\n...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 27,
            "ESH": 1,
            "NAH": 4,
            "INFO": 0,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-13T05:14:33.521064"
    },
    {
        "id": "1lydupk",
        "title": "AITA for refusing to swap my concert tickets with my friend after she missed out on buying them?",
        "url": "/r/AmItheAsshole/comments/1lydupk/aita_for_refusing_to_swap_my_concert_tickets_with/",
        "body_summary": "OP secured great tickets to a concert. Friend Sarah missed out & wants to swap her worse seat + difference in price for OP's. OP refuses, citing her effort & her brother going. Sarah calls OP selfish. AITA for not swapping?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 90,
            "ESH": 3,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 97
        },
        "total_judged": 97,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-13T05:14:35.336869"
    }
]