[
    {
        "id": "1ox4ej8",
        "title": "AITA for crafting during meetings?",
        "url": "/r/AmItheAsshole/comments/1ox4ej8/aita_for_crafting_during_meetings/",
        "body_summary": "So I work in a mainly office setting, and we have a lot of meetings, video conferences and online training which is primarily in video format.\n\nI've always needed something to do with my hands, thanks to ADHD and if I dont then I cannot focus on things that isnt reading properly (which is ironic bc i also have dyselxia).\n\nI've also been crocheting and knitting since I was little and its something I do a lot while at home watching tv and movies bc it helps me focus.\n\nIn Uni i used to crochet and knit in lectures because it helped and no one seemed to have a problem with it - the lecturers actually encouraged it when I asked and said as long as it helped me focus i could do whatever I wanted.\n\nSo I decided I was going to take it into work with me to see of that would help me focus more in me...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 124,
            "ESH": 1,
            "NAH": 5,
            "INFO": 2,
            "TotalJudged": 140
        },
        "total_judged": 140,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-15T05:11:20.899333"
    },
    {
        "id": "1owxay8",
        "title": "AITA for \"dictating\" my flight details?",
        "url": "/r/AmItheAsshole/comments/1owxay8/aita_for_dictating_my_flight_details/",
        "body_summary": "I (20F) grew up with divorced parents in two different states. My dad remarried to a woman (my stepmom), and growing up with her was rough. She is the kind of person who has to be 'right' all of the time (even when she's clearly in the wrong) and likes to walk all over people to prove her point. \n\nWe recently had a long weekend break at my college, and I had plans to visit my dad during that time. My dad texts and asks me if the flight he found worked for me. Id be flying from Pittsburgh to Greensboro, with a stop in Charlotte. Here's the thing: normally I just fly directly to Charlotte as it is a quick and easy trip. Also, Charlotte is 30 min closer to where he lives. \n\nI mentioned that because the last two flights I was on (travels that weren't to my dads) had issues with the connections...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 62,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 67
        },
        "total_judged": 67,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-15T05:11:37.272853"
    },
    {
        "id": "1ox1l45",
        "title": "AITA-Need perspective: I had a cousin visit, and my partner reacted in a way I don’t understand",
        "url": "/r/AmItheAsshole/comments/1ox1l45/aitaneed_perspective_i_had_a_cousin_visit_and_my/",
        "body_summary": "Myself- 35F and partner- 38M dating for 4+ years\n\n1. Background\n• I went out of town for my dad’s birthday.\n• I reconnected with family members I hadn’t seen in about twenty years.\n• I especially bonded with two cousins I grew up with, one male and one female.\n• My male cousin and his wife were especially warm and invited me to come visit where they live.\n• It felt really good to reconnect with family after so long.\n\n2. The visit\n• A couple days later, my cousin called to say he’d be passing through my area on his way home.\n• He asked if he could stop by for a little bit to see my new house.\n• I recently bought my first home, I’m proud of it, and I was excited that a family member wanted to see it.\n• I informed my partner ahead of time. He couldn’t join because he had family plans with his...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 124,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 125
        },
        "total_judged": 125,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-15T05:11:54.696296"
    },
    {
        "id": "1ox08z5",
        "title": "AITA my best friend is having her wedding a month before mine",
        "url": "/r/AmItheAsshole/comments/1ox08z5/aita_my_best_friend_is_having_her_wedding_a_month/",
        "body_summary": "edit: your right I responded badly to it but I am done. She hasn’t havbit of always having to be first, always having to be the center of attention. and for once I thought It would be about me and she does this\n\nI talk about getting a dog , she gets one before me and from the same place I talked about. Literally was meeting them a few days after she dropped that\n\ni plan a vacation to the finger lakes, oh she does it a two weeks before my date and tells everyone how great her idea was on vacaiton\n\nSo on and so on, I bet if I talked about kids she would get pregant just to beat me to it. Always having to be first for everyrhib\n\ni am just done with her, I deserve better. The wedding was the last straw\n\n————————————————\n\nMy wedding is in May 2026. My best friend, I will call Sara, is my MOH. I...",
        "reddit_judgments": {
            "YTA": 39,
            "NTA": 49,
            "ESH": 49,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 139
        },
        "total_judged": 139,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-11-15T05:12:12.004554"
    },
    {
        "id": "1oxbqxl",
        "title": "WIBTA if I refuse to go visit my in-laws for Christmas",
        "url": "/r/AmItheAsshole/comments/1oxbqxl/wibta_if_i_refuse_to_go_visit_my_inlaws_for/",
        "body_summary": "This would be our 8th year together but we got married this year. In the past, we spent Christmas separately more or less because his family said it's just for family. I was \"allowed \" to just come to eat dinner with their family once 3 years ago and it was miserable. My family lives 3 hour drive away so I was expected to drive that, arrive at 6pm and leave at 8pm. A few days later I go back to pick him up and drive us back home (7hrs). It wasn't worth it for me, I spent more time driving than being there. Also, its not like his family were welcoming. My in-laws are civil but cold, mostly ignoring me.\n\nThe following Christmas I said I didn't want to do that again and I would rather stay home at our home with our cat. He could go alone. My husband's best friend's mom heard of my plans and c...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 33,
            "ESH": 1,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-15T05:12:27.880011"
    },
    {
        "id": "1owvqfm",
        "title": "AITA for asking my mother not to eat at the church for my wedding?",
        "url": "/r/AmItheAsshole/comments/1owvqfm/aita_for_asking_my_mother_not_to_eat_at_the/",
        "body_summary": "I planned a small wedding with about 80 close friends and family with the ceremony in the morning and the reception in the afternoon with scones and punch. I let the guests know the meal situation in case they wanted to just come to the ceremony and not the reception. My husband and I just graduated college and he got a job out of state, so we only had a few months to plan. It wasn't the best plan, but I couldn't afford anything else since I didn't have financial help from either of our parents at the start.\n\nA few months into planning, my mom asked about having lunch in the church basement with a few of her close friends that would be at the wedding. I was under the impression it was just two families so I agreed. Later, I asked if the lunch was just for her friends so I could figure out ...",
        "reddit_judgments": {
            "YTA": 25,
            "NTA": 7,
            "ESH": 25,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-15T05:12:44.272825"
    },
    {
        "id": "1oxdthx",
        "title": "AITA for demanding my husband mop the floors",
        "url": "/r/AmItheAsshole/comments/1oxdthx/aita_for_demanding_my_husband_mop_the_floors/",
        "body_summary": "My husband (41M) and I (35F) and I have been together for 8 years, married for 1. \n\na few years ago we moved to a city in a warmer climate and with the nicer weather I noticed my husband would walk outside barefoot almost everyday. He then walks around our house, sits on the couch, just goes about his day with feet that are often completely black on the bottom. \n\nWe live in a DIRTY city (downtown Los Angeles). There is always trash in the street. There's often dog poop abandoned on the sidewalk, ocassionally human poop. He oftentimes walks barefoot in the road to get to his car, and the tar really makes his feet black. \n\nWe live in a shoes-off house, meaning we take our shoes off when we get home. Its not just comfortable but I like to do it because it cuts down on the germs you carry insi...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 64,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-15T05:13:00.250511"
    },
    {
        "id": "1owzw4x",
        "title": "AITA for not wanting my MIL to watch my baby anymore.",
        "url": "/r/AmItheAsshole/comments/1owzw4x/aita_for_not_wanting_my_mil_to_watch_my_baby/",
        "body_summary": "I (30F) and my husband (28M) just had a baby a couple months ago. I just went back to work full time. Baby goes to a babysitter 3 days a week and my MIL comes over once a week to watch her. My 1st week back at work I am already a wreck for leaving my 10w old, but to make it worse I find out my MIL took my baby out to breakfast to a busy restaurant wo asking. (Where she shoves a phone in my infants face) She told my hus that it was a possibility, but no one asked if I was okay with it. 2nd week, baby had just gotten her shots and wasn’t feeling well, super fussy. I told my hus I didn’t feel comfortable w her going out again while her immune system is low so tell your mom. They don’t go out to breakfast this time, but she does take baby from home to my MIL’s house. Again, no one told me. Nee...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 45,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 51
        },
        "total_judged": 51,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-15T05:13:16.315770"
    },
    {
        "id": "1oxekg6",
        "title": "AITA: Not paying for living room decorations I didn’t want",
        "url": "/r/AmItheAsshole/comments/1oxekg6/aita_not_paying_for_living_room_decorations_i/",
        "body_summary": "I’m in college rooming with my best friend from hs, but our relationship seems to be getting strained. They like to buy furniture or household decorations for the living room and get mad when I don’t split the cost with them. The thing is that I am very adamant about not wanting to buy those things and they buy it anyways and expect me to pay up. They grew up extremely rich(millionaire parents) and I grew up poor, so they accuse me of being stingy and greedy. They also get angry at me for not sharing the food I buy and make for myself. This past week, they’ve made two meals using exclusively my ingredients and saying “it’s payback for the decor”. I understand where they are coming from because I benefit from the items in the shared space, but I idk",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 36,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-15T05:13:16.698196"
    },
    {
        "id": "1owuhr1",
        "title": "AITA for leaving the dishes dor my roommate in the sink for a whole week?",
        "url": "/r/AmItheAsshole/comments/1owuhr1/aita_for_leaving_the_dishes_dor_my_roommate_in/",
        "body_summary": "I (20f) and my roommate (19f) have had some problems because before moving in together we setteled on cleaning standards which she proceeded to practically ignore.\n\nLast weekend she hosted friends which are also my friends and i offered to cook.\n\nWe decided i will cook shell do the dishes and we split on cleaning.\n\nSo i cooked dinner and brunch, cleaned dishes while cooking, and we split cleaning at the end. Then to the dishes.\n\nI did close to half the dishes while cooking she was supposed to handle the rest * as we agreed on * . She didnt.\n\nI decided not to wash them no matter what. I barely used the kitchen because of that but decided washing it wouldn't do anything and its her responsibility. I still did other things i had to do like brooming and washing the floor, didn't do my dishes b...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 13,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 14
        },
        "total_judged": 14,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-15T05:13:32.220583"
    }
]