[
    {
        "id": "1psw6oi",
        "title": "AITA for refusing to share my food with my wife after she repeatedly orders food she doesn’t like?",
        "url": "/r/AmItheAsshole/comments/1psw6oi/aita_for_refusing_to_share_my_food_with_my_wife/",
        "body_summary": "We're a working couple in our late 20s. Often come home late, around 7 PM, so we regularly dine out, like 2 times a week. Our country has hundreds of dishes, so we're never out of options.\n\nI prefer ordering familier items and try something new only when it's looks too tempting. I'm a sensitive eater (not picky) as I've strong sensory sensitivity. I get nauseous easily if I eat or smell something I don't like.\n\nMy wife is totally opposite. Half of the times, she tries something new and orders things just by reading their names. Mostly, she doesn't even know how her order looks like.\n\nAnd mostly, the food she tries isn't good as our comfort food. So after 2-4 bites, she asks me to split and share each other's food. I always hesitate doing that due to my different food habits as mentioned ab...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 135,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-23T05:16:51.054547"
    },
    {
        "id": "1pszp1t",
        "title": "AITAH for not wanting to provide a whole Christmas for my sister’s kids?",
        "url": "/r/AmItheAsshole/comments/1pszp1t/aitah_for_not_wanting_to_provide_a_whole/",
        "body_summary": "I (37F) have two children, 5M and 7F. Their Christmas gifts are already bought and paid for, and their Christmas is settled. My sister, 35F, have two kids of her own, 2M and 4M. My sister’s husband died in September, and the grief has absolutely destroyed her. It has prevented her from celebrating holidays with her kids. I have been very supportive and have been there for her and her children. I took her kids out trick-or-treating with mine when she was going through a very big wave of grief and felt unable to. I have also taken her kids to my house for the weekend when she needed a break. I have never invalidated her grief.\n\nWe know Christmas this year is going to be extremely tough for her and her kids. My whole family and I made sure her kids had plenty of gifts because my sister felt l...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 73,
            "ESH": 0,
            "NAH": 19,
            "INFO": 2,
            "TotalJudged": 96
        },
        "total_judged": 96,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-23T05:17:07.871478"
    },
    {
        "id": "1pt2mgt",
        "title": "AITA for blowing up and cursing out a woman for not controlling her kids at my mom's wake?",
        "url": "/r/AmItheAsshole/comments/1pt2mgt/aita_for_blowing_up_and_cursing_out_a_woman_for/",
        "body_summary": "Edit: at the top so its seen.  I see a lot of comments saying \"she\" although i am a guy.  Understandable as i never mentioned it. 😉\n\nThis happened decades ago. My mom died of cancer when I was not quite 17. She raised me on her own so for all my life it was me and her.  Needless to say, I was devastated and a wreck.  But 8 digress.  Skip to my mom's wake.\n\nShe was laid out. Standard wake setup.  Her up front. Family down the side for people to offer condolences, and a seating area in the middle. Much of the event was a haze to me.  I do remember it was busy at times as my mom was loved by coworkers and friends groups of which she had many.\n\nDuring one lull in the event I was sitting contemplating life and how to navigate it without her when I noticed two kids, a girl and a boy probably aro...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 163,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 165
        },
        "total_judged": 165,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-23T05:17:25.594064"
    },
    {
        "id": "1pss9ka",
        "title": "AITA for Making my 9yo Cousin Cry at the Christmas Party",
        "url": "/r/AmItheAsshole/comments/1pss9ka/aita_for_making_my_9yo_cousin_cry_at_the/",
        "body_summary": "I (21M, trans) attended a family Christmas party this evening with around 30 people in attendance. I have a disability and require crutches to get around safely. My 9yo cousin, entirely unprompted, decided to sit on a bench and flop his legs around, wining \"I can't walk, I can't walk,\" while I was passing by. I told him that it wasn't funny and told his mom (my 40 yo aunt) to explain to him why it wasn't appropriate. She said it wasn't a big deal. \n \nThis conversation caused 7 different family members, all adults, to come by and ask what he did. He did it again. And all of them laughed and told him he was so funny. I tried, again, to explain that I didn't find it funny and I felt like it was inappropriate, but another cousin of mine (21 F) said, \"It's okay because it's [deadname].\" I said ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 42,
            "ESH": 1,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-23T05:17:41.529602"
    },
    {
        "id": "1psyzex",
        "title": "WIBTA if I refused to give my room to my little brother?",
        "url": "/r/AmItheAsshole/comments/1psyzex/wibta_if_i_refused_to_give_my_room_to_my_little/",
        "body_summary": "So I (16f) and my little brother (12m) had an argument today.\n\nIt was my birthday last week (yay!) and so I got a bunch of new stuff for my room from my dad that I’d been asking for to just make my room a little more mine since it was looking a bit bland. We moved into this house a couple months ago. So my brother came in this morning because I wanted to show him everything I got, and then he started complaining about how my room is a lot better. Truth be told my room is arguably the best room in the house (sort of joking). I have a walk in closet, my own bathroom, my windows one of those ones you can sit on and it’s pretty spacious. I love my room to bits because especially with all my new stuff it’s so me and everyone who comes over says they love it.\n\nMy brother has a smaller room, but ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 66,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 69
        },
        "total_judged": 69,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-23T05:17:57.529050"
    },
    {
        "id": "1pswiuf",
        "title": "WIBTA If I chose to enforce an agreement.",
        "url": "/r/AmItheAsshole/comments/1pswiuf/wibta_if_i_chose_to_enforce_an_agreement/",
        "body_summary": "I (29y Female) and my husband (30yo Male) got a place a year ago. My SIL (27) needed a spot to live with her son (6) and husband (29) while they got on their feet and we figured we could use the help with rent so we allowed them to sign the lease with us and pay minimal rent with the intent they would eventually find their own place.\n\nSIL has not been very easy to live with and it has caused me to deal with a lot of mental health issues including depression and anxiety.\n\nA few months ago, she found out she was pregnant and this has resulted in everything being about her pregnancy and making it an inconvenience to everyone in ways of controlling house temperature, removing my furniture and replacing it with her own, locking up our animals in our bedroom, removing decorations, going into my ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 24,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-23T05:18:13.167807"
    },
    {
        "id": "1pswnw2",
        "title": "AITAH - my sisters wedding",
        "url": "/r/AmItheAsshole/comments/1pswnw2/aitah_my_sisters_wedding/",
        "body_summary": "My sister (27f) and her long-term partner (35m) recently got engaged on a 5-star all-inclusive family holiday that my parents paid for. They paid for the holiday for all of us as a treat/special occasion as my sister had a baby in February, so it would be his first holiday.\n\nSince I was young, my parents have always been very clear with both of us that they would never pay for either of our weddings and that we could just have the wedding that we could afford. However, after their engagement, my parents told my sister and her partner that they would contribute a large sum so that they could get married sooner than if they had to save up the money to do so themselves. They did this because their baby has the last name as his dad, and my parents know that my sister would love to have the sam...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 17,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 19
        },
        "total_judged": 19,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-23T05:18:28.800800"
    },
    {
        "id": "1pt1uz0",
        "title": "AITA for going to my brother's house while my family was over.",
        "url": "/r/AmItheAsshole/comments/1pt1uz0/aita_for_going_to_my_brothers_house_while_my/",
        "body_summary": "For some context I (17F) live with my mother and my father, but am currently in the process of finding an apartment. My brother (27M) has been no-contact with our parents for 2 years now and lives with his fiance (27F) and 2 kids (10F and 2F). This weekend some of my extended family came over (they live 5 hrs away) including my aunt, uncle, and cousin (17M). During this visit they all decided they wanted to go fishing. I'm not particular to fishing, but I have my fishing license so I didn't complain. \n\nIn the car on the way to the lake my aunt kept making comments about my choice of degree. I am in my 2nd year of college, pursuing a Bachelors in Biology, and hope to go to medical school one day. She kept saying things like \"Your degree is useless\", \"No one will hire you with that degree\", ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 18,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 19
        },
        "total_judged": 19,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-23T05:18:44.402027"
    },
    {
        "id": "1psv4l4",
        "title": "AITA for dropping my girlfriend off at the train",
        "url": "/r/AmItheAsshole/comments/1psv4l4/aita_for_dropping_my_girlfriend_off_at_the_train/",
        "body_summary": "My girlfriend and I recently moved abroad. We came back to our home country for some time. We both wanted to see a lot of family and friends and we decided that we would seperate when arriving on the airport, she would take the train to go visit her parents and I would take a different train to go visit mine. We would visit eachothers parents later on during the trip.\n\nWhen arriving on the airport my parents had come to welcome us back home. They were in the neighbourhood and wanted to surprise us. Our flight had been delayed a few hours, so I assumed my girlfriend just wanted to get going and get to her parents asap. We walked her to her train and said our goodbyes. I thought this was what she wanted as well, but admittedly, I did not really check with her. Everything went really fast and...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 24,
            "ESH": 2,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-23T05:19:00.043423"
    },
    {
        "id": "1psw10u",
        "title": "AITA for convincing my elderly dad to give up his car",
        "url": "/r/AmItheAsshole/comments/1psw10u/aita_for_convincing_my_elderly_dad_to_give_up_his/",
        "body_summary": "My dad is late 80s and has had 2 strokes and is just slowing down.  The stroke means he struggles walking more than 20 meters.\n\nHe drives once a week to town to drop off and then pick up my mom who has had 3 minor strokes, has a speech impediment, and gets tired very quickly.\n\nI've convinced him to give up the car because I think the risk to reward ratio is high now. I don't want him to hurt himself or someone else for the sake of organizing a taxi. The money isn't an issue but he will generate about $5k and save a further $1k from not paying premiums.\n\nSeveral other family members have told me that my problem solving mentality has ignored the emotional impact to my dad and mom. The car provides a  perception of independence and the car could just sit in the drive. \n\nTo be clear, I'm not a...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 29,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-23T05:19:15.943729"
    }
]