[
    {
        "id": "1mtzhcw",
        "title": "AITA for not canceling long standing plans for a BBQ that I just found out about?",
        "url": "/r/AmItheAsshole/comments/1mtzhcw/aita_for_not_canceling_long_standing_plans_for_a/",
        "body_summary": "OP planned a beer festival trip with friends for Labor Day weekend. His grandparents invited them to a barbecue that weekend, but OP declined due to the prior plans. His mother pressured him to cancel the trip and attend the barbecue, guilting him about his grandparents' age. OP refused due to booked accommodations and commitments to friends. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 123,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 123
        },
        "total_judged": 123,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-19T05:11:31.181687"
    },
    {
        "id": "1mtm5lz",
        "title": "AITA for telling my cousin that no one likes her and that’s why she doesn’t have any friends?",
        "url": "/r/AmItheAsshole/comments/1mtm5lz/aita_for_telling_my_cousin_that_no_one_likes_her/",
        "body_summary": "OP's cousin badmouthed her engagement & tried to steal her fiancé, alienating herself. Cousin then contacted OP, distraught. After a volatile call where the cousin yelled, OP hung up. When the cousin called back & yelled again, OP snapped & insulted her. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 24,
            "ESH": 8,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-19T05:11:32.616393"
    },
    {
        "id": "1mtp866",
        "title": "AITA for not scheduling my wedding around my sister’s family planning?",
        "url": "/r/AmItheAsshole/comments/1mtp866/aita_for_not_scheduling_my_wedding_around_my/",
        "body_summary": "OP wants a May 2026 wedding, but her sister is trying to conceive, potentially being heavily pregnant then. OP's mom wants OP to consider September so her sister can attend. OP thinks sister might be pregnant regardless or unable to attend with a newborn. AITA for wanting May?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 111,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 114
        },
        "total_judged": 114,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-19T05:11:35.166109"
    },
    {
        "id": "1mtvcfw",
        "title": "AITA for refusing to give my friend a ride after she kept treating me like her personal Uber?",
        "url": "/r/AmItheAsshole/comments/1mtvcfw/aita_for_refusing_to_give_my_friend_a_ride_after/",
        "body_summary": "I have a car, most of my friends don’t. At first I didn’t mind giving rides because we all hang out and it’s whatever. But one friend in particular started texting me constantly, even on days I wasn’t going out. She’d ask me to drive her to the gym, to work, to see her boyfriend. She never offers gas money, never says thank you, just assumes I’ll do it. Last weekend she texted me at 7am asking for a ride to the airport. I told her no, I was sleeping in and had plans later. She flipped out and said I’m selfish and that friends are supposed to be there when you need them. Now a couple of people in our group are saying I was petty for not just driving her because it was important. I feel like I was being used and finally set a boundary.\n\nAITA?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 69,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 71
        },
        "total_judged": 71,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-19T05:11:36.121596"
    },
    {
        "id": "1mtdshc",
        "title": "AITA for letting my SIL stay at family cabin?",
        "url": "/r/AmItheAsshole/comments/1mtdshc/aita_for_letting_my_sil_stay_at_family_cabin/",
        "body_summary": "OP's brother and SIL used husband's family cabin. OP left her car there. SIL, Marsha, needed a ride back but was too tired to drive home. OP let Marsha stay at the empty cabin. Husband's family is angry. AITA?\n...",
        "reddit_judgments": {
            "YTA": 34,
            "NTA": 24,
            "ESH": 3,
            "NAH": 1,
            "INFO": 6,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-19T05:11:38.795370"
    },
    {
        "id": "1mtn5bx",
        "title": "AITA for not lending my friend money even though I obviously have it?",
        "url": "/r/AmItheAsshole/comments/1mtn5bx/aita_for_not_lending_my_friend_money_even_though/",
        "body_summary": "OP (26M) refused to lend his friend (24F) $300 for car repair because she owes him $150 from 6 months ago and spends money on luxuries. She's angry, calling him selfish. OP asks: AITA for protecting his finances?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 120,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 120
        },
        "total_judged": 120,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-19T05:11:40.394471"
    },
    {
        "id": "1mtv097",
        "title": "AITA for asking my roommate to stop using my expensive shampoo?",
        "url": "/r/AmItheAsshole/comments/1mtv097/aita_for_asking_my_roommate_to_stop_using_my/",
        "body_summary": "OP's roommate is using OP's expensive, medicated shampoo without permission. When confronted, the roommate was dismissive. OP asked him to stop and buy his own. Now the roommate is acting passive-aggressive. AITA for wanting him to stop using my shampoo?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 99,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-19T05:11:42.539793"
    },
    {
        "id": "1mu3ann",
        "title": "AITA for not removing multiple \"scary\" posters from my room that my nephew is sleeping in?",
        "url": "/r/AmItheAsshole/comments/1mu3ann/aita_for_not_removing_multiple_scary_posters_from/",
        "body_summary": "OP(16M) is angry his brother(29M) & nephew(6M) will stay in his room. Brother wants OP to remove posters, including a \"creepy\" Death Note demon & Hozier pics, fearing they'll scare nephew. OP refuses. Mom calls him unreasonable. AITA?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 58,
            "ESH": 3,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-19T05:11:45.196154"
    },
    {
        "id": "1mtvuy3",
        "title": "AITA for refusing to pay the second half of my share for a bachelorette trip I cant attend??",
        "url": "/r/AmItheAsshole/comments/1mtvuy3/aita_for_refusing_to_pay_the_second_half_of_my/",
        "body_summary": "OP paid upfront for a bachelorette trip but now can't go due to daughter's health & a memorial. The bride, Sara, wants OP to pay the remaining balance, claiming her friends can't afford to cover OP's portion, even though it is a small amount per person. OP feels Sara is being selfish. AITA for refusing to pay?\n...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 88,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 99
        },
        "total_judged": 99,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-19T05:11:47.691910"
    },
    {
        "id": "1mu5ia5",
        "title": "AITA for calling the police on my guardian and her partner after refusal to return my school Chromebook?",
        "url": "/r/AmItheAsshole/comments/1mu5ia5/aita_for_calling_the_police_on_my_guardian_and/",
        "body_summary": "OP (15f) needed her school Chromebook from ex-guardian Sam (23). Sam refused to return it until a file was deleted. Sam's partner wouldn't give it back, so OP called police to retrieve it. AITA for involving police?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 42,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-19T05:11:50.760358"
    }
]