[
    {
        "id": "1lp9nx5",
        "title": "AITA for asking my friend to stop \"complimenting\" my postpartum body ?",
        "url": "/r/AmItheAsshole/comments/1lp9nx5/aita_for_asking_my_friend_to_stop_complimenting/",
        "body_summary": "I (31f) gave birth earlier this year. A few people have given me compliments, not sure how genuine. But I have a friend (29f) who is very blunt with her \"compliments.\" \n          She called my butt big. She said my stretch marks look \"awesome.\" She said she bet men look at me more know. I have called me chunky. She have called parts of me \"juicey.\" \n          I understand trying to make the new mommy still feel pretty but I felt uncomfortable. I asking my friend to stop complimenting my postpartum body. She looked sad and she told me she was just trying to help. She called me ungrateful and insecure. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 132,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-02T05:14:12.749391"
    },
    {
        "id": "1louk8b",
        "title": "AITA for not letting my brother move in after I caught him snooping through my stuff?",
        "url": "/r/AmItheAsshole/comments/1louk8b/aita_for_not_letting_my_brother_move_in_after_i/",
        "body_summary": "My (27M) brother (24M) recently asked if he could crash at my place for a few months. I agreed because he said he was trying to get back on his feet.\n\nOne day while I was at work, I came home early and found him going through my closet and my desk drawers. He acted like it was no big deal, said he was just “looking for headphones.” But he had literally opened sealed envelopes and moved things around.\n\nI told him I didn’t feel comfortable with him staying anymore and gave him 48 hours to find somewhere else. Now my mom is calling me heartless and says “family is family” and I should have given him another chance.\n\nAITA for kicking him out instead of just talking it through?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 70,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 74
        },
        "total_judged": 74,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-02T05:14:13.553183"
    },
    {
        "id": "1lp3t9t",
        "title": "AITA for continuing to call my future stepmom by her first name ?",
        "url": "/r/AmItheAsshole/comments/1lp3t9t/aita_for_continuing_to_call_my_future_stepmom_by/",
        "body_summary": "OP (19f) calls her dad's girlfriend/ex-dance tutor (28f) by her first name when Dad isn't around, but \"Ms. (Last Name)\" when he is, per his request. Dad dislikes her using the first name. Stepmom doesn't like mispronunciations. AITA for using both names?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 105,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-02T05:14:16.124599"
    },
    {
        "id": "1lp24yy",
        "title": "AITA because I told my ex husband he can’t get a new dog until I move out?",
        "url": "/r/AmItheAsshole/comments/1lp24yy/aita_because_i_told_my_ex_husband_he_cant_get_a/",
        "body_summary": "OP's ex wants a dog while they cohabitate post-breakup. OP said no, citing she'd care for it due to her job and her dog's dislike of others, even though the ex also cares for the existing dog. Ex guilt-tripped OP with shelter dog urgency. AITA for telling him to wait?\n...",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 80,
            "ESH": 1,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-02T05:14:18.919032"
    },
    {
        "id": "1lp6rjh",
        "title": "AITA for not letting my sister ride in my car?",
        "url": "/r/AmItheAsshole/comments/1lp6rjh/aita_for_not_letting_my_sister_ride_in_my_car/",
        "body_summary": "OP (17F) refuses to drive her sister (14F) to school because sister insists on wearing dirty cowboy boots in OP's car despite being asked not to. OP feels disrespected. AITA for not letting her ride?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 97,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 98
        },
        "total_judged": 98,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-02T05:14:21.007429"
    },
    {
        "id": "1lounar",
        "title": "WIBTA if I didn’t give my brother money for rent?",
        "url": "/r/AmItheAsshole/comments/1lounar/wibta_if_i_didnt_give_my_brother_money_for_rent/",
        "body_summary": "OP (18F) has savings for college. Her brother (20M) dropped out of school and owes $2700 in rent. Mom wants OP to pay it. OP refuses, citing brother's lack of effort and needing savings for her own education. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 109,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 111
        },
        "total_judged": 111,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-02T05:14:27.274743"
    },
    {
        "id": "1lpecq5",
        "title": "AITAH for not taking my son’s friend who is our neighbor to events and activities because he’s not potty trained?",
        "url": "/r/AmItheAsshole/comments/1lpecq5/aitah_for_not_taking_my_sons_friend_who_is_our/",
        "body_summary": "OP excludes a 9-year-old who needs help wiping from activities, citing it's not their responsibility. Other parents have been helping. OP's now seen as excluding him. AITA for setting this boundary?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 105,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-02T05:14:29.962500"
    },
    {
        "id": "1louudk",
        "title": "AITA for calling my older brother out at a very important family meeting",
        "url": "/r/AmItheAsshole/comments/1louudk/aita_for_calling_my_older_brother_out_at_a_very/",
        "body_summary": "OP's brother has ignored/mistreated her for 1.5 years. After he ignored her at a family meeting about their father, OP confronted him, expressing her hurt and frustration. She now feels like an AH. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 18,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 21
        },
        "total_judged": 21,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-02T05:14:31.302171"
    },
    {
        "id": "1lotlrv",
        "title": "AITA for telling the bride’s stepmom she can’t steal wine from behind the bar?",
        "url": "/r/AmItheAsshole/comments/1lotlrv/aita_for_telling_the_brides_stepmom_she_cant/",
        "body_summary": "OP, a bartender, stopped a wedding guest (bride's stepmom) from taking a wine bottle from behind the closed main bar. The guest claimed entitlement and insulted OP. Management addressed the guest's behavior. AITA for confronting the guest?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 27,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-02T05:14:32.556662"
    },
    {
        "id": "1lpe9mp",
        "title": "AITA for telling my friend to STOP telling me about his \"jealousy\" of women, especially lesbians ?",
        "url": "/r/AmItheAsshole/comments/1lpe9mp/aita_for_telling_my_friend_to_stop_telling_me/",
        "body_summary": "I (23f) am a lesbian and I have a friend (23m) who is straight. He hates being a man but he promises he isn't trans. According to him, women are divinely beautiful and we don't have to try to be beautiful. To him, men are physically gross and no non-delusional man can ever feel as beautiful as a woman. He talks about wishing he was born a girl. \n                 I feel sad during and after listening to him. I feel anxious because I don't want to do anything to make him feel worse. I told him to stop telling me about his \"jealousy\" of women, especially lesbians. He said I was being a bad friend because I'm the only one he can talk to. He said no professional can help him but they can't make him born a girl. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 33,
            "ESH": 0,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-02T05:14:33.310256"
    }
]