[
    {
        "id": "1r9oqs5",
        "title": "AITA for not wanting to go on vacation with my boyfriend and his two adult daughters?",
        "url": "/r/AmItheAsshole/comments/1r9oqs5/aita_for_not_wanting_to_go_on_vacation_with_my/",
        "body_summary": "My boyfriend and I have been together for four years. He has two adult daughters and I have two adult sons. His daughters were not very accepting of me in the beginning, but he says they like me. His youngest daughter makes digs at me and can be very rude and condescending. If I say something is nice she says it’s not. His oldest daughter is very controlling. She directs the rest of us around and tells us what we are doing when we are doing it… In the past when we’ve gone on vacation together, he would have me research and find activities to do wherever we’re going. Then we’d end up doing whatever his oldest daughter wants to do. She will often plan things that I’m not physically able to do.  \n\nHe’s always asking me where I’d like to go on vacation or what I’d like to do. I’ve mentioned se...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 67,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 76
        },
        "total_judged": 76,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-21T05:35:10.793904"
    },
    {
        "id": "1r9u9t4",
        "title": "AITAH for saying NO to my bestfriend and her boyfriend to stay over at my house?",
        "url": "/r/AmItheAsshole/comments/1r9u9t4/aitah_for_saying_no_to_my_bestfriend_and_her/",
        "body_summary": "Let’s start. Context: My (F21) best friend (F20) has been dating this guy (M21) for a year now. We are all in uni together, she lives with her parents and he lives in a dorm so they do not have any privacy for spending time together (if you know what I mean).\n\nThe boyfriend is kind of an inconsiderate person. He is very emotionally distant, has no clear boundaries with his female friends which makes my bestfriend very uncomfortable all the time. He ghosts her, tries breaking up randomly, then is EXTREMELY loving towards her all of a sudden. He is definitely toxic.\n\nThe thing is, she is so blinded that she cannot see how much bad stuff is. I try talking to her but it’s of no use. Anyways, that’s not the point.\n\nMy family has a farmhouse, 1 hour from the city. The boyfriend, who I am not eve...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 44,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-21T05:35:18.420379"
    },
    {
        "id": "1r9psc6",
        "title": "AITA for refusing to let my sister bring her kids to my wedding",
        "url": "/r/AmItheAsshole/comments/1r9psc6/aita_for_refusing_to_let_my_sister_bring_her_kids/",
        "body_summary": "I'm getting married in a little over 2 months, and my fiancée is adamant about not having kids at the wedding (it's a very HARD no). I am of course backing her, as I don't really have a strong opinion either way, but I know she'll be more stressed out if there are kids running about at the venue.\n\nMy sister has 2 toddlers and is traveling cross-country to be at the wedding, but now she is sort of dropping the problem of what to do with her kids on us. Saying \"I hope you don't have too big of an issue when I bring them along\".\n\nI get that it's far away and there's limit babysitting options (if she trusted anyone with her kids) but is it my responsibility to cater for her kids so she can come to my wedding?\n\nUpdate:\nI should disclaim we only officially said no kids in the invites we sent abo...",
        "reddit_judgments": {
            "YTA": 87,
            "NTA": 19,
            "ESH": 5,
            "NAH": 4,
            "INFO": 4,
            "TotalJudged": 119
        },
        "total_judged": 119,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-21T05:35:30.740415"
    },
    {
        "id": "1racusm",
        "title": "AITA for refusing to chip in for my friend's petrol/parking costs after she insisted on being DD but started drinking anyway?",
        "url": "/r/AmItheAsshole/comments/1racusm/aita_for_refusing_to_chip_in_for_my_friends/",
        "body_summary": "Last night I went out with a few friends (group of 5 girls all around 23 years old). Before we left, Madeline (my best friend's friend, not super close to me) offered to be the designated driver and said she wasn’t in the mood to drink. I suggested we all just take the train into the city and split an uber back so no one felt left out if anyone wanted to drink. She was adamant that she wouldn’t feel left out and insisted on driving everyone home sfaely. I didn’t want to argue with someone volunteering as DD so I just said okay and didn't think anything about it.\n\n\n\nJust before midnight I noticed she’d started drinking (a couple cocktails). I didn’t say anything because I was fine splitting an uber anyway so I just enjoyed the rest of the night with the girls.\n\n\n\nThis morning she drops in t...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 55,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 57
        },
        "total_judged": 57,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-21T05:35:38.718174"
    },
    {
        "id": "1r9trzb",
        "title": "AITA for moving my roommates dirty dishes outside her room and embarrassing her in front of her friends?",
        "url": "/r/AmItheAsshole/comments/1r9trzb/aita_for_moving_my_roommates_dirty_dishes_outside/",
        "body_summary": "I (22F) live with my university roommate (21F). We’ve been living together for about 7 months. We aren’t super close, but things were fine when we first started living together.\n\nThe ongoing issue has been cleanliness in our shared spaces. I’m not a clean freak, but I like the kitchen and bathroom to be usable. My roommate regularly leaves dishes in the sink for days, sometimes close to a week and they begin to smell. Food gets left on the counter overnight, the trash overflows, and I’ve had to clean hair out of the shower drain multiple times because it just doesn’t get done unless I do it.\n\nI’ve brought it up several times and have even suggested a cleaning schedule. I asked if she could at least rinse dishes and take out the trash when it’s full to help me out since we’re both studying ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 65,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-21T05:35:46.383732"
    },
    {
        "id": "1r9v158",
        "title": "AITA for refusing to give my gaming PC to my younger",
        "url": "/r/AmItheAsshole/comments/1r9v158/aita_for_refusing_to_give_my_gaming_pc_to_my/",
        "body_summary": "I (17M) have been saving up for over a year to build my own gaming PC. I worked weekends and did small side jobs to afford it. It’s not insanely high-end, but it runs the games I like smoothly and I’m really proud of it because I paid for every part myself.\nLast weekend, my aunt and uncle came over with their 13-year-old son. He saw my setup and immediately started asking about it. I showed him a few games and he loved it. Later that night, I overheard my aunt telling my mom that I “don’t really need something that powerful” and that it would mean a lot if I gave it to my cousin since “he’d appreciate it more.”\nThe next day my mom asked me if I’d consider giving it to him since I could “always build another one later.” I said no. I worked hard for it and I don’t think it’s fair to just han...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 116,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 121
        },
        "total_judged": 121,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-21T05:35:55.368166"
    },
    {
        "id": "1ra2m27",
        "title": "AITA for telling a mother to put her phone away?",
        "url": "/r/AmItheAsshole/comments/1ra2m27/aita_for_telling_a_mother_to_put_her_phone_away/",
        "body_summary": "I was coming out of Costco today and walking through the parking lot toward my car. A mother and toddler got out of a car and the mother was looking at her phone. The toddler was running ahead of her probably 25-30 feet down the parking lot aisle. She just yelled at him to slow down, but continued to stare at her phone. I stopped and watched the toddler, making sure no cars were backing out because there was no way they would see him. That's when I told her to put her phone away and pay attention to her kid. She didn't like that and told me F off.\n\nAs a motorcycle rider, I am hyper sensitive to people who are staring at their phone rather than paying attention to the road. There have been numerous times where cars have encroached into my lane even though I ride a large orange motorcycle wh...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 46,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-21T05:36:03.357926"
    },
    {
        "id": "1r9o71w",
        "title": "AITA for not checking if my roommate wanted food when I ordered some",
        "url": "/r/AmItheAsshole/comments/1r9o71w/aita_for_not_checking_if_my_roommate_wanted_food/",
        "body_summary": "This one is a bit silly, I get that. But little things like this keep happening between me and my friend who I moved in with a few weeks ago. We always got along great for years before this, but I feel like this little spats are just really petty and I'm not really doing anything wrong. But maybe I am actually the AH, because stuff like this keeps happening and I'm getting sick of silly arguments. I am open to the fact that I might be the problem and maybe I'm just not a good roommate. \n\nSo for context. I moved in with a long time friend (we've known each other 3 years). I'll called her Abby. This is the first time I've ever lived with a friend, I've always lived alone or with family. I have followed the chore chart she made, learned all her rules about shoes in the house and outside cloth...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 42,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-21T05:36:10.932430"
    },
    {
        "id": "1r9wq0s",
        "title": "AITA because I dont want to leave an hour early?",
        "url": "/r/AmItheAsshole/comments/1r9wq0s/aita_because_i_dont_want_to_leave_an_hour_early/",
        "body_summary": "My husband (73) has recently had some health problems that necessitated several appointments with various doctors. He prefers for me to drive him, although he can drive himself.\n\nToday's appointment was for an Xray at our regular medical facility, which is about 1½ miles from our home. It was set for 9:40 (which at the time I write this, is still 20 minutes away.). At 8:45 he started agitating that I should get ready to go. Due to his military background, he sees being at an appointment on time, or up to 20 minutes before, is \"almost late.\" \n\nI refused. I said I would get ready at 9:15, which for a drive time of 5 minutes still leaves him plenty of time. \n\nHe got mad at me and grabbed his keys, stomped out of the house, and has driven himself. \n\nIs refusing to sit in for 45 minutes in a do...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 52,
            "ESH": 1,
            "NAH": 4,
            "INFO": 3,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-21T05:36:18.739864"
    },
    {
        "id": "1radixx",
        "title": "AITA for not giving my docked city scooter to a guy for free after he asked and said he had no credit?",
        "url": "/r/AmItheAsshole/comments/1radixx/aita_for_not_giving_my_docked_city_scooter_to_a/",
        "body_summary": "I don’t know if city scooters are everywhere but in my city you unlock them with the app and it charges a small deposit (like $1 or $2 equivalent) to your card when you start, then refunds it when you properly dock and end the ride. It’s supposed to stop people from just leaving them in random places.\n\nThere’s kind of an unspoken thing where if someone asks for your scooter after you’re done, you hand it over unlocked (or give them the QR code) and they give you their deposit amount in cash/app transfer or whatever. Saves them walking to another dock.\n\nToday I rode one to my destination, docked it properly to end the ride and get my deposit refund processed. This guy comes up right after and says “hey can I take this one?” I said sure, but do you have the deposit ready? He said no, he’s ou...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 18,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 18
        },
        "total_judged": 18,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-21T05:36:26.193498"
    }
]