[
    {
        "id": "1mn59nx",
        "title": "AITA for only taking care of my kid",
        "url": "/r/AmItheAsshole/comments/1mn59nx/aita_for_only_taking_care_of_my_kid/",
        "body_summary": "OP, divorced from Amy, no longer wants to financially support Amy's daughter Ella (6), whom he helped raise during their marriage. OP pays child support for their daughter Wynne (18mo), and enjoys taking Wynne on outings. Amy feels OP is abandoning Ella and being unfair. OP's mom agrees. AITA for not supporting Ella anymore?\n...",
        "reddit_judgments": {
            "YTA": 80,
            "NTA": 51,
            "ESH": 2,
            "NAH": 2,
            "INFO": 6,
            "TotalJudged": 141
        },
        "total_judged": 141,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-12T05:12:42.537508"
    },
    {
        "id": "1mnexmd",
        "title": "AITA for lying to my gf about the time we're supposed to arrive for an event?",
        "url": "/r/AmItheAsshole/comments/1mnexmd/aita_for_lying_to_my_gf_about_the_time_were/",
        "body_summary": "OP's GF is often late due to various factors. OP lied about an event's start time to get her ready faster, leading to a fight. AITA for lying to get my GF to be on time?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 123,
            "ESH": 1,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-12T05:12:48.106192"
    },
    {
        "id": "1mnjm1v",
        "title": "AITA if I gave my best friends kids a different lifechanging amount of money?",
        "url": "/r/AmItheAsshole/comments/1mnjm1v/aita_if_i_gave_my_best_friends_kids_a_different/",
        "body_summary": "OP plans to gift life-changing money to her friend and her kids via trusts, but wants to give 12f significantly more than 2m due to 12f's difficult past and OP's close bond. OP fears her friend will perceive bias. AITA for gifting different amounts?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 72,
            "ESH": 0,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 80
        },
        "total_judged": 80,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-12T05:12:52.184911"
    },
    {
        "id": "1mnb1f9",
        "title": "AITA for choosing my best friend as my best man instead of my step brother?",
        "url": "/r/AmItheAsshole/comments/1mnb1f9/aita_for_choosing_my_best_friend_as_my_best_man/",
        "body_summary": "OP chose his close friend, Charles, as best man over his distant step-brother, Pete. Pete and OP's stepmom are now refusing to attend the wedding unless OP makes Pete best man. OP's dad also wants OP to appease Pete. AITA for sticking with Charles?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 150,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 152
        },
        "total_judged": 152,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-12T05:12:54.752913"
    },
    {
        "id": "1mng418",
        "title": "AITA for not buying personal care products for my stepsister?",
        "url": "/r/AmItheAsshole/comments/1mng418/aita_for_not_buying_personal_care_products_for_my/",
        "body_summary": "OP's stepsister is forced to use only natural products. She hates it & wants \"chemical\" products for acne, periods, & hair removal. She asked OP to buy them using OP's allowance. OP doesn't want to spend their money. AITA if I don't buy her the products?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 74,
            "ESH": 0,
            "NAH": 10,
            "INFO": 1,
            "TotalJudged": 88
        },
        "total_judged": 88,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-12T05:12:57.509669"
    },
    {
        "id": "1mnkit6",
        "title": "AITA for refusing to let my brother come over to my apartment?",
        "url": "/r/AmItheAsshole/comments/1mnkit6/aita_for_refusing_to_let_my_brother_come_over_to/",
        "body_summary": "OP (20F) won't let her autistic, non-verbal brother (7M) visit after he peed on her new couch. She'd redirected him before, but this time she drew the line. Her parents are angry, calling her selfish. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 30,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-12T05:12:58.726766"
    },
    {
        "id": "1mnsbjr",
        "title": "AITAH my roommate says I can't move out until after her wedding",
        "url": "/r/AmItheAsshole/comments/1mnsbjr/aitah_my_roommate_says_i_cant_move_out_until/",
        "body_summary": "OP's apt had mold & dog died. Ex offered housing. Roommate \"Kate\" upset when OP gave 7-week notice to move back into her remediated apt due to unemployment & cost. Kate, wedding planning, threatened to keep OP's deposit for moving out. AITAH for not delaying move to accommodate Kate?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 50,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-12T05:13:00.347770"
    },
    {
        "id": "1mn4hb4",
        "title": "AITA for refusing a \"gift\"",
        "url": "/r/AmItheAsshole/comments/1mn4hb4/aita_for_refusing_a_gift/",
        "body_summary": "OP's MIL offered her old coffee cups, saying OP \"didn't have enough.\" OP refused, stating she didn't want old cups. OP feels MIL gives unwanted, used items as afterthoughts (expired snacks, unwanted cookbook). AITA for refusing the cups?\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 52,
            "ESH": 1,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-12T05:13:02.407562"
    },
    {
        "id": "1mnoh11",
        "title": "AITA for refusing to set up a Go Fund Me for an upper middle class family when their young adult child died. There was medical insurance in place and minimal burial expenses. They post pics of expensive vacations and I did not feel right asking friends to fund this for a family with means.",
        "url": "/r/AmItheAsshole/comments/1mnoh11/aita_for_refusing_to_set_up_a_go_fund_me_for_an/",
        "body_summary": "When close family friends tragically lost their adult child, they asked me if I would be the one to set up a Go Fund Me. They are upper middle class, their adult child had medical insurance and cremation costs were minimal. They are big social media posters of expensive vacations and activities. I said no to creating the account and suggested if the family wanted to collect money they should set up the account themselves. I felt very uncomfortable asking the community of friends who were mostly young adults just starting out or families with less income than my friends who were asking for charity.",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 36,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-12T05:13:02.827402"
    },
    {
        "id": "1mnv5xu",
        "title": "AITA for telling my sister either she washes her hair before my wedding or she's not going to be a bridesmaids ?",
        "url": "/r/AmItheAsshole/comments/1mnv5xu/aita_for_telling_my_sister_either_she_washes_her/",
        "body_summary": "I'm (29f) getting married Saturday 16th of August 2025. My sister (25f) is one of my bridesmaids. She has very long beautiful hair. According to my sister, the last time she washed her hair was the 6th of August, and she's not planning on washing it before the 20th. \n            She works at a job which causes her to be sweating all day. Today, her hair already smells and looks greasy, I can't imagine what it happen on my wedding day. I gave her the ultimatum and she called me that cliche overused term, a bridezilla. She is still welcomed at my wedding either way. Am I bridezilla ? Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 48,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-12T05:13:03.794917"
    }
]