[
    {
        "id": "1rcqf4x",
        "title": "AITA my friend ruined my yixing teapot and I want her to replace it or give me 500 dollars.",
        "url": "/r/AmItheAsshole/comments/1rcqf4x/aita_my_friend_ruined_my_yixing_teapot_and_i_want/",
        "body_summary": "When I went to china I bought myself a yixing teapot. This is a clay unglazed pot that gets “seasoned” the more you make tea in it. Kinda like a cast iron pan. Since it is unglazed you can not wash it with soap, or any rough sponges. \n\nYou clean it by using hot water and then you let it air dry. Nothing else. This is the issue, I left for a work trip and my friend watched my cat. ( I paid her) I told her she can use anything in the kitchen.\n\nMy yixing teapot is not in the kitchen and neither are any of my fancy loose leaf teas for it. I have a normal kettle in the kitchen for guests to use.\n\nI can back and found the yixing teapot in my sink and it smells like soap. It also has multiple scratched on the inside.\n\nI called her up and she told me she used it becuase she loved the tea I make wi...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 123,
            "ESH": 0,
            "NAH": 5,
            "INFO": 5,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-24T05:53:07.693834"
    },
    {
        "id": "1rcidee",
        "title": "AITA for “decorating” my son/DIL home by giving my son a dresser for their nursery.",
        "url": "/r/AmItheAsshole/comments/1rcidee/aita_for_decorating_my_sondil_home_by_giving_my/",
        "body_summary": "edit: for fucks sakes, she is pregnant and overreacted ( it happens) shes not the devil. Not she isn’t going to throw it away, no she isn’t abusing my son , no she isn’t evil. No the marriage isn’t going to end over this…\n\nif you are going to call her a bitch or make rediclous assumptions don’t comment\n\n———————\n\nGrowing up my son had a dresser that was made by my father. He was a very good woodworker and the dresser has hand carved details. It is a very nice dresser. \n\nMy son loved it and was going to take it with him when he moved out, sadly due to a tornado the dresser was very badly damaged when our roof fell. So when he moved out after college their was not reason to take the busted dresser and it stayed in our new garage collecting dust. I could  not bring my self to toss it. \n\nMy son...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 133,
            "ESH": 5,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-24T05:53:17.519822"
    },
    {
        "id": "1rcwq20",
        "title": "AITA for telling my husband I want to move into the house I inherited instead of staying with his parents",
        "url": "/r/AmItheAsshole/comments/1rcwq20/aita_for_telling_my_husband_i_want_to_move_into/",
        "body_summary": "I(F29) am married to R(31M). Where we live it is tradition for bride to move in with the groom and his parents until we have our first child\n\nNow one of the problems with living with my in-laws is that my MIL is so unbearable. She gets annoyed at the smallest things possible. And then we  have to wait for my SIL (F22) to get married so we can start having children as there isn't enough space(she’s getting married by the end of this year). And if we want more than one kid (which we do) we also have to wait for my in-laws to die because the house is that small. \n\nYes I knew all these before getting married but my husband assured me he won’t let his parents impose that on me. If we both agree he can talk to his parents and we move out but now he’s having cold feet. I mean if your parents are ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 126,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-24T05:53:26.117827"
    },
    {
        "id": "1rcfqfn",
        "title": "AITA for refusing to give my sister my old engagement ring after my divorce?",
        "url": "/r/AmItheAsshole/comments/1rcfqfn/aita_for_refusing_to_give_my_sister_my_old/",
        "body_summary": "I (30F) had a divorce last year. It was mutual, notting dramatic. I kept the engagement ring since I help pay for it (we split the cost because we're young and we're both on our first job). And honestly I just wasn’t ready to get rid of it yet. Even if it didn't work out I still value the ring.\n\nMy younger sister (25F) just got engaged. Her fiance doesn’t make much money but he proposed with a really cute but simple ring. My sister recently asked if she could buy my engagement ring for a lower price since I’m not using it anymore. It would also save them money to upgrade her ring later on (they want to get a \" nicer ring\" later on).\n\nI was a little shocked and told her no. I don't wear it but I don't want to sell it either. She said it’s weird and “emotionally unhealthy” that I’m holding o...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 144,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-24T05:53:34.855848"
    },
    {
        "id": "1rc9kob",
        "title": "AITA for exposing my ex-best friend after he tried to set me up with the same girl we fell out over?",
        "url": "/r/AmItheAsshole/comments/1rc9kob/aita_for_exposing_my_exbest_friend_after_he_tried/",
        "body_summary": "So me and my former best friend haven’t talked in months. We fell out because of drama involving his current girlfriend (yes, the same girl in this story).\n\nOut of nowhere he texts me asking to hang out. I thought it was random but whatever. Later that day he keeps telling me to text his girlfriend. I said no like 5–6 times because it felt weird. I didn’t want to get involved in their relationship, especially since that’s literally what caused our friendship to end before.\n\nI’m not into her at all. I was actually thinking about asking out her sister at one point, so I had zero reason to try anything. But he kept pushing and pushing. So I finally sent her a simple “hey, are you okay?” message. She replies normally.\n\nThen I find out he told her not to respond to me if I ever texted her. So b...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 23,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-24T05:53:42.489869"
    },
    {
        "id": "1rchkn4",
        "title": "AITA for being my little sister's \"getaway car\"?",
        "url": "/r/AmItheAsshole/comments/1rchkn4/aita_for_being_my_little_sisters_getaway_car/",
        "body_summary": "I (24F) have a younger sister \"Marisa\" (13F). She's at that age where she's starting to mature and turning into a social butterfly. Our parents hate it. We live in a small town with a low crime rate, but they're afraid of \"pack mentality\" and think she'll make stupid decisions if she's out with a group of kids in public, without adult supervision. \n\nMarisa recently texted me and asked me if I could drive her to the diner. It was mid-morning, and she was going to brunch with friends (apparently 13 year olds love brunch, who knew?) so I said yes. When I picked her up, it became very apparent that she was sneaking out. I didn't say a word about it, drove her to the diner. I stayed close by and then drove her back home - she tried to sneak back in and got caught. They didn't know she was gone ...",
        "reddit_judgments": {
            "YTA": 23,
            "NTA": 39,
            "ESH": 4,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-24T05:53:50.502174"
    },
    {
        "id": "1rclc1e",
        "title": "AITA  for charging my friend for the snacks she keeps sampling from my room?",
        "url": "/r/AmItheAsshole/comments/1rclc1e/aita_for_charging_my_friend_for_the_snacks_she/",
        "body_summary": "So I (19f) live in a dorm with two other girls. We’re all pretty chill, but I’m definitely the one who keeps a mini fridge and a snack drawer stocked. I work a part time job as a student assistant, so I pay for all my own food. My friend (let's call her Jen) (19f) is in my room basically 24/7. She’s super sweet, but she has this habit of \"sampling\" my snacks. It’s never a whole bag of chips or a full soda. It’s always can I just have a handful of those? or can I take one sip of that? which is kinda annoying. At first, I didn't care. But it’s been months and it adds up. Last week I bought a specific pack of expensive imported ramen I’ve been wanting to try, and I came back from class to find the pack open and literally HALF the noodles gone. Jen was like \"oh I just wanted a bite to see if I...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 64,
            "ESH": 7,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-24T05:53:58.820363"
    },
    {
        "id": "1rcv8ya",
        "title": "AITA for stepping down as best man because I can’t afford my brother’s bachelor party plans?",
        "url": "/r/AmItheAsshole/comments/1rcv8ya/aita_for_stepping_down_as_best_man_because_i_cant/",
        "body_summary": "I (26M) am supposed to be the best man for my older brother (29M) this coming month. I love him, but he has always had champagne taste on a tap water budget, and he is obsessed with projecting a certain lifestyle on Instagram.\n\nLast night, he called an emergency Zoom meeting with the groomsmen to discuss his bachelor party. I assumed we were going to rent a cabin, grill some steaks, and maybe go to a local brewery. Instead, he shared his screen and presented a literal PowerPoint for a four-day \"\"\"\"VIP\"\"\"\" bender in Las Vegas.\n\nThe plan includes splitting a penthouse suite, booking premium bottle service at two different nightclubs, and renting exotic cars for one afternoon. After the call, he emailed us a breakdown of costs. My share of the weekend, not including my own flights or gambling...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 101,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-24T05:54:06.857774"
    },
    {
        "id": "1rcyamu",
        "title": "AITA for refusing to let my MIL hold my baby because she reeked of cigarettes?",
        "url": "/r/AmItheAsshole/comments/1rcyamu/aita_for_refusing_to_let_my_mil_hold_my_baby/",
        "body_summary": "I'm currently hiding in the nursery because my husband is on the phone with his mother and honestly I'm shaking. I have a 3-month-old daughter and I've been very clear about my boundaries regarding smoking. My MIL is a heavy smoker and today she just showed up without calling first. She smelled so strongly of cigarettes it was making my eyes water from across the hall. She immediately tried to grab the baby out of the bouncer and I blocked her. I told her point blank that she couldn't hold her while smelling like that and that it’s a health risk for the baby’s lungs. She absolutely lost it. She started screaming that I’m a \"controlling brat\" and that she raised her own kids just fine in a house full of smoke. I told her times have changed and until she showers and changes her clothes she i...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 124,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 125
        },
        "total_judged": 125,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-24T05:54:14.956618"
    },
    {
        "id": "1rcof0b",
        "title": "AITA for not giving my parents extra wedding invites for extended family?",
        "url": "/r/AmItheAsshole/comments/1rcof0b/aita_for_not_giving_my_parents_extra_wedding/",
        "body_summary": "I’m 25F and getting married later this year. My fiance and I are paying for about 80% of the wedding ourselves. My parents offered a their contribution, which we appreciate.\n\nWe’re having a smaller venue and already had to cut down our list to close friends and immediate family. It wasn’t easy.\n\nNow my mom is asking for 4 additional invites for relatives I barely talk to. One of them is a cousin who openly mocked me at a previous family gathering and tends to make passive aggressive comments.\n\nI told her we simply don’t have space and that we prioritized people who are actively in our lives. She said that since they’re contributing financially, they should get some say in who attends.\n\nI offered to return their contribution if it means we can keep the guest list as it is but now she says I...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 73,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-24T05:54:22.868185"
    }
]