[
    {
        "id": "1qdqppl",
        "title": "AITA for disinviting a friend to my birthday after she showed me the food she was bringing?",
        "url": "/r/AmItheAsshole/comments/1qdqppl/aita_for_disinviting_a_friend_to_my_birthday/",
        "body_summary": "Hi guys, im using a throwaway for this one.\n\nSo basically I (17f) am having my 18th at my house. It’s jsut a dinner with my closest friends. I told everyone they may bring food if they like but im going to doing little cooking like some bbq food and then ordering pizza. My guy friend (“Ryan”) asked if he can bring a mutual friend we have (“Emily”)since they’re dating now. I told him yea sure because he was gonna leave early anyway. She offered to make food and I told her that would be really nice but she didn’t have to. She insisted.\n\nI made a group chat of people coming and I invited Emily to it. I sent a message talking about when to come, to wear whatever. An important thing in the message was about allergies. I have a friend coming with a really serious nut allergy. I’ve never seen the...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 165,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 167
        },
        "total_judged": 167,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-16T05:18:23.535381"
    },
    {
        "id": "1qdmm1l",
        "title": "AITA for telling my kid that she is being self-centered/cruel because  her mom  won’t be able to make to her wedding.",
        "url": "/r/AmItheAsshole/comments/1qdmm1l/aita_for_telling_my_kid_that_she_is_being/",
        "body_summary": "My daughter (28) wedding is tomorrow. The problem is that my wife’s dad is in the hospital. He has always been frail since he was moved into a home and it took a turn for the worse and now he is in the hospital.  They don’t think he will make.  My wife sister say it looks bad and she also isn’t coming up for the wedding anymore.\n\nThe original plan was for him to fly up for the wedding today ( with the help of my wife’s sister), but he was hospitalized yesterdays and he is just getting worse. My wife has been distraught and she made the decision to go fly down ( she is leaving tonight) \n\nIt was tough decision because she will miss the wedding. I told her I will FaceTime her in for the ceremony and anything else but to go be with her dad before he dies. I also now she would be miserable if s...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 116,
            "ESH": 10,
            "NAH": 22,
            "INFO": 4,
            "TotalJudged": 158
        },
        "total_judged": 158,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-16T05:18:49.027008"
    },
    {
        "id": "1qdm7ix",
        "title": "AITA for not giving my vacation day to a coworker getting married",
        "url": "/r/AmItheAsshole/comments/1qdm7ix/aita_for_not_giving_my_vacation_day_to_a_coworker/",
        "body_summary": "My job does vacation days by seniority and we submit the bulk of our vacation requests at the same time every year.  So you kind of need to plan ahead if you have big plans, or you need to work around the days that are still available after we submit all our leave requests.  \n\nWhen we did this process in March of 2025, I submitted a request for the day after MLK day in January 2026.  The day after a holiday is brutal at my job, there is a lot more work to do and you are often stuck there late.  I have frequently tried to get the day after a federal holiday off.  Lucky me, there was one slot available and I was the only person to request it, so I got it.\n\nFast forward to December of 2025, and a coworker approaches me and tells me she is getting married.  This is top secret info and she is o...",
        "reddit_judgments": {
            "YTA": 16,
            "NTA": 108,
            "ESH": 1,
            "NAH": 7,
            "INFO": 1,
            "TotalJudged": 133
        },
        "total_judged": 133,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-16T05:19:08.993393"
    },
    {
        "id": "1qdbaky",
        "title": "AITA Friend says I’m stealing from the homeless?",
        "url": "/r/AmItheAsshole/comments/1qdbaky/aita_friend_says_im_stealing_from_the_homeless/",
        "body_summary": "I posted a haul from the food pantry because I was genuinely excited to finally have food. I had an interview with them and was accepted for one meal a day and one grocery pickup a week.\n\nA friend of mine is upset and says I’m “stealing from the homeless.” We don’t even talk often.\n\nFor context: my boyfriend and I make about $1,900 a month combined. Our rent alone is $1,400, that’s not including car insurance, gas, utilities, or anything else. By the end of the month, we’re left with pennies just trying to survive.\n\nI’m 23, and somehow my friends think I’m doing something wrong because I don’t ask my parents or my wealthy grandparents for food. I have asked before, but I’m not comfortable having to ask every single week just to eat.\n\nI don’t understand how being relieved and excited about ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 128,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-16T05:19:26.808498"
    },
    {
        "id": "1qdpg5u",
        "title": "AITA for how coldly I'm going about leaving my roommate and our living situation?",
        "url": "/r/AmItheAsshole/comments/1qdpg5u/aita_for_how_coldly_im_going_about_leaving_my/",
        "body_summary": "My (25F) roommate (26F) has been struggling with her mental health, and it’s been giving me immense caretaker burnout. When I try to help her, she would come up with excuses why those things wouldn’t work. So I recently told her I’m moving out.\n\nHere's where I know I'm TA, and I don't need judgment passed on this one: I told her during a bad time, and in a mean way. I let my emotions and my pride get the better of me. I yelled at her mid-crashout (both hers and mine, frankly), gave her the resources to a crisis center, and told her that that was the last thing I was doing for her, because I was moving out at the end of February.\n\nI spent the weekend cooling off. Most of all, I just felt shame. I texted her to apologize, telling her that she didn't deserve the stern way in which I treated h...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 91,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 92
        },
        "total_judged": 92,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-16T05:19:42.882325"
    },
    {
        "id": "1qdqq9x",
        "title": "AITA for Removing Friend from Costly Activities for Not Paying Child Support (Edited for Length)",
        "url": "/r/AmItheAsshole/comments/1qdqq9x/aita_for_removing_friend_from_costly_activities/",
        "body_summary": "In Oct, I found out that a decade+ long friend (were each other’s best man in wedding) was 7 mos behind on CS and told his ex, “You’ll get it when you get it.”  I had been distancing myself from him based on other personal decisions he was making related to co-parenting after years-long attempts at intervention, advice and offering help, but when our fantasy league/friend group was discussing an expensive out-of-state trip, he immediately replied with enthusiasm, declaring his certain participation.  This prompted me to subtly reveal his delinquency and that he shouldn’t be spending this type of money when he owes CS.  When this went unacknowledged and he further pursued the trip, I was more overt.  When confronted with this fact, he stated “It happened.  Not for lack of funds.”  He downpl...",
        "reddit_judgments": {
            "YTA": 18,
            "NTA": 69,
            "ESH": 7,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 97
        },
        "total_judged": 97,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-16T05:19:59.309225"
    },
    {
        "id": "1qdj7er",
        "title": "AITA for refusing to lend money to a friend when I can afford it?",
        "url": "/r/AmItheAsshole/comments/1qdj7er/aita_for_refusing_to_lend_money_to_a_friend_when/",
        "body_summary": "Hi, i have a stable job and enough savings that I can probably lend the money without it ruining me. That said, this friend has a history of poor financial decisions and still hasn’t fully paid me back from a previous short-term loan. When I refused, he started accusing me of acting superior and said real friends help no matter what. A few mutual friends are now pressuring me after he told them the skewed story, so I’m genuinely unsure AITA?",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 136,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 138
        },
        "total_judged": 138,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-16T05:20:01.240690"
    },
    {
        "id": "1qdolfp",
        "title": "AITA for refusing to redo a favor because someone changed their mind last minute?",
        "url": "/r/AmItheAsshole/comments/1qdolfp/aita_for_refusing_to_redo_a_favor_because_someone/",
        "body_summary": "I offered to help a coworker move a few boxes into their new apartment after work. They said it wouldn’t take long maybe 30 minutes and I agreed because I had the time and wanted to be helpful. After work, I drove over, helped carry everything upstairs, and we finished in about the time promised. Before I left, they thanked me and said they were all set. About an hour later, after I was already back home, they messaged me saying they had decided to rearrange the apartment and wanted me to come back and move everything again because it would be faster with two people. I told them I couldn’t come back. I had already helped, had settled in for the night, and hadn’t agreed to multiple trips or redoing the work. They got upset and said I was being unhelpful and that they wouldn’t have asked in ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 54,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-16T05:20:16.931650"
    },
    {
        "id": "1qdo896",
        "title": "AITA for not wanting my kids to call their dad's girlfriend \"mom\"?",
        "url": "/r/AmItheAsshole/comments/1qdo896/aita_for_not_wanting_my_kids_to_call_their_dads/",
        "body_summary": "AITA for not wanting my kids to call their dad's girlfriend \"mom\"? \n\nI share 50/50 custody of my children with their father but I have all decision making regarding education, and medical with very little or no involvement from him.  My children are 9 and 11 years old.  Their dad and I split up 8 years ago.  He started dating his girlfriend 5 years ago and just recently bought a house. \n\n This past weekend I found out they require the kids (she has 2 of her own around the same ages) to call him dad and her mom when they're at their house. I have only spoken to my ex's girlfriend a handful of times in the 5 years they've been together.  They don't attend any doctors appointments or school events, no birthday parties or even help with things like hot lunches, sports, basic needs like shoppin...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 47,
            "ESH": 5,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-16T05:20:32.830813"
    },
    {
        "id": "1qdighv",
        "title": "AITA for hesitating to give most of my first salary away even though it’s a tradition",
        "url": "/r/AmItheAsshole/comments/1qdighv/aita_for_hesitating_to_give_most_of_my_first/",
        "body_summary": "I (22F) just started working in Singapore, i landed this job in December. I’m currently on probation and earning 2.5k a month. Most of my expenses are pretty fixed like rent, food, and transport, etc. My job requires me to take public transport a lot, so my transport alone is like 200$ last month , which I can’t really cut. On top of that, I still have about 20k in study loans, paying back around 300$ per month plus like 70–80 interest. I also borrowed around 1k from a relative for my flat deposit, which I’m trying to pay back too. My main goal right now is just to clear these debts as fast as I can so they don’t cling on me forever.\n\nJust yesterday my parents called and asked why I didn't send any of my salary back to my home to pay homage to elders and keep up with the respect-paying tra...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 52,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-16T05:20:48.892550"
    }
]