[
    {
        "id": "1oxs22j",
        "title": "AITA for offering my cousin to stay without asking my wife? She does the same thing with her family.",
        "url": "/r/AmItheAsshole/comments/1oxs22j/aita_for_offering_my_cousin_to_stay_without/",
        "body_summary": "I (27M, Indian) live in Prague, Czech Republic with my wife (28F), who is Czech. We both work and own a two bedroom flat. Till Now, the second bedroom is basically our guest room. She has a lovely family and either her parents or younger sister visits pretty often, usually for around 2–3 days every 2-3 months. She always informs me in advance about their arrival, but she never takes my permission (imp. detail)\n\nI have literally no issue with this. Neither of us are introverts or have social anxiety. I’ve always been welcoming to her family. Meanwhile, none of my family or relatives have ever stepped in our house. International tickets are extremely expensive for an average Indian, so it just never happened.\n\nOne of my close female cousin (21F) works at an Indian research institute. She’s d...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 124,
            "ESH": 4,
            "NAH": 2,
            "INFO": 8,
            "TotalJudged": 139
        },
        "total_judged": 139,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-16T05:11:14.276152"
    },
    {
        "id": "1oxmfcq",
        "title": "AITA for not checking my phone when a friend bailed to meet us?",
        "url": "/r/AmItheAsshole/comments/1oxmfcq/aita_for_not_checking_my_phone_when_a_friend/",
        "body_summary": "I (28M) and four of my friends (also all 28M) finally managed to hang out after over a year of everyone being slammed with work and relationships. We all agreed to meet at this indie cinema doing a marathon of a movie series we were once watched togheter on college.\n\nRight next to the cinema is a café we used to practically live in. I messaged the group saying “Let’s meet at the cinema early to grab seats,” and thought everyone would know the drill. Two of us showed up at the same time, and since the theater wasn’t open yet, we went into the café to hang out, and sent a photo in our group. Rick showed up a bit later but walked straight into the theater, since it was open, and by that time we we're already there. We figured he’d realize and come over.\n\nOur last friend, Mark, never showed.\n\n...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 20,
            "ESH": 20,
            "NAH": 2,
            "INFO": 7,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-11-16T05:11:30.300642"
    },
    {
        "id": "1oyawd0",
        "title": "AITA for telling MIL it's her own fault our son was hard to put to bed?",
        "url": "/r/AmItheAsshole/comments/1oyawd0/aita_for_telling_mil_its_her_own_fault_our_son/",
        "body_summary": "My husband has glioblastoma, which is an aggressive brain tumor. He had one surgery 6 months ago and did well after that, but recently needed a second surgery. Due to doctor’s appointments and the surgeries, he has spent a lot of time in and out of hospitals. He’s tried to spend as much time with our 2 year old as possible, but it’s not nearly as much as he would like. This is very hard on our son because he is very much a daddy’s boy and is very, very attached to him. One thing we’ve found that really helps is our son will carry around my husband’s favorite t-shirt and sleep with it at night. My husband will wear it when he’s around our son then leave it with him when he’s away. If I have to wash it for whatever reason before my husband can wear it again, I spritz it with my husband’s col...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 163,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 164
        },
        "total_judged": 164,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-16T05:11:47.460904"
    },
    {
        "id": "1oy0kpp",
        "title": "AITA for calling my husband “him” when speaking to my son?",
        "url": "/r/AmItheAsshole/comments/1oy0kpp/aita_for_calling_my_husband_him_when_speaking_to/",
        "body_summary": "My husband was sitting in an adjacent room of the house, and my son was asking me if I could take him to the store to buy something. I told my son to go ask “him,” motioning to my husband in the other room because I was busy. My husband got very upset that I used the pronoun “him,” and said it was very disrespectful towards him as my son’s father for me to not refer to “him” as “your father.” Am I the asshole? I don’t feel like it was wrong but maybe I just don’t understand from a man’s perspective?",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 70,
            "ESH": 5,
            "NAH": 13,
            "INFO": 0,
            "TotalJudged": 99
        },
        "total_judged": 99,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-16T05:11:50.011456"
    },
    {
        "id": "1oxndao",
        "title": "AITA for asking someone to stop filming at a restaurant?",
        "url": "/r/AmItheAsshole/comments/1oxndao/aita_for_asking_someone_to_stop_filming_at_a/",
        "body_summary": "I went to a late night sushi restaurant after a stressful day at work. There was a group of loud people at a table near  us. I was trying to chill and there was a flash of light and one of the group was filming the others with the flash on and myself and my friend were the background (I don’t think that was intentional). I was annoyed because I hate being filmed but tried to ignore it. They were filming for a couple minutes. They ended the video but starting filming a few minutes later, again with the flash shining at us. I stood up slightly and I mouthed to one of the girls to turn off the flash, she laughs and looks away from me. I got pissed off and walked over to the table and asked the person filming directly to turn off their flash as it was bothering me and my friend. They all looke...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 24,
            "ESH": 1,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-16T05:12:05.735946"
    },
    {
        "id": "1oxwzsb",
        "title": "AITAH for purchasing my wedding dress without my mom",
        "url": "/r/AmItheAsshole/comments/1oxwzsb/aitah_for_purchasing_my_wedding_dress_without_my/",
        "body_summary": "AITAH for buying my wedding dress without my mom?\n\nI, 35 F, had my aunt in town to do a late bday celebration. We decided to go look at wedding dresses and had planned it out 3 weeks in advance. \n\nSide note is this is my second wedding as well as my fiancés, it’s going to be very small. I’m plus sized and my mom is tiny like a size 2 and very judgmental about my body and clothes. Regardless, I’ve tried to include or keep her updated with wedding plans as we make them but she’s kinda been a downer on everything from colors to location to invite list.\n\nAnyways, regardless of everything I invited my mom right away to join us as I felt most moms would want to be there to pick out the dress and she declined. 2 weeks out- I invited my mom again, again she declines. A week out I invited invite he...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 65,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-16T05:12:21.593289"
    },
    {
        "id": "1oy4l6f",
        "title": "AITA for telling my sister she couldnt use my car to take her kids to my nieces birthday party?",
        "url": "/r/AmItheAsshole/comments/1oy4l6f/aita_for_telling_my_sister_she_couldnt_use_my_car/",
        "body_summary": "My family and I live together, and I finally decided to buy my own vehicle about a month ago. This way, I'm not constantly asking my mom or uncle to use theirs to go to drill or work. The day I got it, my sister asked if she could use it whenever she has to take all four of her kids somewhere. I told her I didn't mind, as long as she cleaned up after them and returned it with at least the same amount of gas as when she left the house. So far, every time she has used it, she hasn't done either. She always guilt-trips me when I tell her she's no longer allowed to use it. Last night, we got into an argument because I told her that I might have to leave for work while we were there, and she threw a fit over it. This morning, I asked her if she was paying for the entertainment for everyone at t...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 53,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-16T05:12:37.686285"
    },
    {
        "id": "1oy8qhx",
        "title": "AITA for not going to my uncle's funeral after what happened at the wake?",
        "url": "/r/AmItheAsshole/comments/1oy8qhx/aita_for_not_going_to_my_uncles_funeral_after/",
        "body_summary": "Growing up, my “Uncle Tim” was an asshole. His favorite pastime seemed to be riling someone up, then when they finally snapped, he played victim. He did this often. He also entered homes like he owned the place, was very rude and demanding. I do know a part of fault lies with his family members for enabling him. But growing up, I’d watch him treat my mom (his sister in law) like absolute garbage, boss her around her own house, argue with her, etc. My dad also stood by and allowed it, so again, he is at fault. My mom and one of my aunts (another uncle’s wife) would try to stand up for me, my sister, and my cousins but were constantly shot down, being told they were too soft with us and we were just disrespectful little brats for not tolerating his antics.\n\nThe final straw for me when I was ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 48,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-16T05:12:53.370082"
    },
    {
        "id": "1oxz8f2",
        "title": "AITA for making a snarky comment to my boss about her dog?",
        "url": "/r/AmItheAsshole/comments/1oxz8f2/aita_for_making_a_snarky_comment_to_my_boss_about/",
        "body_summary": "So i (18 F) work at a gym that has a daycare, and I'm one of the daycare workers. Today we had a big event for a marathon we were hosting. It was super slow for me- i only had one kid in the daycare, lets call him \"Conner\".\nConner is obsessed with dogs. He literally talks about them all the time. My general manager (30s F) showed up with her dog, and a bunch of adults were petting it. Conner saw that and immediately asked if he could say hi. I figured it was fine since she brought her dog to a gym and it seemed friendly with every adult out there. So i take Conner out and tell my manager he wants to say hi. she goes \"Oh no he cant. My dog isnt good with kids. \" and i kind of muttered \"So you brought your kid-aggressive dog to a place with kids?\" it was definitely kind of snarky on my end i...",
        "reddit_judgments": {
            "YTA": 47,
            "NTA": 22,
            "ESH": 13,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 84
        },
        "total_judged": 84,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-16T05:13:10.002022"
    },
    {
        "id": "1oxxn38",
        "title": "AITA For refusing to pay for my family anymore",
        "url": "/r/AmItheAsshole/comments/1oxxn38/aita_for_refusing_to_pay_for_my_family_anymore/",
        "body_summary": "Burner because my family are tied to my main  but gonna cut straight to it \n\n\nI (23M) have been expected to be solely responsible for paying for everything in my family’s life for the past 5 years I have 5 siblings all older than me and two parents (separated but live together) and I am the only one who has a job not for health or age reasons they simply do not want to work.\n\nI have voiced my annoyance of their lack of respect or responsibility for years now and asked that they start paying me back the money that have borrowed/money I have spent on them when I don’t live there anymore and haven’t for over 5 years they owe me a combined total of £17,000 and have just this week asked me for more money to pay off my (22yo) brother in laws car and I am putting my foot down and refusing to pay ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 68,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 69
        },
        "total_judged": 69,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-16T05:13:25.969922"
    }
]