[
    {
        "id": "1m1bx4k",
        "title": "AITA For telling my Niece her mother tried to give her away as a baby?",
        "url": "/r/AmItheAsshole/comments/1m1bx4k/aita_for_telling_my_niece_her_mother_tried_to/",
        "body_summary": "OP raised his niece for 3 years after his sister abandoned her. After a fight, OP revealed this to his niece. Sister is angry, mom says OP broke their agreement. OP asks AITA for telling the truth.\n...",
        "reddit_judgments": {
            "YTA": 40,
            "NTA": 89,
            "ESH": 26,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 160
        },
        "total_judged": 160,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-17T05:18:30.935191"
    },
    {
        "id": "1m19ch8",
        "title": "AITA for not waiting for my partner at the police station after he was questioned for something he did behind my back?",
        "url": "/r/AmItheAsshole/comments/1m19ch8/aita_for_not_waiting_for_my_partner_at_the_police/",
        "body_summary": "OP told her BF not to exchange currency with a stranger. He did anyway and was detained. OP traveled to the police station for questioning. She left to catch a train before his release. He's upset she didn't wait. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 58,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-17T05:18:32.903327"
    },
    {
        "id": "1m1h3zh",
        "title": "AITA telling my cousin the real reason I stopped letting her babysit my daughter was her own behavior?",
        "url": "/r/AmItheAsshole/comments/1m1h3zh/aita_telling_my_cousin_the_real_reason_i_stopped/",
        "body_summary": "OP stopped letting cousin Lara babysit after seeing her toxic \"stan\" behavior online. Lara needed money, OP revealed the reason, causing a fight. Lara claims OP is overreacting. AITA for not letting Lara babysit?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 97,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 101
        },
        "total_judged": 101,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-17T05:18:34.817566"
    },
    {
        "id": "1m1pky4",
        "title": "AITA if I don't want to meet biological kids I have never seen, did not raise, etc?",
        "url": "/r/AmItheAsshole/comments/1m1pky4/aita_if_i_dont_want_to_meet_biological_kids_i/",
        "body_summary": "OP, struggling financially with young kids, sold her eggs. A couple used them to have 3 kids. Now divorced, OP told her boyfriend, who is appalled she doesn't care about her bio-children. He wants her to find them. AITA for being indifferent?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 147,
            "ESH": 2,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 155
        },
        "total_judged": 155,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-17T05:18:37.189405"
    },
    {
        "id": "1m1gi20",
        "title": "AITA for telling a grandmother not to put her grandkid's stuff under our beach umbrella after she did so without asking",
        "url": "/r/AmItheAsshole/comments/1m1gi20/aita_for_telling_a_grandmother_not_to_put_her/",
        "body_summary": "OP set up beach spot. Man used OP's umbrella/chairs. Later, man's wife put stuff under OP's parent's umbrella. Annoyed, OP called her out. AITA?\n...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 21,
            "ESH": 5,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 43
        },
        "total_judged": 43,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-17T05:18:39.055984"
    },
    {
        "id": "1m1e1zi",
        "title": "AITA for declining my parents invite to a restaurant to celebrate my engagement with my fiancé?",
        "url": "/r/AmItheAsshole/comments/1m1e1zi/aita_for_declining_my_parents_invite_to_a/",
        "body_summary": "OP's parents offered celebratory dinner at a restaurant OP dislikes due to constant interruptions from acquaintances. OP suggested alternative locations, offering to drive. Dad called OP rude for not accepting the initial offer. OP feels unseen and asks AITA.\n...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 120,
            "ESH": 4,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-17T05:18:42.010929"
    },
    {
        "id": "1m17mka",
        "title": "AITA for hiding personal stuff to my roommates in our shared appartment ?",
        "url": "/r/AmItheAsshole/comments/1m17mka/aita_for_hiding_personal_stuff_to_my_roommates_in/",
        "body_summary": "Let me explain. We're four good friends living in the same apartment, and I like and can buy more expensive things than my roommates (shower gel, toilet paper, etc.). When they run out, they tend to use my things until they run out, before going out to buy very poor-quality items.\n\nSo now, I take everything out of the bathroom, even the toothpaste, otherwise they always finish my things before going out to buy cheap new things in bulk.\n\nWe had an argument about this because I suggested: I can buy everything for the whole house and we split the bills at the end -> they don't want to do that because what I buy is more expensive than what they can afford.\n\n  \nWhat do you think about this situation?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 56,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-17T05:18:42.656762"
    },
    {
        "id": "1m1mmac",
        "title": "AITA for saying “I’m not” when a dog owner said their dog was friendly?",
        "url": "/r/AmItheAsshole/comments/1m1mmac/aita_for_saying_im_not_when_a_dog_owner_said/",
        "body_summary": "OP, who dislikes dogs, was approached by an unleashed dog in a park. The owner encouraged the dog's behavior despite OP's discomfort. OP snapped and said they were \"not friendly\" to dogs. Now OP's mom says OP was rude. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 162,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 163
        },
        "total_judged": 163,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-17T05:18:44.804481"
    },
    {
        "id": "1m1hfnv",
        "title": "AITA for asking my girlfriend why she went to a university in Asia if she hates Asian people?",
        "url": "/r/AmItheAsshole/comments/1m1hfnv/aita_for_asking_my_girlfriend_why_she_went_to_a/",
        "body_summary": "OP(Asian) joked to his GF after she complained about Asian roommates. He said she shouldn't have gone to Asia if she disliked Asians (after she joked she might hate Asians). She got mad. AITA?\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 57,
            "ESH": 2,
            "NAH": 6,
            "INFO": 0,
            "TotalJudged": 74
        },
        "total_judged": 74,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-17T05:18:47.502799"
    },
    {
        "id": "1m1h828",
        "title": "AITA for telling my sister that her attitude is the reason why she doesn’t have a boyfriend.",
        "url": "/r/AmItheAsshole/comments/1m1h828/aita_for_telling_my_sister_that_her_attitude_is/",
        "body_summary": "OP (19F) told her sister (20F) that her bad attitude is why she can't get a boyfriend after the sister complained about being single and compared herself to OP. The sister is upset, and their mom wants OP to apologize. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 36,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-17T05:18:48.637233"
    }
]