[
    {
        "id": "1phfq3e",
        "title": "AITA for telling my roommate I won’t be changing my habits because of him bringing his friends over?",
        "url": "/r/AmItheAsshole/comments/1phfq3e/aita_for_telling_my_roommate_i_wont_be_changing/",
        "body_summary": "I (23m) rent a house with four of my buddies from college. We have done this for two years. It helps that not only are we great friends, but we have a system of deciding house rules: a majority vote. Disagreements on cleaning?  Majority vote.  When to make quiet hours for the night on weeknights?  Majority rules. It has kept everything flowing smoothly. \n\nAnyway one of my friends moved out last month to get a place with his girlfriend. He found a friend of a friend to take over his room. The guy was nice enough but then he came to us with a “declaration.”  \n\nApparently he was uncomfortable that we’re not always completely dressed in the house. No one is a nudist, but some of will sometimes not wear a shirt or just be in pajamas or boxers or underwear when lounging around the house. I admit...",
        "reddit_judgments": {
            "YTA": 19,
            "NTA": 84,
            "ESH": 19,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 127
        },
        "total_judged": 127,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-09T05:12:46.535776"
    },
    {
        "id": "1phf23x",
        "title": "UPDATE: AITA for going out of town for a concert while my daughter is sick",
        "url": "/r/AmItheAsshole/comments/1phf23x/update_aita_for_going_out_of_town_for_a_concert/",
        "body_summary": "Original post here:\n\nhttps://www.reddit.com/r/AmItheAsshole/s/vt68qtIjZN\n\nFriday after work I dropped my daughter off at her dad's as planned. He answered the door with a smile and hugged our daughter. As soon as she wasn't looking, he gave me a death glare. If looks could kill, I'd be 6ft under. \n\nBefore I left, I asked him to update me on her condition in the morning so if I needed to I could reschedule her riding lesson. I was very specific that it needed to be before noon (24hrs notice) or I would be out the $$ for the missed lesson. I tried calling on Saturday morning to check in but he wouldn't pick up. Around 5pm I got a text saying reschedule the lesson. \n\nI went to the concert and enjoyed the show (yes I wore a mask). Near the end, Jacoby started walking through the crowd, climbin...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 7,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 10
        },
        "total_judged": 10,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-09T05:13:02.788330"
    },
    {
        "id": "1phbbsz",
        "title": "AITA for not saying anything to my husband?",
        "url": "/r/AmItheAsshole/comments/1phbbsz/aita_for_not_saying_anything_to_my_husband/",
        "body_summary": "My husband and I are having a second child. We had a gender reveal and were over the moon when we found out we are having a girl this time.\n\nMy parents looked clearly disappointed when they saw the pink cake. My husband has heard a lot of stories about my parents favoring my brothers over me so he is very sensitive about that. He asked my parents if they have a problem and they said no, it's ok.\n\nHe sarcastically said \"oh im so glad you are ok with this\"\n\nIt caused a fight and my parents said that they didn't say anything and didn't deserve to be attacked like this and think I'm an asshole for not saying anything to my husband.",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 62,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 74
        },
        "total_judged": 74,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-09T05:13:03.851903"
    },
    {
        "id": "1phnqel",
        "title": "AITA for not giving up my seat at the bar?",
        "url": "/r/AmItheAsshole/comments/1phnqel/aita_for_not_giving_up_my_seat_at_the_bar/",
        "body_summary": "My girlfriend and I went to a restaurant this weekend with the intention of eating at the bar. We get into the bar area and find every stool is taken and there are about six people standing several feet away, drinking and possibly waiting for a table. Normal stuff.\n\nMy gf and I hover near the bar for a few minutes and I spot two guys paying their bill. I approach and ask if they're leaving, they say they are, and so when they get up, we snag the two stools as the bartender clears their plates.\n\nWe're sitting there for about 30 seconds before I get a tap on my shoulder. I turn to find a woman behind me, and she says, \"We were waiting over there for a spot at the bar, and we were here first.\"\n\nNow, there is no list or designated area to stand to wait for a spot at the bar.\n\nWithout hesitatin...",
        "reddit_judgments": {
            "YTA": 26,
            "NTA": 98,
            "ESH": 3,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-09T05:13:21.262437"
    },
    {
        "id": "1pha2vn",
        "title": "AITA for removing a groupmate’s name from final project 3 days before it’s due?",
        "url": "/r/AmItheAsshole/comments/1pha2vn/aita_for_removing_a_groupmates_name_from_final/",
        "body_summary": "Hello! I’m currently in cc nearing the end of the semester. I’m taking a fully online chem class. \n\nFor this particular class our professor assigns a group project for our final lab consisting of 3 people. She had it open for people to choose which experiment we wanted to conduct and create a presentation on a month ahead of its due date. So i reached out the day after it was assigned to my groupmates, and this one girl who i’ll call B always took forever to reply. She canceled on our meet up to go over splitting the work on zoom 10 minutes after our meet up time, and has overall been lacking in communication. I understand we have work and family matters, but it does not take long to give a short update on what’s going on. \n\nFast forward to 2 weeks before the final is due, me and the other...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 66,
            "ESH": 5,
            "NAH": 3,
            "INFO": 7,
            "TotalJudged": 90
        },
        "total_judged": 90,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-09T05:13:38.385855"
    },
    {
        "id": "1phrdp6",
        "title": "AITA for leaving early after my friend kept me waiting for hours and then got mad when I went home?",
        "url": "/r/AmItheAsshole/comments/1phrdp6/aita_for_leaving_early_after_my_friend_kept_me/",
        "body_summary": "This actually happened a few days ago, and I’m still not sure if I handled it the right way. So I  had plans to meet my friend Meg at a store because she wanted my help picking out a few things for her new apartment. She asked me specifically to come because she trusts my taste and didn’t want to shop alone. No problem I moved some things around in my day to make time for her. We agreed to meet at 3 PM. I got there on time. She texted me at 3:10 saying, On my way. About around 3:30 she texted me again saying she is in Traffic., patiently waiting for her. About 4:05  she texted Almost there. By 4:45, she still hadn’t shown up. Meanwhile, I was literally walking around the store for almost two hours, trying not to look weird or lost. I even kept checking certain aisles because she said that’...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 122,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 123
        },
        "total_judged": 123,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-09T05:13:55.192823"
    },
    {
        "id": "1phapfn",
        "title": "AITA for telling my wife when I came home from combat duty that all I wanted is a quit time in a clean room",
        "url": "/r/AmItheAsshole/comments/1phapfn/aita_for_telling_my_wife_when_i_came_home_from/",
        "body_summary": "I (30M) live in a country with ongoing war. In this phase, every few months the men go to a combat assignment of a month or two and then come back home to our regular jobs. At the begining (when it was much longer deploymnts and everything was new) it was very special to come home and everybody celebrated it, but now after years of war it's kind of a regular thing.\n\nI'm a person who really need his quiet time and clean space, and war is nothing but these two. It's messy and disgusting and noisy and overwhelming.\nLast time I came home, my wife (29F) came to pick me up from the bus station and we got into the house together and when I got inside it was super messy and I looked miserable. \nShe asked me what is going on, and I said (without thinking) that \"the one thing that I missed the most ...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 26,
            "ESH": 0,
            "NAH": 25,
            "INFO": 2,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-09T05:14:12.071499"
    },
    {
        "id": "1phuxat",
        "title": "AITA for reporting a girl for hit and run after she hit my car and fled?",
        "url": "/r/AmItheAsshole/comments/1phuxat/aita_for_reporting_a_girl_for_hit_and_run_after/",
        "body_summary": "I’m 27M and park on the street outside my building. A few days ago I checked my dashcam because I thought I saw someone near my car earlier. The footage shows a 20 year old girl who lives across the street trying to parallel park and hitting my rear fender hard enough that my car moved slightly.\n\nWhen I looked at the car the finish on the paint was dulled in a small patch. You can notice it if you pay close attention. She got out looked at both cars with her hands in her hair, paused for a while and then drove off without leaving a note or anything. That already irritated me because I’m tired of people pulling that. My buddy’s parked car got hit by some woman and she was never found because his dashcam was off. He had to pay everything. I’m honestly sick of how often people like her try to...",
        "reddit_judgments": {
            "YTA": 94,
            "NTA": 19,
            "ESH": 26,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 140
        },
        "total_judged": 140,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-09T05:14:30.536864"
    },
    {
        "id": "1phbxcz",
        "title": "AITA for not being sympathetic over the experience my \"friend\" had in my homecountry",
        "url": "/r/AmItheAsshole/comments/1phbxcz/aita_for_not_being_sympathetic_over_the/",
        "body_summary": "To start with - i(30s f) am from Russia, but have moved overseas 15 years ago alongside my parents. I haven't visited my homecountry since covid and the war with Ukraine and I have family in both.\n\nThere's a girl in our friend group called \"Amy\" (30s f). Amy is a pretty curvy woman and is into anime, inlc cosplay and usually wears short skirts and/or quite revealing tops. I am not particularly close to her, but for about a year she was going on about visiting Russia and how it is her dream (she does not have any friends or family there). I have strongly advised her against it due to the political situation. I have also warned her about bodyshaming culture there and the hell it caused me in school and how people can and will make snarky remarks about her on the street and even to her face a...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 47,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-09T05:14:46.231621"
    },
    {
        "id": "1phojot",
        "title": "AITA for giving a silly Secret Santa gift that my friend thought was “cheap”?",
        "url": "/r/AmItheAsshole/comments/1phojot/aita_for_giving_a_silly_secret_santa_gift_that_my/",
        "body_summary": "\nmy friends and I are doing a three-week Secret Santa with different themes each week. The first week’s theme was gag gifts or funny things, and everyone was giving each other like weird keychains, small bottles of alcohol, or joke novelty items. (all within budget). I got my assigned friend a pair of beef-looking socks and a giant back scratcher fork because she had mentioned she liked an expensive local beef type (but that was way above budget and also hard to bring and stay anonymous since it needs refrigeration)\n\n when she got my gift, she was really disappointed and kept saying she hated her Secret Santa and that they were bad at gift giving. she doesn’t know it’s me since we’re doing it anonymously and we’ll reveal it at the end of the third week. but She even said everyone else got ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 46,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-09T05:15:02.062691"
    }
]