[
    {
        "id": "1p41ibt",
        "title": "AITA for telling my friend that proposing is not a suitable 'Christmas present'?",
        "url": "/r/AmItheAsshole/comments/1p41ibt/aita_for_telling_my_friend_that_proposing_is_not/",
        "body_summary": "I have a friend who I'll be calling \"Harry\". Harry and I have known each other for over a decade (we're in our early 30s), he was part of my own wedding party, and 99 times out of 100, he's an all round great guy.\n\nHarry has been dating his girlfriend for around 4 years - she's an absolute diamond, and brings out all of the best qualities in him. A couple of weeks ago, Harry confided in me that he was planning to propose to his partner over Christmas - she's very family focused, and he is setting it up so his parents 'unexpectedly' visit them (they're doing Christmas with her family this year) early in the morning, and he will propose during present opening in front of his and her parents, and her siblings and their partners/kids.\n\nWhen chatting about arrangements a couple of days ago, Har...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 104,
            "ESH": 2,
            "NAH": 10,
            "INFO": 1,
            "TotalJudged": 123
        },
        "total_judged": 123,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-23T05:11:23.963633"
    },
    {
        "id": "1p3w01o",
        "title": "AITA for refusing to babysit during vacation, even though I have no other plans?",
        "url": "/r/AmItheAsshole/comments/1p3w01o/aita_for_refusing_to_babysit_during_vacation_even/",
        "body_summary": "Throwaway acct for obvious reasons\n\nMy family owns a small vacation house in Florida and the whole family spends a week there every other year. This year’s trip is coming up in 3 weeks. The people coming are my brother (32M), his wife, and their 2 kids (8M and 5F); my sister (26F), her husband, and their kid (4M); and me (28M, single and childfree). We’re each paying our own way.\n\nThe other day, my sister called and told me that she and brother had planned a “couples day” with their spouses in the middle of the week. The idea was that the 2 couples would spend the day on the water and then go to a nice restaurant for dinner. She asked if I could watch the kids during this time. \n\nI said no. She thought I was joking until I doubled down, and then she got audibly annoyed. She kept asking why...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 133,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 133
        },
        "total_judged": 133,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-23T05:11:43.477279"
    },
    {
        "id": "1p3qbla",
        "title": "AITA for Wanting Different Rules for My Parents After My In-Laws Treated Me Badly?",
        "url": "/r/AmItheAsshole/comments/1p3qbla/aita_for_wanting_different_rules_for_my_parents/",
        "body_summary": "got married in February 2024 and got pregnant shortly after. My in-laws stayed with us for the first four months after my daughter was born, but honestly, both my mother-in-law and father-in-law treated me badly. My mother-in-law made frequent hurtful comments about my age and breastmilk supply and my father-in-law would sometimes join in, either to taunt me or show passive aggressionAt one point, they even refused to bring me food when I was unwell.\nWhile they did help with cooking and taking care of the baby, their presence caused a lot of tension between me and my husband, and we ended up arguing a lot. After they left, things didn’t improve my husband started siding with them, emotionally isolated me, and my recovery was affected. On top of that, I was also going through a stressful jo...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 82,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 90
        },
        "total_judged": 90,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-23T05:11:59.434704"
    },
    {
        "id": "1p3zxhy",
        "title": "AITA for finally snapping at my stepmother during our family’s early Thanksgiving after years of her passive-aggressive treatment?",
        "url": "/r/AmItheAsshole/comments/1p3zxhy/aita_for_finally_snapping_at_my_stepmother_during/",
        "body_summary": "I (33F) have known my stepmother for almost twenty years. My parents divorced when I was in junior high school, and my dad remarried a few years later. I was never hostile to her. I’ve always tried to be respectful, polite, and keep the peace for the family.\nBut over the years, she has made constant passive-aggressive comments toward me, always subtle, always with a smile, and only when my dad wasn’t around.\nFor context, because yes it relates to this story, I’m a lesbian and am now married to my wife (28 F) \nThings like:\nimplying I’m “confused” about my sexuality\ntelling me my wife is “just a phase” at first\nmaking jokes about “real families”\nimplying I’m dramatic or sensitive whenever I confronted her privately about something she said\nmaking digs about me not having kids yet\nwhispering ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 71,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-23T05:12:15.516382"
    },
    {
        "id": "1p3lb1e",
        "title": "AITA for using what was supposed to be a handicap card to win the game?",
        "url": "/r/AmItheAsshole/comments/1p3lb1e/aita_for_using_what_was_supposed_to_be_a_handicap/",
        "body_summary": "The actual event happened several years ago, but my family won't let this incident go and uses this as a reason why they don't want to play games with me still today, and it's been really bugging me.\n\nSo anyway, I (f26 now, probably about 17 or 18 at the time) had bought this game called \"Unstable Unicorns,\" and it quickly became a popular game for my family to play. The basic idea of the game is to get a certain number of \"unicorns\" from your hand to your \"stable\" before the other players, by playing unicorn cards and/or using special power ups or upgrade and downgrade cards to add unicorns to your stable or remove unicorns from other players' stables (i.e. your active cards on the table) until someone achieves the magic number of unicorns to win the game. There were a lot of unique cards...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 74,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 79
        },
        "total_judged": 79,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-23T05:12:31.711853"
    },
    {
        "id": "1p3uku0",
        "title": "AITA for refusing to carry my girlfriend’s sandals at a party?",
        "url": "/r/AmItheAsshole/comments/1p3uku0/aita_for_refusing_to_carry_my_girlfriends_sandals/",
        "body_summary": "I know it's gonna sound petty, but it is what is is 🤷‍♂️\n\nMy girlfriend & I (both aged 26) are together since college. Last Friday night, we went to party at our mutual friend's house.\n\nIt was the first time going to a party together since we started living under one roof. Just when we got ready, she handed me a big laptop-sized cloth bag with a pair of sandals in it, asking me to keep it with me the whole time, as most probably she will use them after the party is over, mentioning that pointed heels are exhausting.\n\nMy nature: I'm not a fan of keeping things with me outside, even if it's an easily replaceable item. Also, I was going to a place to have fun, not in mood to handle someone's stuff all the time. everybody knows what happens there. It's understandable if she gives me something ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 123,
            "ESH": 1,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 131
        },
        "total_judged": 131,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-23T05:12:48.704790"
    },
    {
        "id": "1p42bav",
        "title": "AITAH for wanting to skip the holidays at my boyfriends of 3 years due to his grandma invading my privacy?",
        "url": "/r/AmItheAsshole/comments/1p42bav/aitah_for_wanting_to_skip_the_holidays_at_my/",
        "body_summary": "My boyfriend of 3 years lives with his grandparents and his younger sister. I spend quite a bit of time at their house, I cook for them and try to contribute what I can. I keep a small drawer in his bedroom as he has one at my place. He went on a camping trip this weekend and left his room a mess trying to get everything together for the trip. While he was gone, his grandma decided to completely go through his room. She emptied my drawer which included some spicy underwear hidden in the back. Took my toiletries out of his personal bathroom and removed our shared decorations. She put everything including a ton of his stuff into a bunch of trash bags and dropped them off at my house. There were 4 bags total 2 which were all his. I feel really violated and embarrassed she went through all of ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 45,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-23T05:13:04.708173"
    },
    {
        "id": "1p3v0ii",
        "title": "AITA for refusing to wear my future MILs wedding dress??",
        "url": "/r/AmItheAsshole/comments/1p3v0ii/aita_for_refusing_to_wear_my_future_mils_wedding/",
        "body_summary": "I (23F) recently got engaged to my boyfriend (35M). A few days later, my future MIL invited me over to “talk wedding plans.” Instead, she brought out her old wedding dress and told me she had always hoped her son’s future wife would wear it. I could tell the dress meant a lot to her, but it’s very old-fashioned, not my style, and honestly just doesn’t fit the type of wedding I’m planning. I thanked her for showing it to me and told her that I appreciated the offer, but I had always imagined choosing my own dress. Well, she got upset and said she thought it was a family tradition and that she saved the dress specifically for this moment. Later, she told my fiancé that I “rejected her.” Now he says I should’ve at least tried it on so her feelings wouldn’t be hurt.\n\nI truly didn’t mean to ups...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 104,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 106
        },
        "total_judged": 106,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-23T05:13:22.718335"
    },
    {
        "id": "1p4ag6g",
        "title": "AITA for not ordering a simpler drink at the bar",
        "url": "/r/AmItheAsshole/comments/1p4ag6g/aita_for_not_ordering_a_simpler_drink_at_the_bar/",
        "body_summary": "Last night I went out for a friend’s birthday at this racing arcade/bar place. I went to go get a drink my some of my friends and after looking through the cocktail menu, nothing there sounded good to me. I settled for my regular going out drink (vodka cran) but then I looked at the bottles on the shelf behind the bar and saw a bottle of a specific type of liqueur used for one of my favorite drinks. It was pretty crowded so it took a while for the the bartender to notice us but when she did, I ordered that drink instead of the vodka cran. She said they didn’t have that which confused me because it has a distinct bottle and color that’s hard to miss or get mixed up.  Seeing as how she strayed from the mental script I had in my head I kind of blanked and then just wordlessly pointed to the b...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 58,
            "ESH": 0,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-23T05:13:38.912973"
    },
    {
        "id": "1p3lmwa",
        "title": "AITA for not letting my mom touch my face?",
        "url": "/r/AmItheAsshole/comments/1p3lmwa/aita_for_not_letting_my_mom_touch_my_face/",
        "body_summary": "I‘ve always had problems with my skin, I have pimples and my skin just isn’t smooth. I also have a habit of picking my skin and popping my pimples which I know I shouldn’t do. But I started taking care of my skin a while ago and it has gotten much better, but there were periods where I would stop and then start again.\n\nSo this past week I’ve been taking caring of my skin again and my mom who has always commented on my skin(which I know she does for my own good) touches my face, grabs my chin and says “see, when you start taking care of your skin it looks much better” which was a compliment but then she just grabs my whole face and starts touching it.\n\nWhat I meant with “she has always commented on my skin” I mean: everytime I pick my skin she says “what have you done now, why are you makin...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 36,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-23T05:13:54.512369"
    }
]