[
    {
        "id": "1rbprl1",
        "title": "AITA for telling my wife I'm done hosting her family every holiday because they never offer to help or bring anything?",
        "url": "/r/AmItheAsshole/comments/1rbprl1/aita_for_telling_my_wife_im_done_hosting_her/",
        "body_summary": "I have been married for six years. We have a decent sized house so we've always hosted holidays. Thanksgiving, Christmas, Easter. My own family (parents and sisters) doesn’t stay here. My wife’s parents, her brother and his wife, and their two kids. About 8 people total.  \nHere's the thing. They show up empty handed every single time. No food, no drinks, no offering to help cook or clean only few times when asked to help. They sit on the couch watch football and wait to be fed. Then after dinner they go home and leave us with all the mess.  \nI've mentioned this to my wife before. She said that's just how they are and they're guests. But they're not guests at this point. It's been six years.  \nLast week her mom texted asking about preparations for Easter Sunday. I told my wife I'm done. I s...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 114,
            "ESH": 0,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 118
        },
        "total_judged": 118,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-23T05:58:56.481897"
    },
    {
        "id": "1rbifm8",
        "title": "AITA for being ungrateful to my grandma for “fixing” my dress",
        "url": "/r/AmItheAsshole/comments/1rbifm8/aita_for_being_ungrateful_to_my_grandma_for/",
        "body_summary": "Hi, I’ve never posted before so please bare with me.\n\nI (17F) am going to my bfs school formal next Saturday and am really excited. Because I’m in my last year of high school I have been quite busy this year with school work and so I decided it would be easier to order my dress online. My mum helped me measure myself and we ordered it but when it arrived I tried it on and realised it would definitely need to be hemmed. My grandma, who always hems my clothes for me offered to hem it for me which I was really grateful for. We agreed she would remove 2 inches from the bottom and tighten the straps a bit so it would fit me better.\n\nTwo days later she bought the dress back and explained she had done all that along with helping “make the dress more modest for a young lady”. When I looked at the ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 97,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 101
        },
        "total_judged": 101,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-23T05:59:04.686114"
    },
    {
        "id": "1rbtvfe",
        "title": "AITA for allowing my nieces to eat certain foods and not warning my sister that it could happen",
        "url": "/r/AmItheAsshole/comments/1rbtvfe/aita_for_allowing_my_nieces_to_eat_certain_foods/",
        "body_summary": "Hi all,\n\n  \nSo this week in the UK has been half term week, a week where children have off school halfway through a term. I (M26) am no stranger with looking after my 8 year old twin nieces however my sister (F33) usually provides some form of notice if I need to watch them for a bit, even a couple of emergency times were usually met with at least like 15 to 20 minutes notice however on Tuesday morning my sister drops them off at my flat without any notice whatsoever, just that she was \"out\". \n\nI work 4 days on, 4 days off, 12 hour shifts and Tuesday was the first of my four days off. Usually, I spend the first day of my four off exhausted from the previous days of work. I didn't have a lot of food in the house at that point (I was having a supermarket shop delivered in the evening).\n\nI we...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 82,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 83
        },
        "total_judged": 83,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-23T05:59:12.582484"
    },
    {
        "id": "1rbuntq",
        "title": "AITA for not moving my car in the snow after a neighbor left a note?",
        "url": "/r/AmItheAsshole/comments/1rbuntq/aita_for_not_moving_my_car_in_the_snow_after_a/",
        "body_summary": "I live in Brooklyn and use street parking. Parking rules were suspended for like three weeks after the recent storm. Last weekend, I paid a teenager to dig my car out so it would be ready when I needed it to move it by this weekend.\n\nFriday, i planned to drive to dinner. I found a note on my windshield from the guy parked in front of me asking me to text him when I moved my car. \n\nHis plan was for me to pull out so that he could reverse into my (clear) space and then drive forward out of his own snowed-in spot, rather than dig himself out. This leaves his spot either unusable or needing to be shoveled by the next person who parks there. \n\nI saw the note Friday night when I actually went out to move the car (not sure when he left it). When I tried to start my car, the battery was dead from ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 44,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-23T05:59:20.222714"
    },
    {
        "id": "1rbqv2d",
        "title": "AITA for not inviting my brother to my engagement party?",
        "url": "/r/AmItheAsshole/comments/1rbqv2d/aita_for_not_inviting_my_brother_to_my_engagement/",
        "body_summary": "A few years back my younger brother said he wanted “space” from me. I have been fine with that as he has had a lot going on personally. Having said that, the last time I was in town visiting the rest of our family, another family member asked if they could bring my daughter to see him. He declined. I genuinely have never taken his issue with me personally, but declining to see my daughter did affect my perception of him.\n\nOn another track, I recently became engaged and my fiancé (who my brother has never met) and I are having an engagement party. We have both invited extended family and friends. I have not invited my brother and I don’t plan to. My mother is upset and my fiancé feels like I should use the party to extend the olive branch. I don’t want my engagement to become about my broth...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 34,
            "ESH": 1,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-23T05:59:28.110842"
    },
    {
        "id": "1rc7x5w",
        "title": "AITA for freaking out at my wife throwing out my dead son’s toys?",
        "url": "/r/AmItheAsshole/comments/1rc7x5w/aita_for_freaking_out_at_my_wife_throwing_out_my/",
        "body_summary": "Last night I (33M) found out my wife (34F) threw away the Hot Wheels me and my son used to play with together, along with the toy basket they were in. For context: my son passed away about five years ago now due to complications with COVID. We have been through a lot since then, I have always been the sentimental type to keep old things our son has. My wife is more of practical type, not that she doesn’t experience emotions, but she definitely tries to move on rather than dwell on things during times of grief, which is something I admire about her. \n\nA few days ago I noticed that our son’s Hot Wheels and toy basket, something that we had kept around since he passed, was gone. I didn’t want to bring it up with her right then because I thought that maybe she just moved it or something.\n\nYest...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 34,
            "ESH": 14,
            "NAH": 12,
            "INFO": 5,
            "TotalJudged": 70
        },
        "total_judged": 70,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-23T05:59:36.134852"
    },
    {
        "id": "1rc4ztz",
        "title": "AITA for asking my friend not to bring her toddler to every get-together?",
        "url": "/r/AmItheAsshole/comments/1rc4ztz/aita_for_asking_my_friend_not_to_bring_her/",
        "body_summary": "I have a small friend group that meets up every few weeks for dinner or drinks. One of my closest friends, “Anna,” had a baby about two years ago, and for the last several months she’s been bringing her toddler to nearly every hangout.\n\nAt first it was fine, and we all understood she was adjusting to motherhood. But lately, it feels like every get-together turns into a playdate instead of an adult catch-up. The conversations are constantly interrupted, she leaves early, and the atmosphere has totally changed.\n\nLast weekend, I messaged her privately and said I miss having adult time with her, and maybe we could plan something just for us now and then. She got really quiet and later sent a long message saying I was being unfair, unsupportive, and “excluding her as a mum.”\n\nNow the rest of th...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 56,
            "ESH": 2,
            "NAH": 4,
            "INFO": 9,
            "TotalJudged": 80
        },
        "total_judged": 80,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-23T05:59:44.862366"
    },
    {
        "id": "1rbodfi",
        "title": "AITA for not putting my FIL in a home for the sake of",
        "url": "/r/AmItheAsshole/comments/1rbodfi/aita_for_not_putting_my_fil_in_a_home_for_the/",
        "body_summary": "I(44F) have been in a relationship for almost 2 years. I have been widowed for almost 8 years. With my late husband I have 2 children with (25&18) with only my youngest still living at home. My FIL has lived with me for the past 10 years with his declining health. Even after my husband passed he has stayed in my care. My boyfriend was fully aware of my decision to do this, and that it would not change.\n\nWe’ve been discussing us moving in together and I had made it very clear, where ever I go my son and my Fil would be coming with me. He was very understanding about my son but then brought up the discussion if I’d ever put my FIL in a nursing home. I told him no I wouldn’t even consider it. He then brought up him possibly having better care at a nursing home. I have taken care of my FIL for...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 38,
            "ESH": 0,
            "NAH": 7,
            "INFO": 0,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-23T05:59:53.093637"
    },
    {
        "id": "1rbmgr5",
        "title": "AITA for not seeing my new niece?",
        "url": "/r/AmItheAsshole/comments/1rbmgr5/aita_for_not_seeing_my_new_niece/",
        "body_summary": "My wife's brother has had a second child 6 weeks ago (Two under Two).\n\nWe live over an hour away, work full time alongside one of us doing a master's degree, have two dogs & care for an elderly aunt down the road. It is known to all family that we have no desire to have children & this is accepted by everyone but the feeling from my brother-in-law & his partner seems to suggest that us deciding not have children means that we have lots of time on our hands to help.\n\nAn example of this would be them asking my wife to drive down to them to look after their first child after work.....for one hour. A two hour commute for an hour of babysitting. \n\nDon't get us wrong, we like to help out where we can. My brother-in-law's partner had a planned C-Section. We took the first kid for 5 days so he wou...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 21,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-23T06:00:00.678523"
    },
    {
        "id": "1rc1lvi",
        "title": "AITAH for snapping at my mom because she keeps grabbing things while driving?",
        "url": "/r/AmItheAsshole/comments/1rc1lvi/aitah_for_snapping_at_my_mom_because_she_keeps/",
        "body_summary": "Edit: I should have added this in my post but i don’t have any other options. Brother wrecked his car, I’m low contact with my father and I can’t drive because I tore my acl and meniscus and I’m on crutches.\n\nI 26f have never been in a car accident but have been close to one. My mom’s driving scares me. She will either try grabbing something or will take her hands off the wheel. Both of them. Two years ago she was on her phone and wasn’t paying attention. She saw the other car last minute and swerved. I was almost hit as I was sitting in the passenger seat. I could have been crushed. A huge argument broke out that day.\n\nJust a few minutes ago she had grabbed some oil perfume she keeps. We were literally going up a hill and the road was extremely bumpy. I snapped and told her to put down th...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 19,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-23T06:00:08.385151"
    }
]