[
    {
        "id": "1q1r7g4",
        "title": "AITA for not making my daughter switch back a gifted Labubu with her younger cousin after her uncle found out the one my daughter gained in the swap is rare with a high resale value?",
        "url": "/r/AmItheAsshole/comments/1q1r7g4/aita_for_not_making_my_daughter_switch_back_a/",
        "body_summary": "Throwaway because family is on Reddit.\n\nThis happened over Christmas and it’s turning into a whole family drama.\n\nMy daughter “Sofia” (12) and her cousin “Martina” (6 - daughter of my sister “Maria” and her husband “Jose”) were gifted blind box Labubus as part of their Christmas gift from my other sister “Sara”. They each opened their boxes. Martina got a brown one and Sofia got a pink one. \n\nMartina immediately wanted the pink one and Sofia immediately offered a trade because she already has the pink one and was hoping for the brown one. They traded, both girls were happy, and that was that….or so I thought. \n\nLater, Martina’s parents found out from taking to someone that the brown Labubu is apparently a rare “secret” version that can sell for $250+. \n\nOnce they learned that, they called ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 127,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-03T05:13:36.319273"
    },
    {
        "id": "1q1ycg0",
        "title": "AITA for telling neighbor to go through insurance",
        "url": "/r/AmItheAsshole/comments/1q1ycg0/aita_for_telling_neighbor_to_go_through_insurance/",
        "body_summary": "Edit: thanks for replying everyone. I understand that it would probably be less hassle to just have my handyman fix it. But I won’t be doing that. It probably does make me a little bit of an asshole and I accept that. Name calling is where I draw the line. I pay for insurance, I already made a claim, so her adding onto that doesn’t change my rates. \n\nI am sorry I hit her mailbox, and I fulfilled my obligation by giving her my insurance. She doesn’t have access to me anytime she wants another apology and she certainly doesn’t get to call me names. \n\n\nOriginal post: My car slipped on black ice and I hit my neighbors mailbox. Gave her my insurance info. She said my insurance wanted her to pay upfront and she didn’t have the money. \n\nI said I would buy the mailboxes and pay my handyman to put ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 127,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-03T05:13:57.445120"
    },
    {
        "id": "1q1xcgl",
        "title": "WIBTA if I deny my newfound half-sister (on my fathers side) access to my mother?",
        "url": "/r/AmItheAsshole/comments/1q1xcgl/wibta_if_i_deny_my_newfound_halfsister_on_my/",
        "body_summary": "This is a bit complicated, please bear with me\nRecently a girl (23F) reached out to me (25F) via Facebook explaining that she is my half-sister, conceived by my father and another woman. She explained that her mother recently \"came clean to her\" regarding her father - that she (23F) was the result of a ONS with a guy she met during a work trip. Before she was told that she was the bio kid of her stepfather. She didn't find our father online as he doesn't have socmed, but found me thanks to our very uncommon surname (how her mother knows our surname but doesn't have any other contact information - idk. 23F told me her mother was very cagey about everything)\n\nAfter a bunch of messaging we set up a video call to talk, and 23F explained she was very excited to connect with her real family and ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 132,
            "ESH": 0,
            "NAH": 0,
            "INFO": 10,
            "TotalJudged": 143
        },
        "total_judged": 143,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-03T05:14:15.652435"
    },
    {
        "id": "1q1q587",
        "title": "AITA for babysitting my grandkids during my sons visit",
        "url": "/r/AmItheAsshole/comments/1q1q587/aita_for_babysitting_my_grandkids_during_my_sons/",
        "body_summary": "I have 3 sons, Michael (35), Jonah (30), and Logan (20). After Logan moved out for college last year I moved 6 hours away, near Michael and his family, both for the lower cost of living and to be near my grandkids. \n\n  \nMichael and his wife, Nadia, have 4 kids (8, 6, 3, and 3). I watch the kids from 11:30 to 3:30 4 days a week while Nadia works and the kids spend the night 1-2 times a month so Michael and Nadia can have a date night. \n\n  \nNadia confirmed that I could take the kids overnight for New Year’s Eve last month. I made plans for one of my good friends to bring her grandkids over. We had a pizza and movie night with bottomless ice cream and lots of candy. \n\n  \nLogan told me at the beginning of this month that he’ll stay with me for winter break instead of his father. A few days ago...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 118,
            "ESH": 7,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 137
        },
        "total_judged": 137,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-03T05:14:33.361120"
    },
    {
        "id": "1q20eni",
        "title": "AITA For wearing an outfit my dad told me not to wear for dinner?",
        "url": "/r/AmItheAsshole/comments/1q20eni/aita_for_wearing_an_outfit_my_dad_told_me_not_to/",
        "body_summary": "I went back to home to my parents house for the holidays and had a for the most part a relaxing time with family and old friends except for an incident on Christmas that is still bothering me. For background I have recently moved away from home for uni and this was my first time back since leaving. My dad has always been strict and conservative but when he told me to change into something more appropriate for dinner I honestly did not expect that even from him. I tried to push back and ask why my outfit was not appropriate for a dinner with family but all I got back as a reason was that it is his house and his rules. He never told me, but I think the real reason was my mid thigh skirt (I never had a skirt that short when living at home) and I told him how it is sexist to police women's out...",
        "reddit_judgments": {
            "YTA": 42,
            "NTA": 70,
            "ESH": 11,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-03T05:14:54.063709"
    },
    {
        "id": "1q1vdlq",
        "title": "AITA for making a second birthday cake for the day as well as ordering one for a party",
        "url": "/r/AmItheAsshole/comments/1q1vdlq/aita_for_making_a_second_birthday_cake_for_the/",
        "body_summary": "AITA for making more cake when we already have cake and snacks from Christmas?\n\nIt’s my youngest Daughters birthday today and it’s always a bit of a challenge to make it special and separate from Christmas. On Sunday she’s having a party at our house and I’ve ordered a party cake. Today she just wants a simple packet mix sponge cake and both her sets of grandparents are coming over then we’re going out for dinner.\n\nMy husband has just told me in front of her that there’s no point making another cake when we still have Christmas cake left and a cake coming for Sunday. I know he’s right that we’re not going to be able to eat everything but honestly it’s not about eating all the cake, it’s about singing happy Birthday and offering it to guests.\n\nHe’s only expressed this opinion today despite ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 107,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 107
        },
        "total_judged": 107,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-03T05:15:10.566989"
    },
    {
        "id": "1q1z1px",
        "title": "AITA for ruining my friend's livestream because he complained about the game I invited him to play?",
        "url": "/r/AmItheAsshole/comments/1q1z1px/aita_for_ruining_my_friends_livestream_because_he/",
        "body_summary": "I (20m) have a friend (24m) that is a streamer. He does livestreams as a hobby, and he dreams of making a profit from it. Long-story short, we have been friends for almost 3 years, and because we live in different countries, we have only met each other 2 times in person. We both love to play videogames and that's how we met and we keep hanging out.\n\nNow, today, while he was doing a livestream, after some time playing online multiplayer games and being quite stressed about it, he wanted to play a single-player game, but because I wanted to keep playing with him, I recommended playing a chill game called \"Powerwash Simulator 2\". Now, before and for a couple of weeks, I've been trying to get him to play it, but he always refused saying that he doesn't like those \"chill and cozy\" type of games...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 24,
            "ESH": 9,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 35
        },
        "total_judged": 35,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-03T05:15:26.334076"
    },
    {
        "id": "1q1qe1o",
        "title": "WIBTA if I didn't help my friend clean the appartement she's moving into?",
        "url": "/r/AmItheAsshole/comments/1q1qe1o/wibta_if_i_didnt_help_my_friend_clean_the/",
        "body_summary": "My (f27) best friend (f26) of 21 years is moving in with her boyfriend and has asked me to help. The thing is, I'm always up for helping people move, but she has told me, she doesn't need my help moving boxes and furniture. She just wants me to help her clean the new appartement and I said no. She has asked three times by now, always acting as if she hadn't asked before and always telling me that they had enough people for heavy lifting, so if I didn't want to help her clean, she wouldn't need my help.\n\nI personally don't think that cleaning is part of helping someone move. Don't get me wrong, if she urgently had to move into a filthy appartement, I'd help her clean, but there is no time pressure at all. \n\nHere are four things to clarify:\n1. For the past six months we've barely spoken and ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 51,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-03T05:15:42.318689"
    },
    {
        "id": "1q1uqzq",
        "title": "AITA for banning voice and video messages from my best friend?",
        "url": "/r/AmItheAsshole/comments/1q1uqzq/aita_for_banning_voice_and_video_messages_from_my/",
        "body_summary": "So, I know that my friend likes sending voice and video messages in telegram. She mostly sends video ones, just showing her face and saying something (would make more sense to use a voice message, bruh, I know what you look like, I see you nearly everyday). I understand that sometimes it might be inconvenient to type, or she might want to show something, and video message suits best in this case, and I do use them sometimes too.\n\nThe thing is, sometimes she is just too lazy even to type a couple of words and sends me a freaking video circle of literally 2 seconds duration. And she knows that I hate it. She also knows that I hate receiving messages that require extra actions to acknowledge - either pressing play button or transcribe one - while I'm busy. Transcription are not really accurat...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 29,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-03T05:15:58.077896"
    },
    {
        "id": "1q1tvrf",
        "title": "AITA for arguing with mom to let go of me",
        "url": "/r/AmItheAsshole/comments/1q1tvrf/aita_for_arguing_with_mom_to_let_go_of_me/",
        "body_summary": "I am a relatively nerdy 17-year-old male. Due to my father's job, my mother raised me and my brother alone. She never acts like im 17 i cant even go out after 8 pm. I don't know if this is the reason, but my mother was always very paranoid about us and constantly pressured us to be successful. I was an average student until high school, but in high school, I set myself the goal of getting into medical school and worked day and night. My mother was very supportive during this process, but six months before the university entrance exam, things went wrong. To escape my mother's pressure, I've been studying at the library for about seven months. Once, my mother said I wasn't going to the library and that I was lying to her. After a bit of an argument, she spoke to the library owner and found o...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 6,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 7
        },
        "total_judged": 7,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-03T05:16:13.756304"
    }
]