[
    {
        "id": "1ojuh4u",
        "title": "AITA for pushing back on my SIL for asking me to dress differently because her and my BIL are uncomfortable?",
        "url": "/r/AmItheAsshole/comments/1ojuh4u/aita_for_pushing_back_on_my_sil_for_asking_me_to/",
        "body_summary": "OP, 3mo postpartum, wears tank tops under sweaters for hot flashes. SIL said OP's tank tops make her/BIL uncomfortable, citing exposure when bending over, despite SIL's own less modest behaviors. OP apologized, then voiced feeling a double standard. SIL dismissed this. OP continued arguing the double standard. AITA for not just changing her outfits?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 122,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 124
        },
        "total_judged": 124,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-31T05:11:59.138657"
    },
    {
        "id": "1ojv3fj",
        "title": "AITA for refusing to praise my friend for buying a skirt?",
        "url": "/r/AmItheAsshole/comments/1ojv3fj/aita_for_refusing_to_praise_my_friend_for_buying/",
        "body_summary": "OP's friend bought a skirt for a costume & wanted praise. OP reacted neutrally, commenting on its length instead. Friend got upset, feeling insecure. OP thinks the skirt is boring and feels no need to praise a simple purchase. AITA for not validating their friend's feelings about buying a skirt?\n...",
        "reddit_judgments": {
            "YTA": 62,
            "NTA": 40,
            "ESH": 3,
            "NAH": 4,
            "INFO": 5,
            "TotalJudged": 114
        },
        "total_judged": 114,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-10-31T05:12:02.346610"
    },
    {
        "id": "1ok4zjp",
        "title": "AITA: Mom kicked me out at age 22 with no place to move into and got mad at me that I didn’t take simple pictures",
        "url": "/r/AmItheAsshole/comments/1ok4zjp/aita_mom_kicked_me_out_at_age_22_with_no_place_to/",
        "body_summary": "OP, 22F, sold her mom's house after being given power of attorney & a month to move out. She forgot to take pictures of the signed title but has videos. Her mom is now angry. AITA for forgetting the pictures?\n...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 21,
            "ESH": 4,
            "NAH": 3,
            "INFO": 6,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-31T05:12:05.216707"
    },
    {
        "id": "1ok7mpb",
        "title": "AITA Girlfriend sold my brother he car for $6000 on a payment plan. He totaled the car and gave it to me totaled. I don’t cover the remainder of his payment plan.",
        "url": "/r/AmItheAsshole/comments/1ok7mpb/aita_girlfriend_sold_my_brother_he_car_for_6000/",
        "body_summary": "GF sold brother a car. He wrecked it and stopped paying. OP fixed it, intending to sell it for him. Brother then demanded OP take over his remaining payments. OP refused. Family thinks OP is wrong. AITA?\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 40,
            "ESH": 9,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-31T05:12:07.381609"
    },
    {
        "id": "1ok6lnn",
        "title": "AITA For Calling My Aunt the Wrong Name",
        "url": "/r/AmItheAsshole/comments/1ok6lnn/aita_for_calling_my_aunt_the_wrong_name/",
        "body_summary": "OP dislikes their aunt who still uses a childhood nickname despite being asked not to. OP retaliates by using a wrong name for the aunt, which angers her. OP asks if they're the asshole for causing conflict over this.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 33,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-31T05:12:08.440390"
    },
    {
        "id": "1ok736m",
        "title": "AITA for suggesting my wife find another room for her late father's paining?",
        "url": "/r/AmItheAsshole/comments/1ok736m/aita_for_suggesting_my_wife_find_another_room_for/",
        "body_summary": "OP and his wife are renovating their home. The wife displays many reminders of her deceased father, which OP has tolerated. OP suggested moving the father's painting out of the newly renovated dining room. The wife reacted angrily. OP said they don't need a memory of her father in every room. AITA for suggesting moving the painting?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 36,
            "ESH": 0,
            "NAH": 4,
            "INFO": 0,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-31T05:12:10.085993"
    },
    {
        "id": "1okgj6s",
        "title": "AITA for refusing to take my friend’s Halloween pictures at a cemetery?",
        "url": "/r/AmItheAsshole/comments/1okgj6s/aita_for_refusing_to_take_my_friends_halloween/",
        "body_summary": "OP refused to take Halloween photos in a cemetery, deeming it disrespectful. Friend A is upset, and friend B says OP is causing drama. OP asks: AITA for refusing and causing drama?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 58,
            "ESH": 2,
            "NAH": 8,
            "INFO": 1,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-31T05:12:11.633770"
    },
    {
        "id": "1okh82q",
        "title": "AITA Pulled pokemon chase that I picked up from Walmart BF keeps bringing up the moment since we ripped together",
        "url": "/r/AmItheAsshole/comments/1okh82q/aita_pulled_pokemon_chase_that_i_picked_up_from/",
        "body_summary": "I went to Walmart and picked out 20 sleeves of pokemon cards for my boyfriend and I to rip. When I got back home he split up the booster sleeves 10 each and we split the cost. When we were ready to rip he said I took his stack of sleeves . I asked if he wanted to switch back and he said no, hesitantly (he said to add)  . I ended up pulling the $500 chase card. He’s brought it up at least twice now as a frustrating moment that he was annoyed about, but ends both times with “but I’m glad for you though”. AITA for thinking that he shouldn’t be frustrated at all because I picked out the sleeves in the first place. ",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 13,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-31T05:12:12.029465"
    },
    {
        "id": "1ok1c72",
        "title": "AITA for halting any help for my borther",
        "url": "/r/AmItheAsshole/comments/1ok1c72/aita_for_halting_any_help_for_my_borther/",
        "body_summary": "OP let brother stay. Brother got a job but skips work and expects OP to support him despite paying rent. OP told him to grow up and stopped helping. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 19,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 21
        },
        "total_judged": 21,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-31T05:12:12.946181"
    },
    {
        "id": "1ok15ha",
        "title": "AITA for being rude to a window salesman?",
        "url": "/r/AmItheAsshole/comments/1ok15ha/aita_for_being_rude_to_a_window_salesman/",
        "body_summary": "OP's wife answered the door to a window salesman despite OP's warning. The salesman persisted, and OP, hearing his wife struggle to decline, intervened and told him off. Wife is angry, calling OP rude. AITA?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 46,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-31T05:12:14.247624"
    }
]