[
    {
        "id": "1mro9hk",
        "title": "AITA for leaving my friend’s wedding after they said no plus ones but invited my ex with hers?",
        "url": "/r/AmItheAsshole/comments/1mro9hk/aita_for_leaving_my_friends_wedding_after_they/",
        "body_summary": "OP (25M) was invited to a friend's wedding with no plus one. His ex was there with her boyfriend. OP learned the ex was considered family. Annoyed that his GF wasn't invited but his ex was, OP left early. Groom called him dramatic. AITA for leaving?\n...",
        "reddit_judgments": {
            "YTA": 38,
            "NTA": 81,
            "ESH": 1,
            "NAH": 2,
            "INFO": 7,
            "TotalJudged": 129
        },
        "total_judged": 129,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-17T05:12:11.220283"
    },
    {
        "id": "1ms1x4k",
        "title": "AITA for refusing to give up our only bedroom for my mother in law to stay?",
        "url": "/r/AmItheAsshole/comments/1ms1x4k/aita_for_refusing_to_give_up_our_only_bedroom_for/",
        "body_summary": "OP's MiL is newly separated. OP offered her a sofa bed or air mattress for stays. Husband wants OP & him to give up their bed for MiL when she visits. OP refused. AITA for not giving up their bed?\n...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 77,
            "ESH": 1,
            "NAH": 15,
            "INFO": 3,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-17T05:12:14.703341"
    },
    {
        "id": "1mrz4xd",
        "title": "AITAH for wanting my brother to buy me out of my share of the house we both own that he lives in.",
        "url": "/r/AmItheAsshole/comments/1mrz4xd/aitah_for_wanting_my_brother_to_buy_me_out_of_my/",
        "body_summary": "OP let her brother live in their shared childhood home, expecting him to pay property taxes and bills. He hasn't. After their mom left her house to him, OP wants him to buy her out of their dad's house using his inheritance to avoid losing it to tax seizure. AITA for wanting him to use the inheritance to buy me out?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 79,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 82
        },
        "total_judged": 82,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-17T05:12:16.582207"
    },
    {
        "id": "1mro2o2",
        "title": "AITA. Lady claimed I’d nicked her table and I refused to move",
        "url": "/r/AmItheAsshole/comments/1mro2o2/aita_lady_claimed_id_nicked_her_table_and_i/",
        "body_summary": "OP took a table with dirty dishes. A woman claimed it was hers, pointing to a coffee cup and a room key. The key was actually OP's. The woman was rude. OP refused to move. AITA?\n...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 25,
            "ESH": 4,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 46
        },
        "total_judged": 46,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-17T05:12:18.484596"
    },
    {
        "id": "1mrx7by",
        "title": "AITA for not texting my husband for coming home early",
        "url": "/r/AmItheAsshole/comments/1mrx7by/aita_for_not_texting_my_husband_for_coming_home/",
        "body_summary": "So my week is very standard. Mondays - Wednesdays, I am in the office. Thursdays - Saturdays, I will be at my mum’s place. So when I am at my mum’s place, usually my dad will drive me home. But timing is a little irregular. It can be about 10pm or past midnight. So, one day, I came home early. About 9.30pm. And my husband got upset. Saying that I did not let him know that I would be home earlier than usual. So I asked why do I need to text him if I am home early. Then he said that he will worry. Mind you, he knows that I am at my mum’s place and we have been texting the whole day. Is it my fault? I really don’t understand the logic with me not informing him of if I am coming home earlier than usual. ",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 52,
            "ESH": 0,
            "NAH": 5,
            "INFO": 3,
            "TotalJudged": 60
        },
        "total_judged": 60,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-17T05:12:19.904049"
    },
    {
        "id": "1ms7ezh",
        "title": "AITA for gatekeeping my late aunt’s kugel recipe?",
        "url": "/r/AmItheAsshole/comments/1ms7ezh/aita_for_gatekeeping_my_late_aunts_kugel_recipe/",
        "body_summary": "OP found their lost recipe book containing their deceased aunt's special kugel recipe. The aunt's son wants OP to post it publicly on Facebook. OP is hesitant as it feels personal and exclusive to family. AITA for refusing to share it publicly?\n...",
        "reddit_judgments": {
            "YTA": 67,
            "NTA": 22,
            "ESH": 1,
            "NAH": 8,
            "INFO": 1,
            "TotalJudged": 99
        },
        "total_judged": 99,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-17T05:12:22.160076"
    },
    {
        "id": "1msc49z",
        "title": "AITA for refusing to only nurse in my bedroom on family trip?",
        "url": "/r/AmItheAsshole/comments/1msc49z/aita_for_refusing_to_only_nurse_in_my_bedroom_on/",
        "body_summary": "OP's in-laws dislike her nursing publicly. They want her to nurse exclusively in the bedroom during a beach trip. OP doesn't want to be isolated. Husband wants her to comply, threatening resentment. AITA for not going?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 112,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 113
        },
        "total_judged": 113,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-17T05:12:24.986671"
    },
    {
        "id": "1mrno4f",
        "title": "AITA for not sending $10 for Starbucks…",
        "url": "/r/AmItheAsshole/comments/1mrno4f/aita_for_not_sending_10_for_starbucks/",
        "body_summary": "OP, working two jobs, is struggling financially while their former coworker hasn't sought employment and asks people for money. The coworker asked OP for $10 for Starbucks for her kid's birthday. OP refused, feeling the request was audacious given their contrasting situations. AITA for not giving her the money?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 43,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-17T05:12:26.217095"
    },
    {
        "id": "1msal50",
        "title": "AITA for refusing to clean out my grandpa’s house 25 yrs post death.",
        "url": "/r/AmItheAsshole/comments/1msal50/aita_for_refusing_to_clean_out_my_grandpas_house/",
        "body_summary": "OP refuses to clean out their deceased grandpa's derelict, animal-feces-filled house, left to their aunt for 25 years. Aunt expects OP to do it despite past refusals of help. OP told her it's her responsibility. Now the aunt is ghosting OP. AITA?\n...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 57,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 64
        },
        "total_judged": 64,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-17T05:12:28.226176"
    },
    {
        "id": "1ms059k",
        "title": "AITA? told my friend he doesnt need everyones attention",
        "url": "/r/AmItheAsshole/comments/1ms059k/aita_told_my_friend_he_doesnt_need_everyones/",
        "body_summary": "OP invited friend to a party. Friend tried telling a story but was interrupted by side conversations. He felt ignored and called OP's friends rude. OP defended her friends, saying it was unreasonable to expect everyone to listen. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 19,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 19
        },
        "total_judged": 19,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-17T05:12:29.094513"
    }
]