[
    {
        "id": "1r5cluj",
        "title": "AITA for telling our roommate she might need to move out if she keeps complaining about hearing us at night?",
        "url": "/r/AmItheAsshole/comments/1r5cluj/aita_for_telling_our_roommate_she_might_need_to/",
        "body_summary": "My boyfriend and I let a friend he’s known since childhood stay at our place because housing is expensive and her university is nearby. She stays here five days a week and goes home on weekends. \n\nWe don’t charge her rent, and we pay for utilities and groceries while she’s here. She has her own bathroom and full access to basically everything, things the kitchen, pool, sauna etc. \n\nHer bedroom isn’t next to ours. Between our bedroom and her space is a computer/working room, and her bathroom is also in between, so there’s some separation. \n\nA few months ago, she told us she could hear us being intimate at night, and it made her uncomfortable. We said we’d try to be quieter when she’s around. Since then, she has brought it up multiple times. \n\nRecently, she asked if she could switch rooms. T...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 127,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-16T06:00:41.083227"
    },
    {
        "id": "1r57i1n",
        "title": "AITA for refusing to give my mom my savings after she found out how much I have? (19F)",
        "url": "/r/AmItheAsshole/comments/1r57i1n/aita_for_refusing_to_give_my_mom_my_savings_after/",
        "body_summary": "I’m 19F, currently in college and still living at home. I’ve been working part-time since I was 16 and I’m really strict about saving. I don’t go out much, don’t buy expensive stuff, and I’ve managed to save a decent amount (around $4k).\n\nLast week my mom asked me to log into my banking app to transfer money for groceries because her card “wasn’t working.” While I was doing that, she saw my total savings.\n\nShe went quiet and later that night told me that since I’m living under her roof, I should contribute more and that it’s “selfish” of me to hoard money while she’s struggling. She asked me to give her $2k to “help the family” and said I could always earn it back.\n\nThe thing is, she’s not unemployed or anything. She works full-time. We’re not rich, but we’re not in crisis either. I alread...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 112,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 118
        },
        "total_judged": 118,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-16T06:00:59.971716"
    },
    {
        "id": "1r57b93",
        "title": "AITA for reminding a guy I got absolutely nothing as a retirement gift when being asked to contribute to another?",
        "url": "/r/AmItheAsshole/comments/1r57b93/aita_for_reminding_a_guy_i_got_absolutely_nothing/",
        "body_summary": "I retired from the Army reserve after 22 years in the summer of 2024. I got nothing as a parting gift from any level (unit, BN, BDE, etc.). I didn’t really care. I was just happy to be retired and have put that phase of my life behind me.\n\nThis past week I was asked over text by the same guys who couldn’t be bothered to give me so much as a certificate of appreciation on a piece of A4 if I wanted to contribute to a gift for another guy who is retiring soon. They plan to get him a 1911.\n\nI told them I would but kind of jokingly reminded him I didn’t even get a used Starbucks gift card when I left. I didn’t get a reply. Waited a couple days and let him know that I really wasn’t trying to be an ass if it had seemed like it but that I was caught a little off guard being asked to contribute to ...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 49,
            "ESH": 1,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-16T06:01:09.326882"
    },
    {
        "id": "1r5q95z",
        "title": "AITA for ruining my friend's proposal moment?",
        "url": "/r/AmItheAsshole/comments/1r5q95z/aita_for_ruining_my_friends_proposal_moment/",
        "body_summary": "I (24F) hosted a Valentine's Day party this Friday for our friend group. Two of the friends in this group Emily (25F) and Tyler (25M) have been dating for a while. A few days before the party Tyler texted me he was planning to propose to Emily at my party. He seemed really excited and asked me if I could help him plan the moment.\n\nThe thing is Emily is one of my closest friends and has told me multiple times over the years that she would HATE a public proposal. Like, she's been very clear about this. She's mentioned it to me when we were both attending another wedding. She thinks they're performative and is the most shy and introverted person I know. She would be anxious at the thought of so many eyes on her and feel pressured to say yes even if she didn't want to.\n\nI tried to hint subtly ...",
        "reddit_judgments": {
            "YTA": 113,
            "NTA": 30,
            "ESH": 20,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 169
        },
        "total_judged": 169,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-16T06:01:21.016778"
    },
    {
        "id": "1r5de20",
        "title": "AITA for standing up to my mom over a Facebook post and raising my voice at my wife?",
        "url": "/r/AmItheAsshole/comments/1r5de20/aita_for_standing_up_to_my_mom_over_a_facebook/",
        "body_summary": "My wife (29F) and I (31M) have a 6-month-old daughter. Before she was born, we agreed we didn’t want photos posted publicly. My mom (58F) usually respects this… until last week, when she posted a clear picture of our daughter at the park.\n\nI asked her to take it down and explained it’s about privacy and consent. She claimed I was only doing it because of my wife and that I didn’t really care. I raised my voice and told her she’s crossing the line and making our already complicated marriage harder. My mom says I was disrespectful.\n\nLater, I talked to my wife about it. She said I was right to stand firm, but then said my mom probably won’t babysit again and that she can’t be trusted around our daughter. I told my wife she was overreacting and that it wasn’t fair to punish my mom for one mist...",
        "reddit_judgments": {
            "YTA": 70,
            "NTA": 9,
            "ESH": 6,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 89
        },
        "total_judged": 89,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-16T06:01:29.502369"
    },
    {
        "id": "1r5xfvs",
        "title": "AITA for not being “discreet” about my up coming procedure",
        "url": "/r/AmItheAsshole/comments/1r5xfvs/aita_for_not_being_discreet_about_my_up_coming/",
        "body_summary": "This literally just happened like a hour ago.\n\nSo I 34F am about to have a total dental extraction and most likely being stuck with dentures with a slim possibility of implants down the line, I’ve already come to terms about this and honestly I’m excited to just not be in pain anymore and to be comfortable smiling in front of others.\n\nBut I was talking to my team at work about it since I’ll be off for about a week, which they are all happy for me btw, one of my other coworkers was there, who we’ll call C (40s F), who didn’t say anything right then but after the others left (C was off at 7pm I’m of 10pm the others were off at 4pm and 5pm) told me I should be “discreet”about having dentures so young in front of others.\n\nI’m like ??? What do you mean? And she’s said she’d be embarrassed to ha...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 39,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-16T06:01:37.471628"
    },
    {
        "id": "1r5rl6p",
        "title": "AITA for not buying my sister food when she came home from her trip?",
        "url": "/r/AmItheAsshole/comments/1r5rl6p/aita_for_not_buying_my_sister_food_when_she_came/",
        "body_summary": "My sister and I live together. She went for a mini trip and she landed not too long ago. I’ve been working all week, getting home in the evening and then having to leave early in the morning for work so I haven’t had time to grocery shop or cook. Today is one of two days off and I cleaned a little bit and deservingly relaxed today. \n\nShe landed back home from her trip, and I thought to myself that she must be hungry. So I texted her that I will order food and asked her what she wants.\n\nShe’s tells me she has no idea because she’s bloated and that she wants real food, not fast food.\n\nThe thing about her is that she’s very particular about her food. She likes things a specific way. So she never ends up telling me what she wants, she comes home to no food and gets mad at me. Mad about how I g...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 54,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-16T06:01:45.333136"
    },
    {
        "id": "1r5nobk",
        "title": "AITA for calling out my best friend’s boyfriend at her birthday dinner for constantly “joking” at her expense?**",
        "url": "/r/AmItheAsshole/comments/1r5nobk/aita_for_calling_out_my_best_friends_boyfriend_at/",
        "body_summary": "Thus, \"Lena\" (28F) is my best friend, and I am (27F). Since college, we have been inseparable. We met at \\*\\*the University of Michigan\\*\\* during our freshman year, and together we overcame heartbreaks, awful roommates, and far too many late-night pizza orders. Lena began dating this guy, \"Mark,\" 30M, about a year ago. I made a sincere effort to like him at first. However, he would constantly make small remarks about Lena whenever we all got together, such as correcting her stories in the middle of sentences or making light of the fact that she was \"bad with money\" in public. I didn't find it amusing. It appeared to be disparaging. Let's go back to last month. I was invited to Lena's birthday dinner. Mark organized it. This fancy rooftop restaurant downtown is where we all first met. Ever...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 23,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-16T06:01:53.096927"
    },
    {
        "id": "1r5757t",
        "title": "AITA for leaving my friend at an aquarium during a hangout?",
        "url": "/r/AmItheAsshole/comments/1r5757t/aita_for_leaving_my_friend_at_an_aquarium_during/",
        "body_summary": "Hi reddit. I’m using a throwaway but this isn’t my first time scrolling here.\n\nSo I (18f) and my friend (20m) made plans for an aquarium “date” for valentines. We are both the only single people in our friend group and are pretty close so it was kinda like a friend valentine thing. We were both excited as this is a new opened aquarium in our area and my friend really loves sea animals. I don’t know much about them so he likes to talk to me about fun facts and such.\n\nThe problem started when we were walking around looking at the bigger animals. It was really busy with mostly children. We were looking at some big tank when we heard kids next to us talking about the animals. They were (obviously) joking about one of the bigger fish eating all the little fish and that’s why it was so big. My f...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 29,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-16T06:02:00.744801"
    },
    {
        "id": "1r5w41w",
        "title": "AITA FOR kicking my niece out of my room?",
        "url": "/r/AmItheAsshole/comments/1r5w41w/aita_for_kicking_my_niece_out_of_my_room/",
        "body_summary": "Ive lived in my mothers house paying rent for nearly 15 years now. My brother moved back in with his child (putting his daughter in my room non master bedroom) taking over the master bedroom my grandma previiusly used. This happend 6 years ago. This was only supposed to be a temp solution untill they found a house. Today i kicked her out of my room for private time with my long distance partner and told him shes done staying in my room. She is 9 years old now. Hes now angry with me and making remarks about my personal life and my life. Am i in the wrong for kicking his child out of my room?\nShe lives in my room i a 27 yo man her uncle, her now 9 years old i pay rent to help my mother pay for the house payment, car payments. My brother and SIL do not pay rent and provide food occationaly an...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 28,
            "ESH": 5,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 43
        },
        "total_judged": 43,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-16T06:02:10.163296"
    }
]