[
    {
        "id": "1qapt9i",
        "title": "AITA for reacting badly to my friend’s religious remark at a funeral?",
        "url": "/r/AmItheAsshole/comments/1qapt9i/aita_for_reacting_badly_to_my_friends_religious/",
        "body_summary": "My (24F) friend (25F) came to the funeral for my mom, who died of cancer around Christmas time. She came over to me to give me her condolences and asked about the details of how my mom passed. I told her it was my mom’s second battle with cancer and how she had lots of complications.\n\nShe said “I’m so glad nothing like that has ever happened to me or my family. We’re blessed and highly favored. God doesn’t play about us.” This made me extremely angry.\n\nI said “Glad to know your God plays about my family and all the other people in the world dying of cancer.”\n\nI caused a scene and got really upset. She and her family said I’m wrong for attacking someone just being kind and offering their condolences, and that’s probably why God didn’t look after my Mom.\n\nI said I want them gone from the fun...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 148,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 149
        },
        "total_judged": 149,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-13T05:18:32.527501"
    },
    {
        "id": "1qaxmf2",
        "title": "AITAH my roommate is a light sleeper and after multiple complaints from her I advised her to see a doctor",
        "url": "/r/AmItheAsshole/comments/1qaxmf2/aitah_my_roommate_is_a_light_sleeper_and_after/",
        "body_summary": "In our house, there’s five people and four cats. Everyone there is safely full of love, and I don’t think anyone truly has any malice, but sometimes I do think there’s lack of consideration and may be it comes from all of us.\n\nRecently, it’s been an issue where my roommate who is in school gets woken up by us closing doors or closing the toilet or anything really. She tried to resolve the problem by turning on a fan in her room to help with the sound, and I tried to help by putting hush bumps on everyone’s door. But sometimes they don’t work perfectly because it doesn’t stop the click from the door knob so you have to close it with the awareness that you have to turn the door knob.\n\nAfter months, she’s still complaining that the noise wakes her up and then she can’t go back to sleep and th...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 112,
            "ESH": 0,
            "NAH": 6,
            "INFO": 1,
            "TotalJudged": 120
        },
        "total_judged": 120,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-13T05:18:50.530491"
    },
    {
        "id": "1qamywg",
        "title": "AITA for tearing my family apart over a carseat (according to my Stepmom)?",
        "url": "/r/AmItheAsshole/comments/1qamywg/aita_for_tearing_my_family_apart_over_a_carseat/",
        "body_summary": "My stepmom (41F) and dad (46M) have been married for nearly twenty years at this point, and she has consistently been emotionally abusive during my adolescence along with favoring her biological children over myself. She also might be a narcissist, but I’m not a doctor. \n\nEverything blew up in my face over this past summer 2025. My husband (26M) is on assignment overseas and has been for two years now. I have been solo parenting our young children (4F, 3M, 1M), and had been promised support by my dad when I made the choice to move back home. In June, I found out FROM MY TODDLER (3F AT THE TIME) that Stepmom had driven my daughter from her house to a relative’s down the road with a 45 mph speed limit without a car seat (a road with common reckless driving). The trip was two miles maximum, b...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 49,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-13T05:19:06.648711"
    },
    {
        "id": "1qav9nl",
        "title": "AITA for being upset that my sister won't give me a +1 to her wedding",
        "url": "/r/AmItheAsshole/comments/1qav9nl/aita_for_being_upset_that_my_sister_wont_give_me/",
        "body_summary": "My little sister is getting married this summer and I couldn't be happier for her. She seems really happy and deserves all of it. \n\nShe met her partner this year, and they got engaged fairly quickly and are getting married within a year of knowing eachother. Around the same time she met her partner, I met mine. By the time the wedding arrives, we'll both be with our partners for the same amount of time. She did not give me a +1 for my partner for the wedding. I told her im  in a serious relationship and we're wanting to integrate our lives but she will not make an exception. She said \"if you guys are engaged by that time, I'll reconsider\". That was hurtful as our timelines are different and we aren't in a rush. The wedding is being held at a private rental home versus a wedding home, and i...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 45,
            "ESH": 1,
            "NAH": 15,
            "INFO": 7,
            "TotalJudged": 74
        },
        "total_judged": 74,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-13T05:19:23.404769"
    },
    {
        "id": "1qaxdxd",
        "title": "Update: AITA for wanting to take my cat with me after my wedding",
        "url": "/r/AmItheAsshole/comments/1qaxdxd/update_aita_for_wanting_to_take_my_cat_with_me/",
        "body_summary": "First post: https://www.reddit.com/r/AmItheAsshole/s/iMi4qVajP1\n\nThank you for the feedback to my original post. I took comfort in the fact that I was well within my rights to take Casper with me, and was determined to do that. A few comments, one in particular had stressed that I should make sure to do what's best for Casper.\n\nDespite our arguments I got the feeling my parents and sister (or my parents at least) had accepted that Casper would be coming with me. My dad had talked about how I should introduce him briefly to my fiance's house in advance, so it seems like they had accepted it.\n\nOne thing that I had been asked to consider was who his person was. While as a kitten Casper was only bonded to me (especially when my parents were still against him) he is a family cat now. He'll some...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 1,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 1
        },
        "total_judged": 1,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-13T05:19:39.035619"
    },
    {
        "id": "1qavrid",
        "title": "AITA- My co worker wants to use my Amazon prime to order personal items???",
        "url": "/r/AmItheAsshole/comments/1qavrid/aita_my_co_worker_wants_to_use_my_amazon_prime_to/",
        "body_summary": "Hi all! I’m new to Reddit and this is my first post. Anyways, my colleague wants to use my Amazon prime to order personal stuff and zelle me money after she orders her stuff.\n\nI’m not comfortable with that- I told her no I can’t Do that and she became annoyed with me.\n\nWhen she’s around there’s always eggshells and she has some kind of chip on her shoulder and acts like everyone owes her. I do my best to keep it professional.\n\nSo, am I the asshole??\n\n  \nETA: I forgot to mention, I have occasionally allowed her to use my address to have things shipped to my house. One time it was for a surprise party and she had 200 candles delivered. The boxes of course didn't show. She was calling me all weekend. I had to go meet her cousin b/c they put the wrong address and they were sent back to sender ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 66,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 70
        },
        "total_judged": 70,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-13T05:19:55.084784"
    },
    {
        "id": "1qaoxby",
        "title": "AITA for refusing to help my friend after she embarrassed me?",
        "url": "/r/AmItheAsshole/comments/1qaoxby/aita_for_refusing_to_help_my_friend_after_she/",
        "body_summary": "I’m 20F, and my friend (20F) and I are in college together. We’re usually close and help each other out.\n\nA few weeks ago, while hanging out with classmates, she started joking about how “dramatic” I am and how she basically “carries me” academically. People laughed, and she kept going. I laughed it off, but it honestly hurt. When I told her later, she said I was being too sensitive and that it was “just a joke.”\n\nLast week, she asked me for notes and help studying because she missed classes. Normally I would help, but this time I said no and suggested she ask someone else.\n\nNow she’s upset and calling me petty. Some friends think I should’ve helped her anyway.\n\nAITA?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-13T05:19:55.365365"
    },
    {
        "id": "1qap8cf",
        "title": "AITA For kicking out my brother due to financial reasons",
        "url": "/r/AmItheAsshole/comments/1qap8cf/aita_for_kicking_out_my_brother_due_to_financial/",
        "body_summary": "  Hello I'm a 30M and this is an event that happened 2 and a half years ago and I keep feeling guilty and horrible every time I think about it.  \n\n  Let's start from the beginning my brother 21 at the time has not been getting along with our dad because he made promises about help him run the drywall business and didn't keep them so when things were getting heated I offered to let him live with us and find a new job. He accepted and when he arrived he didn't hesitate to start looking for work. I was willing to let him live there till he got a job and saved to start renting an apartment. He got a job at a casino as a janitor and made good money. He even chipped in to help us out around the house mostly groceries. \n\nNow later my brother was struggling after awhile to get to work on time or e...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 5,
            "ESH": 0,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 11
        },
        "total_judged": 11,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-13T05:20:10.917944"
    },
    {
        "id": "1qav4qc",
        "title": "AITA for telling my roommate she can't feed her cat, my cat's food?",
        "url": "/r/AmItheAsshole/comments/1qav4qc/aita_for_telling_my_roommate_she_cant_feed_her/",
        "body_summary": "So, there's going to have to be some back ground given to the current situation as well, but this morning I woke up to a text from my roomate saying she had to give my cat food to her cat bc she didn't realize she was out. I told her that she couldn't use my cat's food (even though it was too late she already had without waiting for permission.) And that she simply needed to go buy her cat, even just a single can, even if she's broke, (we're both broke, waiting to get paid later today). \n\n   For more context, we're both employees at a retail store that we live literally right next to, she works overnightshifts though, and I work days/evenings/closing whenever. I know that she can scrape together the 72¢ or a less than a dollar it takes to feed her cat the food she chooses (Friskies pate), ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 7,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 11
        },
        "total_judged": 11,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-13T05:20:26.568875"
    },
    {
        "id": "1qan9yk",
        "title": "AITA for standing up to my mom whenever she gives me unsolicited advice?",
        "url": "/r/AmItheAsshole/comments/1qan9yk/aita_for_standing_up_to_my_mom_whenever_she_gives/",
        "body_summary": "This always happens, I just don't understand how to deal with it. I get that she cares enough to try and fix whatever mistakes I pull and she wants to be the best I can be with what she knows, yet I'm always happier when I don't follow her advice nowadays.\n\nAll my life I've been told how to feel, what to do, and who to be by her. Earlier, I was just venting to her about how I've been waiting a long time for my professional references (her friends) to fill out a form for me and she comes at me saying that I need to be patient and if they don't it's my fault for not being persistent enough. I understand if she doesn't want to bug them, but I don't either. But to bring up the fact that I can never be successful just because I lack in my professional references and also bring up all my life fa...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 5,
            "ESH": 0,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 10
        },
        "total_judged": 10,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-13T05:20:42.159756"
    }
]