[
    {
        "id": "1pg2twz",
        "title": "AITA for calling my wife entitled and not standing up for her when my mom's boyfriend yelled at her?",
        "url": "/r/AmItheAsshole/comments/1pg2twz/aita_for_calling_my_wife_entitled_and_not/",
        "body_summary": "My wife and I are going through a rough patch right now. We recently ended up in a financial predicament and could no longer afford our apartment. My mom opened her home to us. It's been tough but my mom has been great, helping with childcare, and never making us feel bad.\n\nThe issue is my mom's boyfriend \"Brian\" My mom goes out about once a week with a friend and he has been having people over. He has a very good friend \"Christine\" who seems like a nice enough person but she puts everything in her mouth. i am not exaggerating when I say EVERYTHING. She was over for Thanksgiving and I ran to the liquor store with Brian and when we came back my mom was annoyed because Christine put her mouth on her pie. Her expensive Canada Goose jacket has actual teeth prints. I'd call it compulsive.\n\nMy w...",
        "reddit_judgments": {
            "YTA": 24,
            "NTA": 38,
            "ESH": 32,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 99
        },
        "total_judged": 99,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-12-07T05:11:02.878760"
    },
    {
        "id": "1pfvcxu",
        "title": "AITA for wanting to spoil our daughter on her birthday?",
        "url": "/r/AmItheAsshole/comments/1pfvcxu/aita_for_wanting_to_spoil_our_daughter_on_her/",
        "body_summary": "My husband and I have 2 kids. Our youngest just turned 4 and we wanted to throw a small party for her and my cousin begged us to make it a shared party for my daughter and hers who turned 5 a few weeks ago but didn't have a party because they couldn't afford it.\n\nI didn't want to do it but eventually agreed and figured it wouldn't hurt us to have a few more guests and an extra cake.\n\nIt didn't go well.\n\nMy husband loves to spoil our baby and he showered her with gifts.\n\nAfter the party my cousin bew up at me calling me a b*tch saying I did it on purpose and her daughter was crying because she got nothing compared to my daughter. I didn't realize agreeing to this meant I can't even spoil my baby.\n",
        "reddit_judgments": {
            "YTA": 78,
            "NTA": 50,
            "ESH": 29,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 160
        },
        "total_judged": 160,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-07T05:11:08.045078"
    },
    {
        "id": "1pfmn75",
        "title": "AITA if I stop buying Christmas presents?",
        "url": "/r/AmItheAsshole/comments/1pfmn75/aita_if_i_stop_buying_christmas_presents/",
        "body_summary": "I’m the youngest of five and have no kids of my own, but my four brothers and sisters all have many kids (4, 2, 2, 4), and those 12 nieces and nephews all have 8 kids of their own. We used to always buy presents for each other’s kids, so I naturally started getting gifts for their kids.\n\nA few years ago, I realized that practically no gifts were opened at all… but I didn’t think much of it. The next year it happened again and I found out that my siblings got together and agreed that they would stop buying gifts for each other’s kids because our family was growing. They didn’t tell me and the only thing said was, “You just now realized it?”\n\nI was a little upset they didn’t include me. But I get it, I don’t have any kids of my own, but I’ve always bought gifts and they know it.\n\nThe past co...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 47,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-07T05:11:24.137539"
    },
    {
        "id": "1pfmie1",
        "title": "AITA for refusing to act like my in-laws’ full-time maid even though I have a job and a 2-year-old?",
        "url": "/r/AmItheAsshole/comments/1pfmie1/aita_for_refusing_to_act_like_my_inlaws_fulltime/",
        "body_summary": "Throw away account as i can't rant about this from my main account.\n\nI live with my husband’s parents and it's very common in Indian marriages and they expect me to follow a daily list of DIL duties. One of it is touching their feet every morning although it's common in india to touch elders feet and taking blessings from them, isn't it weird to do that every other day and I already do it and it's not even the issue but they treat it like some attendance ritual I must perform on time and will get looks from them if I didn't do that.\n\nI am a software engineer and I have chosen work from home to take care of my toddler but what I am doing everyday is household chores rather than parenting my kid.\n\nWe do have a househelp, but only for basic things like sweeping, mopping, and washing clothes. ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 35,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 39
        },
        "total_judged": 39,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-07T05:11:40.605559"
    },
    {
        "id": "1pfix9i",
        "title": "AITA for not giving my little sister a kitten",
        "url": "/r/AmItheAsshole/comments/1pfix9i/aita_for_not_giving_my_little_sister_a_kitten/",
        "body_summary": "So my cat recently had 4 very cute kittens, truth is though I can’t keep them all so i decided to give them out to nice homes where they could be nice and protected. I been in the process of neutering and stuff like that. When I told my family about this my little sister immediately wanted to come over to my apartment and see them. I decided why not, maybe human smells around the kittens would help them warm up around the idea of humans. When she came over I noticed she was very rough around them and crossing kitten boundaries. (Just grabbing them off my cat when my cat was breastfeeding, picking them off when they were scared, not holding them properly, etc). I told her how to interact with them properly and that was that. A few days after that I finally found proper homes for them but th...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 13
        },
        "total_judged": 13,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-07T05:11:56.168370"
    },
    {
        "id": "1pfuah6",
        "title": "AITA for refusing to let my sister bring her dogs over after my mom just had major surgery on her shoulder?",
        "url": "/r/AmItheAsshole/comments/1pfuah6/aita_for_refusing_to_let_my_sister_bring_her_dogs/",
        "body_summary": "My 73-year-old mom recently had major shoulder surgery, and her doctors warned that any little thing could tear her shoulder again. She must be extremely careful for several months to a year for full recovery but especially over the next 8 weeks. My sister planned to come over for lunch and I already knew she would try to bring her two large untrained pitbulls. One is a rescued long term stray and the other is one of the stray's now full sized puppy around two years old that gets excited easily. These dogs have knocked my mom down before, causing her to hit her head on pavement, and they have almost knocked her over several other times which have left her bruised. They jump unpredictably and play rough without thinking.\n\nBefore my sister left her house, I tried calling and texting her to h...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 52,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-07T05:12:12.186473"
    },
    {
        "id": "1pg3sng",
        "title": "AITA for being rude towards my MIL or is my husband the real AH?",
        "url": "/r/AmItheAsshole/comments/1pg3sng/aita_for_being_rude_towards_my_mil_or_is_my/",
        "body_summary": "AITA for being rude towards my mother in law or is my husband the real AH\n\nMy mother in law insists on visiting my daughter every Saturday and Sunday usually between the hours of 1:30 and 3:30 pm. The problem with her chosen time slot is that this is the middle of the night for me. I'm a nurse and currently the breadwinner of our family. I work 12 hour overnights shifts beginning at 7:00pm ending at 7:30am every Friday Saturday and Sunday. \n\nIn contrast, my mother in law does not have a single obligation in her life. Arguibly, she has not had a single obligation in the last 30 years. She chooses to come at the most inconvenient time for me. \n\nI've never been a morning person, and am certainly NOT in the mood for any form of small talk immediately upon rising. Any dialogue between her and I...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 45,
            "ESH": 0,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-07T05:12:28.189215"
    },
    {
        "id": "1pg25si",
        "title": "AITA for telling my mother that no one will buy her old couch?",
        "url": "/r/AmItheAsshole/comments/1pg25si/aita_for_telling_my_mother_that_no_one_will_buy/",
        "body_summary": "This one has been a long-standing family issue and, frankly, I'm tired. So, I'm going to come to Reddit to settle the question if I'm the asshole for telling my mother than no one wants to buy her old couch and we should just take it to the dump.\n\nBackground - my mother has a 50 odd year old Lazyboy hide a bed. It's old. It's dirty. Someone had a nosebleed on it at one point in time, her cats have scratched it up, and it sags. She doesn't want to pay the $25 dump fee and has instead thrown a tantrum until I listed it online for her. This is after being repeatedly told that the couch won't be sold. We tried this before with an old (read: 30 years old) Lazyboy recliner. It sat in my garage for months before I finally just donated it to Goodwill and told her after the fact. The recliner was i...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 41,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 46
        },
        "total_judged": 46,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-07T05:12:44.007281"
    },
    {
        "id": "1pg7g6j",
        "title": "AITA for not getting my MIL food?",
        "url": "/r/AmItheAsshole/comments/1pg7g6j/aita_for_not_getting_my_mil_food/",
        "body_summary": "My MIL is on disability and lives with us because she can’t afford to live on her own. She’s capable of feeding herself. \n\nMe, my husband, and son are all  busy people right now, so I cook dinner 4-5 nights a week. The other 2-3 nights we eat out or at friends. \n\nThere is always something to eat in the house even if I don’t cook. \n\nMy husband is off with friends today, so when I picked my son up from work, we stopped for dinner at our favorite spot. \n\nWhen we got home I could hear my MIL very clearly on the phone. She was complaining to her daughter about how I never offer to bring dinner home or take her out with me. She went as far as to call me an a-hole for not making sure she was fed when I know she isn’t feeling well. \n\nShe didn’t say a word about how my husband doesn’t invite her or...",
        "reddit_judgments": {
            "YTA": 19,
            "NTA": 20,
            "ESH": 2,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-07T05:12:59.960177"
    },
    {
        "id": "1pfyqh7",
        "title": "AITA for asking my brother to bring me to the ER and upsetting my mom?",
        "url": "/r/AmItheAsshole/comments/1pfyqh7/aita_for_asking_my_brother_to_bring_me_to_the_er/",
        "body_summary": "I’m posting here because I’ve been feeling really guilty about this situation. \nA couple of days ago, I got suddenly sick. At first I thought I just needed to rest, but then I started throwing up repeatedly. I kept getting hot flashes, feeling like I was going to pass out, before vomiting again and getting really cold after. This went on every 10-15 minutes for about three hours, and I couldn’t keep water or medication down. \nThis exact thing happened to me a few months ago, and after five hours of nonstop vomiting I ended up in the ER. Since it felt the same this time and wasn’t stopping, I called my brother to ask if he could bring me to the ER again. We live very close to each other, and I live alone, so he was the only nearby person I could realistically ask. At the hospital, they put ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 38,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-07T05:13:15.628505"
    }
]