[
    {
        "id": "1qydatl",
        "title": "AITA for skipping my friend's daughter’s 1st birthday and charging her for the \"gift\" after she forgot to tell me the time changed?",
        "url": "/r/AmItheAsshole/comments/1qydatl/aita_for_skipping_my_friends_daughters_1st/",
        "body_summary": "I’m feeling pretty heated right now and need some perspective.\n\nMy friend’s daughter is turning one today. A few weeks ago, my friend asked if I could make truffles for the party. I agreed, and she mentioned she would reimburse me for the ingredients. However, because truffles are expensive to make and incredibly labor-intensive, I decided I would just gift them as the birthday present instead of asking for money.\n\nI spent all day yesterday in the kitchen making these. I had to wake up super early this morning to finish the final touches and get ready for the 9 AM start time listed on the invitation.\n\nI showed up at 9 AM sharp, truffles in hand, and the place was empty. I double-checked the invite and it definitely said 9 AM. I called my friend, and she casually told me that the time had b...",
        "reddit_judgments": {
            "YTA": 29,
            "NTA": 21,
            "ESH": 2,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-08T05:55:21.433749"
    },
    {
        "id": "1qy7527",
        "title": "AITA for being short with people leaving after closing",
        "url": "/r/AmItheAsshole/comments/1qy7527/aita_for_being_short_with_people_leaving_after/",
        "body_summary": "I am going to preface this by saying I know this is not a big deal but I am annoyed so I need to know if I was justified or not.\n\nI (26F) work at a big chain gym and we close at 10 pm on Fridays. I do not usually close but I picked up a shift today as a favor. About an hour before closing I warn people coming in that we close at 10pm because on Monday-Thursday we close at 11pm so some people don’t know. 30 min before closing and every 10 mins after I warn people on the intercoms we are closing in \\_\\_\\_ minutes and to please start cleaning up and making your way to the front. I get pretty much everyone out of the gym by 10:08 except for two guys who are in the locker room. I asked the guys who left before them if anyone is still in there and they let me know there are two guys still there....",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 53,
            "ESH": 2,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-08T05:55:29.360478"
    },
    {
        "id": "1qye2wc",
        "title": "AITA for losing my friend’s expensive sunglasses almost 2 years after she forgot them on a trip?",
        "url": "/r/AmItheAsshole/comments/1qye2wc/aita_for_losing_my_friends_expensive_sunglasses/",
        "body_summary": "I (20s) went on a trip with my friend (also 20s) in September 2024. At the end of the trip, she forgot her sunglasses at the place we stayed.\n\nSince she went back to her city first and I went back to mine, I took the sunglasses home with me so I could give them back later. I immediately told her she’d forgotten them, told her I had them, and she thanked me.\n\nIn February 2025, she asked me about the sunglasses, and I confirmed they were still at my house. I never used them or touched them after the trip because they aren’t mine, I left them in their case in my dresser.\n\nFast forward to now: she came to my city to visit. She mentioned the sunglasses, and I said I’d need to look for them because I hadn’t touched them since the trip. While we were at the mall together, she commented that I nee...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 60,
            "ESH": 7,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-08T05:55:37.274761"
    },
    {
        "id": "1qy7trf",
        "title": "AITA for making fun of my friend's bitcoin investment?",
        "url": "/r/AmItheAsshole/comments/1qy7trf/aita_for_making_fun_of_my_friends_bitcoin/",
        "body_summary": "A few months ago my friend 'Boris' bought some bitcoins. And since then he's been really eager to bring up his bitcoins in conversation. He's said it's the future, tried to get everyone in the group to buy bitcoins, and even insinuated that we are missing out on massive profits if we don't buy bitcoins. Basically everyone he's said this to has said \"mate you are going to lose your money\" and he has remained persistent. He tried to gift us bitcoin for Christmas as part of a secret santa thing we were doing.\n\nHe's all around a nice guy but something about this bitcoin thing has made him go bonkers and the other day the price of bitcoin crashed and so we asked him how his bitcoins are going. He looked at the chart and was horrified and I did laugh at him and say this is why you don't buy mono...",
        "reddit_judgments": {
            "YTA": 38,
            "NTA": 27,
            "ESH": 4,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-08T05:55:45.877987"
    },
    {
        "id": "1qya6lf",
        "title": "AITA for ruining my neighbour’s party?",
        "url": "/r/AmItheAsshole/comments/1qya6lf/aita_for_ruining_my_neighbours_party/",
        "body_summary": "I (18F) am currently living in a cheap university dorm room. I share a wall with “Jessica” (fake name, 19F). Jessica is, to be as blunt as possible, very loud. She frequently blasts music from her speakers at random intervals throughout the day, invites her boyfriend over constantly and frequently gets into loud arguments with said boyfriend almost every other day. The walls in our apartment building are paper thin so noise travels VERY easily, so I have to hear just about everything. I usually just ignore her, I don’t think she’s actively trying to be annoying, I think she just doesn’t realize how   thin our walls are.\n\nThree days ago, however, Jessica decided to throw a party, she had a bunch of friends over and was blasting a bunch of music. I ignored her throughout most of the evening ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 37,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-08T05:55:53.424335"
    },
    {
        "id": "1qypdt8",
        "title": "WIBTA If I ask not to go on my birthday trip with my Half-Brother?",
        "url": "/r/AmItheAsshole/comments/1qypdt8/wibta_if_i_ask_not_to_go_on_my_birthday_trip_with/",
        "body_summary": "Context - My dad had an affair baby or something when I was about 4. The kid started to come over to my house when I was around 14. He’d stay over weekends or more if his mom went on a trip or whatever.\n\nMy Mom is very cool with the situation, which was always to my surprise. I try not to be mad on her behalf since how can I be more upset than she is. But I still always hated it for myself and both my parents know that. My mom respects it, my dad is always pushy about it. Which I find Ironic it’s like he’s trying to punish me, for a problem he created, and got away with. But regardless I keep it cordial with him we honestly just don’t interact or talk, so it’s not like he thinks I hate him or anything. Keep it peaceful\n\nAnyway for the past almost 2 years my best friend (who’ve I known sinc...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 26,
            "ESH": 3,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-08T05:56:01.323887"
    },
    {
        "id": "1qytf46",
        "title": "AITA for refusing to do all the chores alone during a family gathering?",
        "url": "/r/AmItheAsshole/comments/1qytf46/aita_for_refusing_to_do_all_the_chores_alone/",
        "body_summary": "I live in a household with extended family, and growing up I have often been expected to help more around the house because I am the youngest. I do not mind helping at all, and I have never refused to do chores when asked. On a normal day, I already help with cleaning, washing dishes, and running errands when needed. I understand that helping out is part of being in a family, and I try to contribute as much as I reasonably can.\n\nRecently, we had a family gathering at our house with several relatives present. After everyone finished eating, I was told to clean everything up by myself. This included clearing the table, washing all the dishes, and cleaning the kitchen. While I was being told to do this, the older relatives went to sit down and relax, some of them watching TV or using their ph...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 25,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-08T05:56:08.883918"
    },
    {
        "id": "1qyvvm8",
        "title": "AITA for refusing to drive my wealthy friend on a 3.5 hour round trip to the airport at 3am",
        "url": "/r/AmItheAsshole/comments/1qyvvm8/aita_for_refusing_to_drive_my_wealthy_friend_on_a/",
        "body_summary": "A long time friend of mine woke me up at 3am with a phone call asking me to get up and drive them to an airport that is an hour and forty five minutes from my house so they could make a 6am flight. I said no, went back to sleep and woke up later that morning to a text from another friend saying my friend was very angry at me for refusing.\n\nSome context to this scenario is that my friend had bought me a generous gift about a week before for my birthday when I visited them in their home state worth roughly 600 dollars which I appreciated greatly and felt slighted that I still refused their request. My issue with this is that my friend is a wealthy person who could easily afford an Uber to the airport but expected me to wake up in the middle of my sleep, get dressed and make the 3.5 hour roun...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 38,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-08T05:56:16.523227"
    },
    {
        "id": "1qyvo9x",
        "title": "AITA I planned my husbands 40th birthday and he made me cancel everything last minute",
        "url": "/r/AmItheAsshole/comments/1qyvo9x/aita_i_planned_my_husbands_40th_birthday_and_he/",
        "body_summary": "To preface my husbands bachelor party a few years back was ruined because his brother did a shitty job planning it (old rundown party bus, a school bus in fact, hot liquor, no ice, no cups and randoms that weren’t even invited to the wedding showed up) I said to myself for his 40th birthday I’m going to make it up to him. \n\nSo here we are, he’s turning 40 next week and I decided a few of weeks ago to plan something for him this weekend since for his actual birthday we will be in  Mexico for vacation already. I thought this would be a gathering for family not just the two of us. I got a limo, a bottle of his favorite bourbon engraved with a sweet message from us, an ice bucket with champagne bottles, some lite bites for the car ride and a limo to take us to a restaurant. \n\nHe is a firefight...",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 17,
            "ESH": 4,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 43
        },
        "total_judged": 43,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2026-02-08T05:56:24.360922"
    },
    {
        "id": "1qyvety",
        "title": "AITA for wanting to get my kids assessed for autism because they’re so similar to our nanny who has autism",
        "url": "/r/AmItheAsshole/comments/1qyvety/aita_for_wanting_to_get_my_kids_assessed_for/",
        "body_summary": "My husband and I have 2 kids (3f and 6m). We have a nanny, Anna. Anna picks my daughter up from preschool at 12 and stays with the kids until 6. \n\nMy kids can be difficult. My daughter only eats 4 meals. My son has the attention span of a squirrel and refused to brush his teeth until very recently. They both refused to take their dishes to the sink or carry them from the counter to the table. I’ve talked to their teachers and pediatrician about their behaviors and I am always told that they’ll grow out of it, it’s a toddler thing, it’s a boy thing, etc. but it just drives me crazy. \n\nAnna has autism and tends to see things differently than I do so I asked for her help with these issues. The first thing she told me was that every plate and bowl in our house feels weird in her hands. I got n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 42,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-08T05:56:32.913869"
    }
]