[
    {
        "id": "1pairm4",
        "title": "AITA for not helping pay for my cousin's meal?",
        "url": "/r/AmItheAsshole/comments/1pairm4/aita_for_not_helping_pay_for_my_cousins_meal/",
        "body_summary": "I (28f) went out for lunch with my mom (46), my uncle (36) and his son (11) yesterday. Uncle chose the place and insisting on everyone sharing a huge barbecue, even though my mom and I wanted to eat something else. Once the bill comes, I divide it by four and say that he should pay for himself and my cousin while my mom and I each pay for our own part. He gets angry at this and says that every adult should cover a third of the bill because my cousin obviously can't contribute. It's not the first time he's done it. My mom points out that she never made him or anyone else help pay for my meals when I was a kid but uncle insists. I agree to play extra because I don't want to make a scene at the restaurant but get angry because I'm expending a good amount of money on a food I'm not enthusiasti...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 81,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 87
        },
        "total_judged": 87,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-01T05:20:47.885541"
    },
    {
        "id": "1pasmcj",
        "title": "AITA for telling my sister she’d having nothing without her husband?",
        "url": "/r/AmItheAsshole/comments/1pasmcj/aita_for_telling_my_sister_shed_having_nothing/",
        "body_summary": "I25f have an 8 year old and a 2 year old. I work and do doordash and so does my fiancé (not doordash but he works longer hours.) We have trouble financially and aren’t in the greatest spot but we make it work. \n\nMy sister29 has 3 kids but she doesn’t work, she’s never had to work. She married a doctor, and they of course do pretty well for themselves. The one day my sister and I were talking and it came up on Christmas and I told my sister it was probably going to be a small one this year, and that she may get her family’s gifts from us a little late. She made a comment how she doesn’t understand how we do so bad with money when we’re both working and how they don’t have the struggle. She suggested to me maybe going to college or looking into a better job because a shitty job with shitty p...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 55,
            "ESH": 39,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 111
        },
        "total_judged": 111,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-01T05:21:06.240134"
    },
    {
        "id": "1paoa8v",
        "title": "AITA for not paying my brothers taxes/not feeling guilty for traveling?",
        "url": "/r/AmItheAsshole/comments/1paoa8v/aita_for_not_paying_my_brothers_taxesnot_feeling/",
        "body_summary": "I’m mid 40s, disabled vet. I spent years severely disabled* , on Norcos and muscle relaxers, walking with a cane, doing PT, basically trying to rebuild myself for the sake of my children. Nobody in my family helped with anything. No money, no childcare, no lifting heavy water jugs, nothing. They pretty much pretended I didn’t exist until I was back on my feet.\n\nNow that I’m finally off pain meds, able to walk without a cane, healthy enough to travel a little, suddenly I’m Public Enemy #1 because apparently me taking a vacation is destroying their family budget.\n\nMy brother has lived with my parents his whole life with his 2 kids and takes up three bedrooms in their 4 bed 2 bath PAID OFF house. \nTHREE BEDROOMS\nHe pays around $600 a month for taxes, and pays for groceries/utilities. A house ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 99,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 101
        },
        "total_judged": 101,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-01T05:21:22.775984"
    },
    {
        "id": "1pansl6",
        "title": "AITA for getting highly offended after my girlfriend asked whether my dad is corrupt",
        "url": "/r/AmItheAsshole/comments/1pansl6/aita_for_getting_highly_offended_after_my/",
        "body_summary": "We're college students, in a relationship since 2 years. Our holidays started last week, it will be till Jan first week. We planned that she will stay at my home for 1 week, as my house is nearer and she has never visited.\n\nMy dad is a Retired District Judge (she knows). Generally, Judges don't have a good reputation here, but as far as I know and love my dad, he's an awesome man. It was a decent paying job + he inherited some wealth from grandpa, hence my parents have built a nice home (above average).\n\nShe was fascinated by the exteriors, and the first thing she said to me was \"Looks like your dad has earned a lot above his paygrade\" basically she said that my dad took a lot of bribes. She said it lightly, but I felt highly offended and I clearly stated told her that.\n\nInstead of apologi...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 79,
            "ESH": 3,
            "NAH": 7,
            "INFO": 3,
            "TotalJudged": 103
        },
        "total_judged": 103,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-01T05:21:39.106534"
    },
    {
        "id": "1patfuo",
        "title": "AITA I said no to a lady who asked me to put something back for her at the grocery store and she called me a jerk",
        "url": "/r/AmItheAsshole/comments/1patfuo/aita_i_said_no_to_a_lady_who_asked_me_to_put/",
        "body_summary": "Today I was at the grocery store looking for a specific kind of juice, and while I was browsing a lady wearing a mask and a hat walked up to me and asked me to put some orange juice back for her. \n\nI looked at where the orange was, and it down at the end of the aisle in the middle of the shelf, completely within her reach. If it was too high for her I would have done it, but she was clearly capable and it seemed like an unnecessary request. \n\nI said, “no, you can put it back” and she replied “oh I just thought maybe you could do something nice.” and as she was walking away she looked back and called me a jerk. Because she was wearing a mask I couldn’t tell how old she was initially, but her voice sounded like an older person. \n\nBy being in public did I owe her this favor? It seemed like an...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 31,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-01T05:21:54.967316"
    },
    {
        "id": "1pakuoi",
        "title": "AITA for refusing to give up the cat I wanted to adopt?",
        "url": "/r/AmItheAsshole/comments/1pakuoi/aita_for_refusing_to_give_up_the_cat_i_wanted_to/",
        "body_summary": "It’s going to be a pretty straightforward post, but I seriously need a second opinion, because right now I am so mad I’m second guessing myself.\nI (f20, if that matters), a month ago saw an adoption post for two kittens found on the street. I always wanted a cat, and always wanted to adopt - I firmly believe that it’s a better idea than buying an animal from breeders. Now I finally have the financial means to support an animal, a stable situation regarding living conditions, and support from my family (who I still live with, since I am currently studying in university). Back to the post - I saw it while we were away in our home country due to family reasons, and wrote the woman with the kittens, that I really like one of the girls. She is very calm and tactile by the woman’s words, and has...",
        "reddit_judgments": {
            "YTA": 80,
            "NTA": 35,
            "ESH": 6,
            "NAH": 15,
            "INFO": 2,
            "TotalJudged": 138
        },
        "total_judged": 138,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-01T05:22:12.765980"
    },
    {
        "id": "1pagtik",
        "title": "AITA for telling neighbors to not dump yard waste on my land",
        "url": "/r/AmItheAsshole/comments/1pagtik/aita_for_telling_neighbors_to_not_dump_yard_waste/",
        "body_summary": "My wife and I built a house on her grandmas  land with about 3.5 acres(in our name now) of a larger 22 acre plot. It’s mostly field that a farmer uses for hay but we plan to take it over once we get a tractor. On one side we have a street of neighbors with about 5 houses that border our land. Most people have been respectful about not encroaching on our property but some have gotten used to no one being there and have been taking advantage of no one really watching for years. Primarily have been dumping yard waste like grass clippings/tree branches and piles of leaves. Our land is surveyed and pins are visible. \n\nYesterday I happened to look out back when I was eating lunch and notice 3 people with a large tarp walking on our land into the corner of the back part of our property that I’ve ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 32,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-01T05:22:28.506070"
    },
    {
        "id": "1pajvvs",
        "title": "AITA for asking my friend to reschedule her surprise visit because I was already busy?",
        "url": "/r/AmItheAsshole/comments/1pajvvs/aita_for_asking_my_friend_to_reschedule_her/",
        "body_summary": "So this happened last weekend. My name  Nicole (26F) have a close friend Lauren (27F). We get along well, but she’s always been a bit… spontaneous. Like she loves doing grand gestures and last-minute plans, while I’m more of a please text me before showing up type of person. On Saturday, I had already planned a quiet day at home to catch up on cleaning and some work stuff I’d been putting off. Around noon, I get a text from Lena saying, “I’m five minutes away! I brought food. Surprise!!” I honestly thought she was joking at first. She wasn’t. At that exact moment, I was in the middle of reorganizing my whole apartment everything was everywhere, laundry on the couch, cleaning supplies out, laptop open with deadlines. I wasn’t in a place to host anyone, let alone someone planning to hang out...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 42,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-01T05:22:44.133052"
    },
    {
        "id": "1paq48y",
        "title": "AITA for telling my mom that I don't want her to see the appartment I will buy",
        "url": "/r/AmItheAsshole/comments/1paq48y/aita_for_telling_my_mom_that_i_dont_want_her_to/",
        "body_summary": "I'm 30 years old. Currently I live with my mom and dad at our family house. My dad is a cool and easy-going guy, however my mom is something different. My mother is a person who is very imperious and usualy demands the things to be done her way without asking for anyone's permission. She is extremely pessimistic person who is looking for problems literally everywhere.  While she is a caring and loving person, she's also toxic to the point where after years and years of fights over the smallest things in our house between her and my father/me, my father and I developed some sort of passive aggressive stance towards her where we subconsciously began dismissing her various shenanigans which usualy made her upset, with her claiming that we're traying to sideline her and make her look like an i...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 30,
            "ESH": 1,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 35
        },
        "total_judged": 35,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-01T05:22:59.689903"
    },
    {
        "id": "1paij14",
        "title": "AITA for asking my girlfriend to participte more in cooking",
        "url": "/r/AmItheAsshole/comments/1paij14/aita_for_asking_my_girlfriend_to_participte_more/",
        "body_summary": "I've lived with my girlfriend for 2-3 years. When we started dating I used to live at her place because I lived in different country and I came to her place for periods of 1-3months at a time. \n\nWhen we started dating she had a really busy internship period while I was working remotely on so naturally I took care of the food side. I made sure we/she always had food ready when she comes home. I went did the groceries paid everything on my own. \n\nThen after graduation she started apllying for full time jobs and this period took over a year. Again I did 95% of the cooking so she can focus on applying in peace. Sometimes she helped me cut some veggies. She barely cooked once a month and if she did it was by her own schedule, meaning it was always the last thing in her schedule. Sometimes I was...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 21,
            "ESH": 13,
            "NAH": 4,
            "INFO": 3,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-01T05:23:16.009099"
    }
]