[
    {
        "id": "1p0i6lk",
        "title": "AITA. I (32 f) complimented a female nurse during OBGYN appt for having nice arm muscles and she snapped at me.",
        "url": "/r/AmItheAsshole/comments/1p0i6lk/aita_i_32_f_complimented_a_female_nurse_during/",
        "body_summary": "AITA. I (32 f) complimented a female nurse during OBGYN appt for having nice arm muscles. She was very bothered by my comment for some reason which I am trying to wrap my head around. She went on and on saying that most people working on themselves at the gym have serious mental health issues and are working out to channel through it and not to “look nice.” I apologized and told her I meant no harm and that I simply admired her for looking strong. She kept getting more angry and I just stopped responding. I left the office feeling really confused. Any input would be greatly appreciated from this awkward human who was just trying to socialize. (I’d like to add that she was wearing the type of scrubs with cap sleeves that specifically show off your upper arms.) ",
        "reddit_judgments": {
            "YTA": 28,
            "NTA": 91,
            "ESH": 24,
            "NAH": 9,
            "INFO": 2,
            "TotalJudged": 154
        },
        "total_judged": 154,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-19T05:11:58.057445"
    },
    {
        "id": "1p0odag",
        "title": "AITA Wife is mad because I answered the phone incorrectly.",
        "url": "/r/AmItheAsshole/comments/1p0odag/aita_wife_is_mad_because_i_answered_the_phone/",
        "body_summary": "My wife and I have been dating since 2018, married 2023. This morning, after leaving the house she calls me and I answer the phone “yeah” (with no attitude). Instead of telling me what she called for, she starts ranting about how rude to answer the phone like that. From there we start arguing about the validity of that statement. She says that to her, it feels like I don’t want to talk to her. I’m obviously going to do my best to answer the phone like a “normal person” but I would like your opinion to know if I am indeed the A**hole or not and some insight to help see it from her view. ",
        "reddit_judgments": {
            "YTA": 76,
            "NTA": 34,
            "ESH": 5,
            "NAH": 14,
            "INFO": 3,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-19T05:12:03.222746"
    },
    {
        "id": "1p0a88m",
        "title": "AITA for not babysitting my 2 siblings during my mom honeymoon",
        "url": "/r/AmItheAsshole/comments/1p0a88m/aita_for_not_babysitting_my_2_siblings_during_my/",
        "body_summary": "Edit: I am completly grateful with all the advice people are giving me, and the support they are showing. If you are reading this and left a comment, or if you are simply reading, Thank you! It's heartwarming seeing all the comments, I never thought my situation would bring this much support!\n\n\nOkay, I don’t think I am the asshole but everyone is telling me I am so i need extra points of view here.\n\nI am 17 and i just started university. My mom married ”Marcus” one month ago and she is going on her honeymoon this month. The duration is 4 days. I am the older sister, i have 2 siblings one with 12y and other with 4. And my mother told me I would have to babysit them while she and her husband are in their honeymoon.\n\nI’ve always babysat them in the afternoon since both my mom and Marcus work....",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 149,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 151
        },
        "total_judged": 151,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-19T05:12:21.794855"
    },
    {
        "id": "1p0e6x3",
        "title": "WIBTA if I told my neighbor I don’t want their kids on my property?",
        "url": "/r/AmItheAsshole/comments/1p0e6x3/wibta_if_i_told_my_neighbor_i_dont_want_their/",
        "body_summary": "I’m 33F, so I’m wondering if I’m just an old man yelling at clouds at this point. This is a long one due to my adding context, so TLDR at the end.\n\nWhere I live, I have a busy road in front of my house, and a big oval alley behind with a few houses. In the alley directly behind my house is my neighbor, Jack. Jack is in 60s and his adult son, Art, daughter in law and their kids have moved into Jack’s house. \n\nArt has 5 children: 2 boys, 3 girls all in different ages, but definitely ranging from 5 to 13. I think only the 2 boys are Art’s biological children, and I mention this because the kids in question are only the girls. I’ve never seen Art redirect or discipline the girls. Unlike the boys, who Art usually steps in to parent and is more hands on. I’m not sure though.\n\nI don’t know the wi...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 95,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 97
        },
        "total_judged": 97,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-19T05:12:38.663547"
    },
    {
        "id": "1p0ostb",
        "title": "AITA for not wanting to buy a friend’s parents’ home?",
        "url": "/r/AmItheAsshole/comments/1p0ostb/aita_for_not_wanting_to_buy_a_friends_parents_home/",
        "body_summary": "Me and my spouse are in our early 30s and currently house-hunting new builds. A friend (Nat) heard about this and messaged us saying it’s perfect that we’re in the market because their parents are moving to their homeland and are looking for buyers. I politely declined and said we’ve got our eyes set on new builds. Nat, then, got defensive, stated that his parents’ 2-story home is beautiful and continued to list all the pros individually. All of which are true. I responded and said (1) we want to be the first home owners 🤷🏻‍♀️ , (2) we only want to remodel/make changes once (in our late 50s, right before retirement age), (3) we specifically wanted a single story home because this will be a forever home and don’t want stairs in our old age, (4) new builds we’re looking at and his parents’ h...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 143,
            "ESH": 1,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 147
        },
        "total_judged": 147,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-19T05:12:55.151237"
    },
    {
        "id": "1p0s5vu",
        "title": "AITA I (23F) am choosing to go to a dinner with bf (23M) for one of the 3 nights my family is in town",
        "url": "/r/AmItheAsshole/comments/1p0s5vu/aita_i_23f_am_choosing_to_go_to_a_dinner_with_bf/",
        "body_summary": "My family, including my grandma who I don’t get to see often, is coming for my (23f) graduation. However my bf (23m) is graduating a day after me so I will be attending his graduation in the morning. My dad (66M) says I am the asshole for planning on going to dinner with bf and his whole family one of the nights my family is in town. The dinner is late at night so I promised I would eat lunch and spend the whole afternoon with family. I will also be spending the rest of my family’s time in my city with them too. Am I being unreasonable? I have been with my bf for over 6 years (dad hates him though) and we have a serious relationship. I will see family for two and a half full days at least but my dad says I am being rude ",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 22,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-19T05:12:55.422608"
    },
    {
        "id": "1p0sc5n",
        "title": "AITA for not giving a pizza away.",
        "url": "/r/AmItheAsshole/comments/1p0sc5n/aita_for_not_giving_a_pizza_away/",
        "body_summary": "Small background here, I own a small specialized welding shop most of the time it’s just me working but the 3-4 days a week I have a sub contractor that comes in. Today a guy comes in that’s a cook at a local restaurant that has really good pizza. Wants small piece welded and a couple holes drilled half hour or so of work. I said no problem and he asked how much so I said bring us pizza for lunch and that will be good. So I do the job and the guy brings two pizzas and a bottle of pop for lunch. So the sub contractor and I enjoy pizza for lunch but we had a whole pizza left over. At the end of the day we’re heading home he says to me “I’m taking that other pizza home for the wife and I”, I said no that’s my pizza. He kinda laughs and grabs the pizza box. I said I was serious. He gets mad ca...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 32,
            "ESH": 5,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-19T05:13:11.012233"
    },
    {
        "id": "1p0g7jh",
        "title": "AITA for asking my manager not to hire my former friend?",
        "url": "/r/AmItheAsshole/comments/1p0g7jh/aita_for_asking_my_manager_not_to_hire_my_former/",
        "body_summary": "I (18F) am in my last year of high school. I go to a school for gifted students where, as long as we keep our grades up and complete all tests, no one really cares about attendance.\n\n\n\nI barely go. I study better alone, and I pick up concepts quickly. Since I turned the legal working age in my country (15), I’ve been working nonstop. I love working, especially typical “teen” jobs like retail, waitressing, etc.\n\n\n\nRight now, I have three jobs: waitress at a bar, barista at a bakery, and receptionist at a kids’ club.\n\n\n\nA year ago, I helped my friend get a summer job where I was working at the time. She wanted something to do, and the store needed summer workers. But she’s always been lazy. She promised me she would work hard because my name was attached to her hiring.\n\n\n\nShe didn’t. She sat...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 20,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 21
        },
        "total_judged": 21,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-19T05:13:26.508433"
    },
    {
        "id": "1p0wa54",
        "title": "AITA because I didn’t take a co worker to the airport?",
        "url": "/r/AmItheAsshole/comments/1p0wa54/aita_because_i_didnt_take_a_co_worker_to_the/",
        "body_summary": "Just started a new job working 3 weeks on and 3 weeks off.  This is my first time working for 3 weeks straight.  I live around 2 hours from the job while my co workers could be anywhere in the US so most of them fly in.  About a week and a half a guy I never met comes joins the crew.  He was a chain smoker.  At the end of the 3 weeks I was asked i could drop him off at the airport because he knew i drove to the location.  I told him no I couldn’t and walked to my car and left.  The reasons why I didn’t want to was because he smelted like cigarettes and cigars and I didn’t want my car to smell\nLike that and also I don’t want to be known as the guy who takes people to the airport before I leave.  Now I heard that people know i didn’t drop him off and he doesn’t like me.  I feel that I had th...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 33,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-19T05:13:42.016796"
    },
    {
        "id": "1p045di",
        "title": "AITA telling SIL she is a bad sister",
        "url": "/r/AmItheAsshole/comments/1p045di/aita_telling_sil_she_is_a_bad_sister/",
        "body_summary": "This was a month ago and things have calmed down, and we still talk occasionally but it's awkward.\n\nMy brother and SIL went on a trip recently, and he got a specific souvenir snack for me. They knew it was for me, it was in a group chat. They came back and I found out SIL ate half of it, and gave the rest away. It's not expensive (like $3 ea), but it was the one thing I looked forward from my brother... My brother packed it for me, not realizing she had opened and cleared it while leaving the empty bag where it was. He almost gave me a bag of empty snack boxes.\n\nI told SIL that I hate her selfish personality and her siblings probably feel the same way. Little did I know, her younger siblings did stop contacting her after a similar confrontation. She didn't take this too well and I was sorr...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 16,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-19T05:13:57.479215"
    }
]