[
    {
        "id": "1n48kf2",
        "title": "AITA for ruining to my cousins wedding?",
        "url": "/r/AmItheAsshole/comments/1n48kf2/aita_for_ruining_to_my_cousins_wedding/",
        "body_summary": "OP's ex's wife confronted her at a wedding, accusing her of jealousy and ruining their graduation. OP left to avoid a scene, but the bride (OP's cousin) blamed OP for starting the fight. OP denies fault, citing the ex's wife's instigation. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 83,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 86
        },
        "total_judged": 86,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-31T05:10:03.102168"
    },
    {
        "id": "1n3x2a8",
        "title": "AITA for hiding food from my roommate?",
        "url": "/r/AmItheAsshole/comments/1n3x2a8/aita_for_hiding_food_from_my_roommate/",
        "body_summary": "i (19F) lived with another girl in college. she consistently would eat my food and when i caught her said she would “replace it”, but never did. i finally got a mini fridge for my room and started labelling what i left in the kitchen.\n\nshe was calling me “petty” and told our friends i made the apartment “hostile” (really don’t know how it was my fault). i just don’t think i should be feeding the both of us. AITH for locking up my food? ",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 68,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 69
        },
        "total_judged": 69,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-31T05:10:03.897779"
    },
    {
        "id": "1n3zeom",
        "title": "AITA for insulting my dad after he ignored my mum's pleas?",
        "url": "/r/AmItheAsshole/comments/1n3zeom/aita_for_insulting_my_dad_after_he_ignored_my/",
        "body_summary": "OP's dad ignored their mom's knee pain while walking, prompting OP to call him a \"dickhead.\" He then gave OP the silent treatment, refused her lunch, insulted her, & threatened to leave the vacation early, leaving them without a ride. OP asks if they were the asshole for their outburst, and if they ruined the vacation.\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 62,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 67
        },
        "total_judged": 67,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-31T05:10:05.397921"
    },
    {
        "id": "1n4axeh",
        "title": "AITA for refusing to split the check with my brother on Mother's Day?",
        "url": "/r/AmItheAsshole/comments/1n4axeh/aita_for_refusing_to_split_the_check_with_my/",
        "body_summary": "OP took their mom to dinner for Mother's Day, paying $54. Later, at a family dinner, the younger brother asked OP how to split the bill. OP reminded him about the prior dinner. Brother paid. OP asks if refusing to pay the second bill, after not being told about splitting beforehand, makes them TA.\n...",
        "reddit_judgments": {
            "YTA": 85,
            "NTA": 12,
            "ESH": 7,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 106
        },
        "total_judged": 106,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-31T05:10:07.709834"
    },
    {
        "id": "1n4g6al",
        "title": "AITA for hiding my ALS diagnosis from my grandpa?",
        "url": "/r/AmItheAsshole/comments/1n4g6al/aita_for_hiding_my_als_diagnosis_from_my_grandpa/",
        "body_summary": "OP (25M) hid his ALS diagnosis from his grandpa, who raised him, to protect him from worry. At a family dinner, a cousin revealed the diagnosis, triggering grandpa's heart condition and hospitalization. OP's cousin blames OP for lying, while OP feels validated in his decision to hide it. AITA?\n...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 12,
            "ESH": 4,
            "NAH": 3,
            "INFO": 3,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-31T05:10:09.112197"
    },
    {
        "id": "1n3w7fs",
        "title": "WIBTA if I told my friend that just because someone’s my friend doesn’t make them her friends?",
        "url": "/r/AmItheAsshole/comments/1n3w7fs/wibta_if_i_told_my_friend_that_just_because/",
        "body_summary": "OP's friend is upset about not being invited to OP's friends' gatherings. She pressured OP to bring her, messaged the host, and left negative comments when not invited. OP asks: WIBTA if I bluntly told her my friends don't have to be her friends too?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 24,
            "ESH": 0,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-31T05:10:11.162485"
    },
    {
        "id": "1n4c4bi",
        "title": "AITA for calling out my dead sister’s baby daddy’s new gf for being disrespectful",
        "url": "/r/AmItheAsshole/comments/1n4c4bi/aita_for_calling_out_my_dead_sisters_baby_daddys/",
        "body_summary": "OP's sister died, leaving young kids. Sister's boyfriend's girlfriend posted \"momma\" online, upsetting OP. OP asked boyfriend to stop her posts, but they continued. OP posted about being respectful, leading to a fight. Girlfriend said \"it's not my fault she died,\" causing OP to lash out. Now the boyfriend is banning OP's family from seeing the kids. AITA?\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 31,
            "ESH": 5,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-31T05:10:13.117861"
    },
    {
        "id": "1n48bqo",
        "title": "WIBTA if I don’t go with my husband and daughter to his sister’s wedding?",
        "url": "/r/AmItheAsshole/comments/1n48bqo/wibta_if_i_dont_go_with_my_husband_and_daughter/",
        "body_summary": "OP (39F) is unsure about attending her husband's sister's wedding due to his family's negative opinions of her. Her husband vents to his sisters, and they judge her, including calling her unattractive and suspecting infidelity due to her male friends. OP doesn't want to be around them. AITA if she skips the wedding, even though her stepdaughter is a bridesmaid?\n...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 71,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 86
        },
        "total_judged": 86,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-31T05:10:15.954576"
    },
    {
        "id": "1n4d4eg",
        "title": "AITA for apologising for a Dad Fight at my kids birthday party?",
        "url": "/r/AmItheAsshole/comments/1n4d4eg/aita_for_apologising_for_a_dad_fight_at_my_kids/",
        "body_summary": "OP wants to apologize to his GF's dad after being yelled at for trying to be in a family photo and his reaction to being excluded made OP cry. GF doesn't want OP to apologize. AITA if OP apologizes anyway?\n...",
        "reddit_judgments": {
            "YTA": 122,
            "NTA": 2,
            "ESH": 8,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 133
        },
        "total_judged": 133,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-31T05:10:18.846978"
    },
    {
        "id": "1n4kurl",
        "title": "AITA for asking my girlfriend to tell me what flavour of smoothie she wanted?",
        "url": "/r/AmItheAsshole/comments/1n4kurl/aita_for_asking_my_girlfriend_to_tell_me_what/",
        "body_summary": "OP (24M) bought his pregnant GF (23F) her usual smoothie as a surprise. She didn't want it and couldn't specify what she wanted instead. OP repeatedly asked for a flavour, frustrating her. She cried, accusing him of pressuring her. AITA for asking her to choose a flavour?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 25,
            "ESH": 1,
            "NAH": 7,
            "INFO": 1,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-31T05:10:20.162829"
    }
]