[
    {
        "id": "1p8oqie",
        "title": "AITA? I May Have Ruined Thanksgiving with Jackbox",
        "url": "/r/AmItheAsshole/comments/1p8oqie/aita_i_may_have_ruined_thanksgiving_with_jackbox/",
        "body_summary": "For context, ever since I was 8 years old my older brother, ___________, would go out of his way to call me gay. These \"jokes\" were constant and I'd ask him to stop but his insults persisted until this very day, where I'm now 26 years old. I've asked him many times throughout my life to stop, and I'd only be met with an answer like \"Why bro? Is it cause you're secretly gay?\"\n\nMy brother, along with a few of my siblings, and myself all came to visit my parents today for Thanksgiving. I brought my amazing girlfriend over and this was her first time meeting my older brother. The first thing he does is pat me on the back and say \"I'm proud of you, bro. You've finally proved to me you're not gay.\"\n\nI booted up the ol' Nintendo Switch and our family played Jackbox, specifically Quiplash 2. Every...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 80,
            "ESH": 2,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 85
        },
        "total_judged": 85,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-29T05:11:28.503141"
    },
    {
        "id": "1p8mpaw",
        "title": "AITA for my irish goodbye at thanksgiving?",
        "url": "/r/AmItheAsshole/comments/1p8mpaw/aita_for_my_irish_goodbye_at_thanksgiving/",
        "body_summary": "Me (19)f and my bf (24)m drove up 3 hours to visit my family for Thanksgiving, he lives across the US and unfortunately couldn’t see his family for the holidays. I was excited to introduce him to everyone but no one seemed interested in talking to him and totally left him out all the festivities. It left me and him feeling a little disrespected. I mean nothing beyond giving him a handshake and asking for his name, and obviously ignoring him when he tried to talk, and even trying to sit him with the kids! \n\nOn top of inappropriate comments about me and my sisters weight from family my grandmas new husband asked us to come out and help string up christmas lights, they asked some of the boys to come out and help and I joined them because I didn’t want to leave my boyfriend alone. \n\nAfter we w...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 46,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-29T05:11:44.548262"
    },
    {
        "id": "1p93gan",
        "title": "AITA if I stop bailing her out and demand she financially steps up?",
        "url": "/r/AmItheAsshole/comments/1p93gan/aita_if_i_stop_bailing_her_out_and_demand_she/",
        "body_summary": "AITA for refusing to keep bailing out my wife and pushing her to file for child support?\nI (28M) am married to L (29F). We have 3 kids in the home: my 3 & 1-year-olds and my 10-year-old stepdaughter. We got married after our first child.  I love my stepdaughter and treat her as mine, but her bio dad does almost nothing. I’ve pushed my wife to file for child support; she refuses because she’s afraid of 50/50 custody and doesn’t want her daughter influenced by him. I think he should still be forced to contribute.\nFrom the start I was clear: I wanted a 50/50 partnership. Right now I’m basically carrying us. I take home about $2.8k/month after benefits/401k on a rotating shift schedule and work overtime/side jobs to keep up. My wife works 8–5 as a long-term sub, around $21/hr, and brings home ...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 36,
            "ESH": 20,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-29T05:12:01.686051"
    },
    {
        "id": "1p99aux",
        "title": "AITA for wanting to take our cat with me after my marriage?",
        "url": "/r/AmItheAsshole/comments/1p99aux/aita_for_wanting_to_take_our_cat_with_me_after_my/",
        "body_summary": "Hi, this issue has lead to fights in my house the past week, and at this point I thought I'll ask here.\n\nI'm going to get married in a few months, and currently live with my parents. 6 years ago my aunt had gifted me my cat for my 18th when he was a kitten. She knew I loved cats, I'd always wanted one so that was her gift and it was the best gift I've ever received. I was the one who organized his diet, litter trained him, named him Casper, got him to respond to his name, had him snuggle with me, had huge arguments with my parents in the initial days over him and defended him. Over time Casper became an integral part of our family.\n\nLast week we were just planning on how to start moving my stuff to my fiance's place and I also brought up his cat tree. My younger sister was like why would y...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 92,
            "ESH": 0,
            "NAH": 4,
            "INFO": 6,
            "TotalJudged": 107
        },
        "total_judged": 107,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-29T05:12:18.400776"
    },
    {
        "id": "1p8qvhe",
        "title": "AITA for not letting a classmate nap in my dorm room during our break?",
        "url": "/r/AmItheAsshole/comments/1p8qvhe/aita_for_not_letting_a_classmate_nap_in_my_dorm/",
        "body_summary": "I have one short break between back to back classes on certain days. I use that time to return to my dorm, rest for a bit, change clothes, or finish small tasks. It is the only hour I get to reset before the next long lecture.\n\nA classmate who is not close to me overheard me saying I was going to my dorm to nap. She followed me out of the building and said she wanted to nap too since her boarding house was far. I told her I could not bring guests to my room, and I was not comfortable letting someone I barely knew stay in my personal space.\n\nShe said she would just lie down for a short time and would not bother anything. I still said no since we have dorm rules and I share the room with someone else. She got frustrated and said I was being too strict.\n\nThe next week, she tried again. This t...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 31,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-29T05:12:34.139886"
    },
    {
        "id": "1p92ai3",
        "title": "AITA for spending Thanksgiving night with my mom instead of my husband?",
        "url": "/r/AmItheAsshole/comments/1p92ai3/aita_for_spending_thanksgiving_night_with_my_mom/",
        "body_summary": "My dad passed away in August and this was our first holiday without him. I’m an only child and my mom and I are very close. My husband and I live about an hour away from her. \n\nI spent the night with my mom on Wednesday to help her cook. Thursday, my husband drove down with our son and his two older kids from a previous relationship. They stayed 3ish hours and said they were bored and wanted to go home. They were invited to spend the night either with my mom or with my aunt who lives 10 mins away and has a basement apartment. He declined, took the two older kids, and left. \n\nSo I spent the night with our 3 yr old at my mom’s house. We are still grieving my dad. \n\nFriday, he calls upset that I didn’t come home the night before. I told him I was there to support my mom and they could’ve stay...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 48,
            "ESH": 0,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 58
        },
        "total_judged": 58,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-29T05:12:50.213773"
    },
    {
        "id": "1p8sr1g",
        "title": "AITA for refusing to pose for a photography project that labeled me as a struggling student?",
        "url": "/r/AmItheAsshole/comments/1p8sr1g/aita_for_refusing_to_pose_for_a_photography/",
        "body_summary": "A photography major asked if I could help with her project. I thought she needed a simple portrait. When we met, she explained that her concept was focusing on the theme of a student under hardship.  She said I looked like someone who fit the idea because I looked tired lately from school. It caught me off guard.\n\nI told her I was not comfortable being portrayed like that. She said she needed someone who looked authentic. She tried to convince me by saying the role was perfect and I should embrace it for the sake of the project.\n\nI felt uneasy and said no again. She looked irritated and left. Later she told people I was too sensitive and that I did not understand artistic concepts. Some classmates asked why I did not just help since it was only a picture, but I do not think someone should ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 32,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-29T05:13:05.908496"
    },
    {
        "id": "1p9buqt",
        "title": "AITA for getting upset that my parents laughed at my friend’s religion?",
        "url": "/r/AmItheAsshole/comments/1p9buqt/aita_for_getting_upset_that_my_parents_laughed_at/",
        "body_summary": "So idk if I’m just losing it or what but this happened at dinner like an hour ago and it’s still bugging the hell out of me.\n\nWe were eating (me, my mom, stepdad, and sister) and I was talking about planning my birthday thing. One of my friends coming is following a lacto-ovo vegetarian diet so we were talking about food stuff. My stepdad goes, “Oh, is she Jewish?” and I said \"no, she’s pagan\"\n\n(Keep in mind that I was wrong about her religion. Pagan is a blanket term for a non Christian religion. My friend follows Hellenic polytheism/Hellenism)\n\nAnd dude… they both just straight up LAUGHED. Like full on laughing at that. I kinda paused like ??? and I said “why is that funny?” and immediately they did the whole “oh my god calm down” thing like I’m making a big deal out of nothing.\n\nIt hone...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 35,
            "ESH": 2,
            "NAH": 7,
            "INFO": 1,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-29T05:13:22.557126"
    },
    {
        "id": "1p90iri",
        "title": "AITA for telling my roommate he can't cook his \"experimental smells\" in our shared apartment?",
        "url": "/r/AmItheAsshole/comments/1p90iri/aita_for_telling_my_roommate_he_cant_cook_his/",
        "body_summary": "I am living with a flatmate who loves trying out very exotic recipes, but they all come with the most pungent smells possible: fermented fish, durian, the whole nine yards. I have asked him, politely, to do it outside at least or ventilate, but he insists that he \"has the right to cook whatever he wants in his own space.\nIt has gotten to the point where, last week, the smell filled my entire apartment and I had guests over who complained. So I finally lost it and told him he cannot cook anything that smells this strong here. He's now claiming I'm controlling and unsupportive.\nAITA ?",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 39,
            "ESH": 12,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-29T05:13:24.137895"
    },
    {
        "id": "1p9ba71",
        "title": "AITA for telling my dad my room is moldy",
        "url": "/r/AmItheAsshole/comments/1p9ba71/aita_for_telling_my_dad_my_room_is_moldy/",
        "body_summary": "I (16) just got transferred to my moms house from my dads house. To my shock and surprise, the cubby my bed is in inside my room is COVERED IN MOOOOLD! My mom found out I texted my dad about it and she’s freaking out saying it wasn’t his business now my dad is mad at her and mom is mad at me and all my friends hate both my parents (dad is a whole nother story) and even my ex is on my side so that’s how you know it’s bad. Am I the asshole for telling my dad what my mom says “isn’t his business”?\n\nUpdate: turns out the water heater was leaking and that’s why my room was moldy cause the basement is flooded",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 28,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-29T05:13:24.674838"
    }
]