[
    {
        "id": "1qhvfh8",
        "title": "WIBTA for not leaving the house for one weekend as requested?",
        "url": "/r/AmItheAsshole/comments/1qhvfh8/wibta_for_not_leaving_the_house_for_one_weekend/",
        "body_summary": "Hello\n\nI need an outsiders perspective on this. I try to be understanding, but I am fuming. I think someone who is not living in this apartment would have a more neutral view on this.\n\n\nThe situation: We live in a 3 bedroom apartment with 3 parties. We are all students and pay equal amounts of rent. I am Winston, and the other two are Josh and Sara. Josh spends half his week and most weekends and his girlfriends place. He mostly out of the picture. That just leaves Sara and myself.\n\nFor me I see this is a living arrangement, because it is. I am friendly with everyone but I keep some distance. I usually spend my days in the library, lectures or at home gaming. Door usually open unless I play with friends or have my gf over. \n\n\nSo yesterday Sara approached me with a request. But it felt more...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 103,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 107
        },
        "total_judged": 107,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-21T05:21:59.706635"
    },
    {
        "id": "1qietg1",
        "title": "AITAH for storing food that was mis-delivered to me?",
        "url": "/r/AmItheAsshole/comments/1qietg1/aitah_for_storing_food_that_was_misdelivered_to_me/",
        "body_summary": "I just moved into a new place and food was mis-delivered to my address. There were perishables, so I decided to store it in my fridge and freezer until the owner (would hopefully) showed up. I didn’t want food to go to waste since I didn’t know if they’d show up today or next week, or at all. I kept everything in the original delivery bags with the original tags. Initially, I assumed the old renters of my unit just forgot to change their delivery address. I had no way of knowing if they were still local or somewhere in another state or even another country.\n\nEither way, I felt it best to not risk wasting food so I’d hold onto it for a reasonable amount of time until figuring out what to do with it.\n\nWell, fortunately a few hours later, someone knocks on my door. I open up, and the lady sho...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 115,
            "ESH": 1,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 122
        },
        "total_judged": 122,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-21T05:22:16.187457"
    },
    {
        "id": "1qi0yxr",
        "title": "AITA for having the same anniversary month as my mom?",
        "url": "/r/AmItheAsshole/comments/1qi0yxr/aita_for_having_the_same_anniversary_month_as_my/",
        "body_summary": "I (38F) am planning to marry my fiancé soon, we have already selected a venue and are doing all the preparation things. I told my mother (55f) that we called the venue and all that and her immediate reaction was to say that the month of June is OUT for her because that is the month she got married. Her anniversary is June 29th mine would be June 13th. This has blown up into an entire argument for us, but my Fiancé is really insistent on June. AITA?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 139,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 140
        },
        "total_judged": 140,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-21T05:22:18.461928"
    },
    {
        "id": "1qihnr7",
        "title": "AITA for refusing to buy food for the mother of my kids' entire household.",
        "url": "/r/AmItheAsshole/comments/1qihnr7/aita_for_refusing_to_buy_food_for_the_mother_of/",
        "body_summary": "I have two kids with my ex. She has four kids in total, two that are mine and two older ones from a previous relationship. We’re not together anymore and co-parenting has been difficult for a while.\n\nAll this week through texts she has brought up food. Not just food for the kids we share, but food for herself and her other two kids as well. This isn’t the first time this has come up but, I told her I obviously take care of our two kids when they’re with me (meals, snacks, whatever they need) and that I’m not really comfortable being expected to cover food for her and her other kids too. I wasn’t trying to be rude, but I was blunt about it. (I set a boundary, personal and otherwise to avoid emotional responses and to try and avoid back and forth texting, as it often gets toxic and just gene...",
        "reddit_judgments": {
            "YTA": 48,
            "NTA": 14,
            "ESH": 3,
            "NAH": 0,
            "INFO": 12,
            "TotalJudged": 77
        },
        "total_judged": 77,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-21T05:22:35.653242"
    },
    {
        "id": "1qi170b",
        "title": "AITA Stopped a scammer from scamming my mom",
        "url": "/r/AmItheAsshole/comments/1qi170b/aita_stopped_a_scammer_from_scamming_my_mom/",
        "body_summary": "AITA? So my mom (58F) has been talking to a guy for a year. Apparently he’s from overseas and has every plan and idea to meet her but they haven’t met or even called properly during that time. It happened shortly after my parents divorced, my dad had cheated on my mom & of course this really badly impacted my mom. \n\nShe told me his name and profile picture and I (22F) searched him up on Facebook and there are hundreds of accounts with the same name and profile picture - major red flag. I told my mom about it and she said “well he’s real” and refuses to believe anything but. I’m kind of alone in this because she has pushed her friends away when they’ve said the same thing as I did, that this should be a cause for concern, so she talks shit about them to me and I’m like, “well mom, they’re l...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 56,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 57
        },
        "total_judged": 57,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-21T05:22:51.466885"
    },
    {
        "id": "1qig4dj",
        "title": "AITA for counting my calories because I do a martial art?",
        "url": "/r/AmItheAsshole/comments/1qig4dj/aita_for_counting_my_calories_because_i_do_a/",
        "body_summary": "I (27F) have been training in Muay Thai kickboxing for close to 7 years now. I started training for amateur fights a couple years ago. Most of the time, I train in moderation and don't restrict what I eat in any way. But for the 2 months leading up to a fight, I get very strict about my nutrition and fitness. I cut out alcohol and caffeine, and just generally stick to nutrient dense foods. I'm okay with doing this because I don't plan to do that many fights in my lifetime--I never plan to go pro, and I just wanted to do a few amateur fights to challenge myself.\n\nThe problem recently has been that a newer woman in my friend group, A, started commenting on my eating habits. She's dating someone in the friend group and has only started hanging out with us the last month or so. I have a fight ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 104,
            "ESH": 2,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 110
        },
        "total_judged": 110,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-21T05:23:07.377919"
    },
    {
        "id": "1qi86p2",
        "title": "AITA for telling my coworker to stop using my charger?",
        "url": "/r/AmItheAsshole/comments/1qi86p2/aita_for_telling_my_coworker_to_stop_using_my/",
        "body_summary": "So at my office there’s this shared desk area. I keep a phone charger plugged in under the desk because the outlets are annoying to reach.One of my coworkers started using it. At first I didn’t care. Then it became an everyday thing. I’d come in and my charger would already be unplugged from my phone and plugged into his. Sometimes he’d take it to another desk and forget to bring it back.Yesterday I asked him if he could stop using it or at least ask first. He laughed and said “relax, it’s just a charger\". Later my manager pulled me aside and said I was being “unnecessarily confrontational” and that in shared spaces I should expect people to share things.since I don't want to make it more complicated I didn’t escalate it beyond asking him once. but now it’s awkward and I feel like I made a...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 36,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 39
        },
        "total_judged": 39,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-21T05:23:23.072080"
    },
    {
        "id": "1qi1ea7",
        "title": "AITA for not writing thank you notes?",
        "url": "/r/AmItheAsshole/comments/1qi1ea7/aita_for_not_writing_thank_you_notes/",
        "body_summary": "My (35M) Mom (68F) recently asked me why I don’t make my kids (12F, 10F, 8F) write thank you notes. It’s not the first time that she has brought it up and you can tell that she has…feelings, about it. Growing up, my parents made both my sister and I write thank you notes, but the last time I chose to do this of my own accord was for my partner’s (37F) and my wedding in 2012.\n\nThis had been an intentional choice on my part. Gratitude is nice and both my wife and I seek to always say thank you, and have trained our kids to do so, for everything, whether it’s a home cooked meal, Xmas presents, shared lodging on a trip (all of which have been “gifts” given by my parents), but I struggle with the ethic of thinking you are “owed” a thank you note for gifts. In my mind, a gift is a gift, and if y...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 78,
            "ESH": 0,
            "NAH": 24,
            "INFO": 3,
            "TotalJudged": 117
        },
        "total_judged": 117,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-21T05:23:40.325212"
    },
    {
        "id": "1qikss9",
        "title": "AITA for refusing to keep lending my car to my boyfriend after he returned it damaged?",
        "url": "/r/AmItheAsshole/comments/1qikss9/aita_for_refusing_to_keep_lending_my_car_to_my/",
        "body_summary": "I’m 32F, my boyfriend is 34M, and we’ve been together just over a year. This has turned into a way bigger argument than it should be, and I’m honestly annoyed at this point.\n\nI own my car outright. It’s not luxury or anything, but it’s reliable and I need it. My boyfriend’s car broke down months ago and he still hasn’t fixed it, so I’ve been letting him borrow mine when I don’t need it. I didn’t love doing this, but I was trying to be supportive.\n\nA couple weeks ago he borrowed my car to go see a friend about an hour away. When he brought it back, he didn’t say *anything* about there being an issue. Later that night when I was unloading groceries, I noticed a long scratch on the side door. The next morning the tire pressure light came on.\n\nWhen I asked him about it, he said he “didn’t noti...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 57,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-21T05:23:56.168278"
    },
    {
        "id": "1qihz87",
        "title": "AITA for freaking out about poop on my mail",
        "url": "/r/AmItheAsshole/comments/1qihz87/aita_for_freaking_out_about_poop_on_my_mail/",
        "body_summary": "My small town has one postal delivery person, and we have had minimal issues since he started over the summer. \nToday, a small plastic package with a clothing item was delivered to my door inside a bag with a printed apology from USPS for a \"damaged package\". The package was covered in what smelled and looked like feces. The original bag was placed inside the printed bag and sealed but you can see and smell the feces. The inside and outside of both plastic bags were smeared and smelly. The clothing item is disgusting and garbage.\n \nI attempted to call the local post offices with no help, only an option to file a claim for them to investigate through the automated system. \n\nI posted in my town community group about the occurrence and the postal worker responded and asked what I would have l...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 8,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 11
        },
        "total_judged": 11,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-21T05:24:11.742865"
    }
]