[
    {
        "id": "1ps9guv",
        "title": "AITA for quietly leaving a group plan after being left out of the conversation?",
        "url": "/r/AmItheAsshole/comments/1ps9guv/aita_for_quietly_leaving_a_group_plan_after_being/",
        "body_summary": "I’m still not sure if I handled this the right way, so I’m here for an outside perspective.\n\nLast weekend, a small group of friends (5 of us total) made plans to meet up for dinner and then walk around a local street fair. The plan itself was casual, but it was something we’d all agreed on earlier in the week. I cleared my evening for it. The day of, we were coordinating through a group chat. I messaged asking what time we were meeting and where exactly. No one responded. About 15 minutes later, I saw two people in the chat sending memes to each other, so I figured they’d seen my message and would answer soon. They didn’t. I sent a follow-up about 20 minutes later asking if plans had changed. Still nothing. At that point, I assumed maybe everyone was already together and just forgot to loo...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 127,
            "ESH": 3,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 139
        },
        "total_judged": 139,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-22T05:17:17.977706"
    },
    {
        "id": "1pryy2n",
        "title": "AITA? Got into an argument with my 16 yo about a show they like",
        "url": "/r/AmItheAsshole/comments/1pryy2n/aita_got_into_an_argument_with_my_16_yo_about_a/",
        "body_summary": "AITA? Hi, I’m trying to figure out if I’m in the wrong here. If so, how do I go about fixing this. \n\nI was watching a show in the living room when my 16 year old came in and asked what I was watching. They said they had a show recommendation. \n\nWhile I was queuing it up, they told me that that opening 2 scenes were basically the best ever. As the show started, they talked through it pointing stuff out that thought was cool. \n\nWe got through the scenes and they had me pause the show. They asked me my thoughts. I said I didn’t really have any original thoughts to share. They asked why and I said because I didn’t really get to analyze the show and watch it for myself because they told me everything about it before I could. \n\nMy kid got annoyed and left the room, going down the hallway, saying...",
        "reddit_judgments": {
            "YTA": 51,
            "NTA": 51,
            "ESH": 12,
            "NAH": 17,
            "INFO": 1,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-12-22T05:17:37.752818"
    },
    {
        "id": "1ps8bhu",
        "title": "AITA for not waking up when my mom does?",
        "url": "/r/AmItheAsshole/comments/1ps8bhu/aita_for_not_waking_up_when_my_mom_does/",
        "body_summary": "I recently moved abroad and came home for Christmas. My mom has always struggled with sleep and often wakes up around 2-3am every morning. She has expressed to us how lonely it is because nobody else is awake at that time. She’s not medicated for it nor does she want to be (I think). This morning I woke up at 7 but stayed in bed until 8. She texts our family group chat asking if we all wanted to go to breakfast together, which everyone responded yes to within seconds. I immediately get dressed and shoes on, no shower not even brushing my teeth because I know she’s been waiting. When I go to see if she’s ready she is half dressed, my dad is still outside, and my brother isn’t dressed yet. I ask if I have time to wash my hair very quickly. She says no because I take forever in the shower (I ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 34,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 39
        },
        "total_judged": 39,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-22T05:17:53.350672"
    },
    {
        "id": "1ps1u3h",
        "title": "AITA for refusing to give mum’s savings to siblings in cash",
        "url": "/r/AmItheAsshole/comments/1ps1u3h/aita_for_refusing_to_give_mums_savings_to/",
        "body_summary": "I’m F 50 and have 2 siblings, older sister and younger brother, mum is 78 lives alone in a sheltered housing. I do most of the work for mum, washing, shopping, finances etc. I normally bring mum to stay with me every week end she’s up for it. We are in the UK. \n\nMy sister has 5 year affair with my husband I found out 15 years ago and it nearly destroyed me. I’m still with him but it’s been hard and I’m obviously estranged from sister, and mum sees her every other week which I’ve never tried to interfere on. \n\nBrother stopped speaking to me about 7 years ago and I’ve no idea why but he absolutely hates me and I don’t expect we’ll ever talk again. So I don’t speak to either of them. \nMum has made me power of attorney and her executor but they don’t know this, it will be hell when they find o...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 17,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 17
        },
        "total_judged": 17,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-22T05:18:09.032110"
    },
    {
        "id": "1ps9pjh",
        "title": "AITA for not wanting to live with my sister?",
        "url": "/r/AmItheAsshole/comments/1ps9pjh/aita_for_not_wanting_to_live_with_my_sister/",
        "body_summary": "I really need some neutral advice so that’s why I’m writing here. My sister is 33 years old, lives 2 hours away and currently moved back in with our parents because her job ends soon. Anyway, she wants to „start over“ and since I have a guest room, she wants to move in with me (28M). And it’s not like we don’t get along, we do pretty well, and she’s not messy or anything. But I am someone who needs his own space. I worked hard to get where I am and I’ll gladly help her find an apartment but I simply don’t want her to move in with me because that’ll just mess with my mental health and eventually I would feel like a stranger in my own home. To me it seems like she’s trying to take the easy way out instead of putting in the work to actually start over. I told her if you find a job and an apar...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 27,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-22T05:18:24.567861"
    },
    {
        "id": "1ps6fdb",
        "title": "AITA for not accepting my mom's apology?",
        "url": "/r/AmItheAsshole/comments/1ps6fdb/aita_for_not_accepting_my_moms_apology/",
        "body_summary": "Context: I’m a homebody who left college to work (going back next year) and have almost no friends besides my BFF (20 F) – we’ve been close 4 years but rarely meet up. A week ago, I told my mom I’d be spending the entire day with her at the beach, and she agreed it was fine.\n \nWhat happened: I left at 9:30 AM. By 1 PM, I’d put my phone away – we were busy talking, taking photos, eating, and sunbathing, so I lost track of time. When I checked at 4 PM, there were tons of missed calls and messages from my mom cursing me out and demanding my location. She even called my dad (parents are separated – he’s a cheater, alcoholic, and abusive, so I have no relationship with him) to search the city for me.\n \nWhen I called back, she screamed so loud my friend heard every curse word. I was mortified an...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 26,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-22T05:18:40.099717"
    },
    {
        "id": "1ps4q2k",
        "title": "AITA For expecting a dog walker to be sorry after her dog jumped up at me and covered me in mud and water?",
        "url": "/r/AmItheAsshole/comments/1ps4q2k/aita_for_expecting_a_dog_walker_to_be_sorry_after/",
        "body_summary": "Full story (long sorry): A month or two ago I was walking alone in a forest I regularly walk in and I passed a jogger who had a big long haired dog (don't ask what sort of dog, I know nothing about dogs) with her, the dog was running in front of her and had just come out of a pond and been running through mud. It wasn't raining and the paths are quite well made so I wasn't wearing waterproofs and was only in fabric trainers\n\nThe dog bounded straight towards me (100 yds-ish ahead of it's owner) and leaped up at me, it was obviously not aggressive, just over excited and I'm not scared of dogs or anything, but it left me soaked in mud and water and with cold wet feet for the rest of the walk, and needing to wash my coat, jumper, pants and shoes.\n\nThe lady made no attempt to call it off me unt...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 23,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-22T05:18:55.685715"
    },
    {
        "id": "1ps5m3f",
        "title": "AITA for refusing to change/cancel my weekend plans?",
        "url": "/r/AmItheAsshole/comments/1ps5m3f/aita_for_refusing_to_changecancel_my_weekend_plans/",
        "body_summary": "I’ve had a stressful few weeks with work and the work causing that was finally submitted on Friday and now my girlfriend and I are both finished work until January 5th.\n\nMy girlfriend had plans last night to go out with friends for food and a few drinks. I’d decided to have a nice relaxing evening in and catch up on tv, play video games, order some food and have a few drinks.\n\nI was looking forward to it since it’s been a while since I’ve had a relaxing evening especially an evening to myself.\n\nMy girlfriend knew about my plans but mentioned uesterday morning she didn’t really want to go out with friends so she’d cancelled. She mentioned we could do something and go out for drinks or something.\n\nI explained to her that she knows I’ve got a chilled night planned. She said I should be fine c...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 13,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 13
        },
        "total_judged": 13,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-22T05:19:11.124988"
    },
    {
        "id": "1przmv8",
        "title": "AITA for asking for my car back after selling it cheaply to help family?",
        "url": "/r/AmItheAsshole/comments/1przmv8/aita_for_asking_for_my_car_back_after_selling_it/",
        "body_summary": "AITA for asking for my car back after selling it cheaply to help family?\n\nI sold my old car to my partner’s father at a very reduced price to help him out financially.\n\nThe car was mine (it was a gift from my mum). I was originally going to trade it in for much more, but when my partner’s dad asked to buy it, we agreed and dropped the price significantly so it would be affordable. We also agreed he could pay in instalments.\n\nThat was 6 months ago.\n\nSo far, he’s only paid about a third of what he owes and keeps saying he has no money. He promised the remaining amount would be paid by a specific date, but it doesn’t look like that’s going to happen.\n\nI later found out that while he says he has no money, he is still spending on non-essential and unhealthy habits, which makes this feel unfair....",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 8,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 9
        },
        "total_judged": 9,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2025-12-22T05:19:26.557096"
    },
    {
        "id": "1przjqd",
        "title": "AITA for separating myself from demanding and controlling aunt, who gossips and wants free labor?",
        "url": "/r/AmItheAsshole/comments/1przjqd/aita_for_separating_myself_from_demanding_and/",
        "body_summary": "I just want to know if I'm being unreasonable for separating myself from a family member who needs a caregiver, but isn't willing to pay me for the work or respect boundaries? She says \"family should help family at no cost.\" Three years ago, she had a stroke and no one except me stepped up to help her. She insisted back then that she'd pay me and couldn't afford a mainstream caregiver which charged about $200/day. I told her I'd do it for $300/week. She agreed. I spent the better part of 12 weeks there, some days I'd go back home for rest and maintaining my own life, but I spent most of my time shopping and cleaning and doing very disgusting things to keep her going, walking her dog, laundry, errands and carting her around. She had a habit of gossip and felt the need to bash and insult my ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 6,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 6
        },
        "total_judged": 6,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2025-12-22T05:19:42.020810"
    }
]