[
    {
        "id": "1pj926x",
        "title": "AITA for my USB killer frying my friend’s PC after she snooped in my bag?",
        "url": "/r/AmItheAsshole/comments/1pj926x/aita_for_my_usb_killer_frying_my_friends_pc_after/",
        "body_summary": "20F, my friend is 21F. I always carry a USB killer in my backpack. It looks like any other thumb drive except I stuck a tiny devil face sticker on it so I know it’s the dangerous one. I keep it on me because I still live at home and my parents are super nosy; if I ever left it on my desk they’d definitely pick it up and plug it into their laptop to “see what it is.”\nYesterday I had to leave campus in a rush and asked my friend to watch my bag for a bit. I ended up not having time to come back so I just texted her to take it home and I’d grab it today. She said cool.\nShe gets home, admits she got curious and started looking through my stuff, finds the devil sticker USB, thinks it’s my normal drive, plugs it into her gaming PC to see what files I have.\nComputer instantly dies, mobo and PSU c...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 134,
            "ESH": 13,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 155
        },
        "total_judged": 155,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-11T05:15:32.369182"
    },
    {
        "id": "1pj3cqf",
        "title": "AITA for being furious that my husband gave away my sake and wine after I told him repeatedly not to?",
        "url": "/r/AmItheAsshole/comments/1pj3cqf/aita_for_being_furious_that_my_husband_gave_away/",
        "body_summary": "I (30F) came back from Japan about two months ago and brought home an expensive bottle of sake I specifically picked after doing a sake tasting class. I'm not a big drinker, so I chose something I genuinely liked and that my husband would enjoy. It was meant as a \"for us\" thing. I also had an unopened bottle of German wine that a friend gifted me three months ago.\n\nMy husband and I had multiple conversations where he asked if he could give the sake to his father, his cousin, or his friends, and I said a strict no every single time. Not vaguely, not jokingly, very clearly. He knew it was sentimental and partially a souvenir. He also refused to drink it the one time I opened it because he had a headache, so I had about 20 ml and left the rest untouched.\n\nFast forward to three days ago: I'm a...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 138,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 141
        },
        "total_judged": 141,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-11T05:15:59.353046"
    },
    {
        "id": "1pj5ac5",
        "title": "AITA for \"letting\" a kid go home with his actual parent?",
        "url": "/r/AmItheAsshole/comments/1pj5ac5/aita_for_letting_a_kid_go_home_with_his_actual/",
        "body_summary": "I was asked last minute to give a ride to a child on my son's soccer team by my wife and the child's mother, Dana. She is a single mom who's friends with my wife and they have a weekly ride sharing system that works for her and my wife. Since my wife is out of town I agreed with no issue to take the kid to the game. In the past when I've taken him he's gotten picked up back at our house after the game or practice by Dana.\n\nThis time at the game, Dana's ex (Jay) arrived toward the end. I know him from their time together and while I've heard terrible things about him through my wife, most of it is relationship stuff between them, and I've never had an issue personally with him. Dana's mother was having a casual convo with him which I interrupted to ask if he Jay was taking the kid home. He ...",
        "reddit_judgments": {
            "YTA": 67,
            "NTA": 73,
            "ESH": 5,
            "NAH": 1,
            "INFO": 9,
            "TotalJudged": 155
        },
        "total_judged": 155,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-11T05:16:20.495402"
    },
    {
        "id": "1piud18",
        "title": "AITA for telling my friend to deal with the consequences of disrespecting girl code?",
        "url": "/r/AmItheAsshole/comments/1piud18/aita_for_telling_my_friend_to_deal_with_the/",
        "body_summary": "I (23F) live in a dorm with 3 other female roommates. In an adjacent dorm, we have another group of girls that we also hang out with (will use pseudonyms for clarity). Just for context, we have all been friends for 3 & a half years of college. \nDuring those 3 years. My roommate (Elle) had a boyfriend & a friend in the other suite (Liz) also had a significant other. 6 months ago, both relationships ended & Elle ended reaching out & suddenly dating Liz’s ex-boyfriend. When Elle for told me that she had started the relationship, she asked my opinion & I told her that “if Liz & the other girls find out, they will be pissed at you for disrespecting girl code. If you are okay with them being mad at you, then do whatever makes you happy, but accept your consequences.” She agreed & said her new ma...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 53,
            "ESH": 12,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-11T05:16:37.084615"
    },
    {
        "id": "1piwdbb",
        "title": "AITA for insisting on leaving at 1 PM before a 6-hour drive despite my aunt’s pressure?",
        "url": "/r/AmItheAsshole/comments/1piwdbb/aita_for_insisting_on_leaving_at_1_pm_before_a/",
        "body_summary": "\nTomorrow I’m supposed to drive my two cousins, 23 and 24, to visit family. We’re using my car because one cousin doesn’t have a license and the other’s isn’t registered. I’m the only one insured, so I’m the only legal driver.\nI work overnight and get off at 7:30 AM. I told my cousins we needed to leave around 1 PM so I could get a few hours of sleep before driving six hours. They weren’t thrilled and even suggested my cousin drive my car while I slept, even though she isn’t insured. It took me putting my foot down for them to agree.\nThen my aunt started messaging me privately. She said, “Hey u guys need to leave sooner than 1 so u have daylight it might snow.” I said, “No. That’s my boundary. I need sleep.” She replied, “Don’t tell me no.” I said, “If not they can leave without me and my ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 79,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-11T05:16:53.514905"
    },
    {
        "id": "1pjc2ob",
        "title": "WIBTA if I called the police on my mom for robbing me?",
        "url": "/r/AmItheAsshole/comments/1pjc2ob/wibta_if_i_called_the_police_on_my_mom_for/",
        "body_summary": "Today my Mom came to watch my kids while I had my chemotherapy appointment at the hospital. She quickly left after I got back. I would have liked her to stay for a while because I'm not at my best but at least my kids had supervision when I needed it. The problem is when I got home my daughter was hungry. I'm not sure if she wasn't fed lunch or just hungry like usual. She kept looking in the fridge over and over. I went to help her get a snack because I had stocked the fridge yesterday with a lot of groceries including easy to eat prepared foods. Every single thing is gone. Mom must have bagged up all of my groceries and took them home. I don't even have milk or apple juice for my kids. I've called her several times and she isn't picking up. I called my brother who doesn't live with her an...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 25,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 29
        },
        "total_judged": 29,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-11T05:17:10.255683"
    },
    {
        "id": "1pj5ndy",
        "title": "AITA for telling my mom/boss that if she files me as a 1099, I’m filing an SS-8 with the IRS?",
        "url": "/r/AmItheAsshole/comments/1pj5ndy/aita_for_telling_my_momboss_that_if_she_files_me/",
        "body_summary": "So this is messy because it’s both a family and work issue. I (late 20s) work for my mom. She owns a small business, and for the longest time my employment situation has been… confusing. I do everything an actual employee would do: fixed schedule, she supervises me, I use all her equipment, I follow her rules, I represent the business, etc. But every time I’ve brought up proper paperwork, she acts like I’m annoying her or “making it complicated.”\n\nFast-forward to now: I quit/got fired back in October and now she suddenly tells me she’s going to file me as a 1099 independent contractor. Which, to be clear, is NOT accurate for what I do. I don’t run my own business, I don’t control my work, and I’m not contracting out services. I’m an employee.\n\nI explained (calmly) that if she misclassifies...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 57,
            "ESH": 6,
            "NAH": 0,
            "INFO": 11,
            "TotalJudged": 74
        },
        "total_judged": 74,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-11T05:17:26.442401"
    },
    {
        "id": "1pj7iss",
        "title": "AITA for refusing to give my sister back her dog after she abandoned him for 6 months?",
        "url": "/r/AmItheAsshole/comments/1pj7iss/aita_for_refusing_to_give_my_sister_back_her_dog/",
        "body_summary": "So my sister (28F) has always been dramatic. Last year she got a golden retriever puppy because her ex said “dogs make people more grounded” LMAO. Spoiler: They literally broke up two weeks later. Fast forward to six months ago. She calls me out SOBBING because she’s “too emotionally fragile” to take care of him and needs “a short mental health break” She says it’ll be maybe two weeks, And asks if I can watch him. I (18F) work two jobs and live in a small apartment, But I LOVE animals, So I said yes. Two weeks turned into a month. Then two. She stopped checking in. She stopped sending money for food. She literally blocked me on Instagram but was still posting her going out, Vacations, And a new man every other week. Meanwhile, Her pup is attached to me like Velcro. He sleeps curled up next...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 89,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 93
        },
        "total_judged": 93,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-11T05:17:42.384873"
    },
    {
        "id": "1pj9cki",
        "title": "AITA For revoking my GF's car priviledges",
        "url": "/r/AmItheAsshole/comments/1pj9cki/aita_for_revoking_my_gfs_car_priviledges/",
        "body_summary": "My GF (26F) and I (28M) have been together for about 3 years.  We've lived together for the past 6 months.  A couple of months ago my GF's car broke down and the repair estimate was really high.  Given that her car was over 10-years old she decided not to repair it and to start saving for a new one.  I agreed with her decision and told her we could make it work with sharing my car until she gets a new one.\n\nThis past weekend I had to work on Saturday to put the finishing touches on a big presentation for Monday.  When I told my GF about it on Friday night she asked if she could use my car to go see a friend while I was at work.  I told her as long as she drops me off and picks me up when I'm done that was find.\n\nShe dropped me off at my office and I told her I would text her when I was fin...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 104,
            "ESH": 19,
            "NAH": 4,
            "INFO": 4,
            "TotalJudged": 143
        },
        "total_judged": 143,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-11T05:18:00.481622"
    },
    {
        "id": "1pj6b6w",
        "title": "AITA for feeling like I paid for my own birthday event?",
        "url": "/r/AmItheAsshole/comments/1pj6b6w/aita_for_feeling_like_i_paid_for_my_own_birthday/",
        "body_summary": "A couple months ago we (group of 5 girls) went on a 30th birthday trip for my best friend, Anna. I didn’t know the other three ladies very well, but we had a fantastic time! Only major hiccup was that the hotel we’d all pitched in on was awful. I’m talking mold, dangerous neighborhood, weird stains on bed. Anna was crying, everyone was upset, I offered to book a nicer hotel so we didn’t have to call the trip off. I okayed the price by everyone and even used a bunch of travel points to knock down the price. Basically everyone was going to owe me around $150. It’s been two months and everyone had refused to pay me back or talk about it. Noting that I have a nice corporate job and they’re more broke and “just can’t right now”. I decided it wasn’t worth pitching a fit over $600. \n\nFast forward...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 55,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-11T05:18:16.285646"
    }
]