[
    {
        "id": "1r1uvfz",
        "title": "AITA for refusing to let a woman change the TV channel?",
        "url": "/r/AmItheAsshole/comments/1r1uvfz/aita_for_refusing_to_let_a_woman_change_the_tv/",
        "body_summary": "I (25f) live at an apartment complex with a community clubhouse. I work from home so I visit the clubhouse often. With that, I’ve found it convenient to keep one streaming account logged in on the TV, and purposefully created a separate profile FOR the residents to use if they’d like.\n\nICYMI - the Super Bowl was this past weekend, so I figured a few residents would end up watching the game on the large clubhouse TV. Before the game started, I decided to walk over to see what was going on. Surprisingly there was not a SOUL in the building. I didn’t really care about watching the game but I assumed someone else would, so I pulled up my handy dandy streaming service and put it on\n\nI sat down with the intention of just watching the first half and keeping the game on after I left. Halfway throu...",
        "reddit_judgments": {
            "YTA": 57,
            "NTA": 72,
            "ESH": 24,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 158
        },
        "total_judged": 158,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-12T05:58:41.555651"
    },
    {
        "id": "1r1yrwn",
        "title": "AITA: I Told a Friend She Couldn't Bring Her Child to my Event",
        "url": "/r/AmItheAsshole/comments/1r1yrwn/aita_i_told_a_friend_she_couldnt_bring_her_child/",
        "body_summary": "Background: My husband (35M) and I (30F) are staunchly childfree. However, we are not child haters. I work with children who have mental health needs and we spend time most months with our nieces and nephews (ages 1-8, both blood and chosen family).\n\nI've hosted an annual Galentine's event since 2018 and historically this event has been adults only. The date was selected back in December for late February. The following text exchange happened this week:\n\nFriend: \"I may need to bring my one-year-old. Does that ruin the vibe? Husband works and my mom is going to have my other two, but leaving one-year-old with her makes me nervous since he requires a lot more attention.\"\n\nSide note: her other two children are elementary aged.\n\nMe: \"Oh, this is a tough situation. I wouldn’t say bringing one-y...",
        "reddit_judgments": {
            "YTA": 45,
            "NTA": 70,
            "ESH": 1,
            "NAH": 39,
            "INFO": 1,
            "TotalJudged": 156
        },
        "total_judged": 156,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-12T05:58:51.495949"
    },
    {
        "id": "1r2b45r",
        "title": "AITA for beating my date in a game of pool",
        "url": "/r/AmItheAsshole/comments/1r2b45r/aita_for_beating_my_date_in_a_game_of_pool/",
        "body_summary": "So for context I am quite good at the game, I play regularly and against good opponents, 2 of which are in my country's nationals.\n\nSo I went on a date with a girl last Saturday, went to a pool bar as she had mentioned she likes playing Pool. I said I know a spot, I picked her up at her place and we went to the bar, we got some drinks, settled and then we played our first game, I was taking it easy just enjoying the moment, we played a few more rounds then ate, while talking I mentioned the 2 mates of mine who play nationals, so she then said \"Next game, don't go easy on me\" \n\nWe played a few more I made it a bit more challenging for her to win, nothing impossible, just a bit more of a challenging game, and just before we left around 10-11pm, we racked one last game and I decided to just p...",
        "reddit_judgments": {
            "YTA": 49,
            "NTA": 79,
            "ESH": 5,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-12T05:59:01.447284"
    },
    {
        "id": "1r1ug4x",
        "title": "UPDATE AITA for getting an apartment next to my friend’s old place?",
        "url": "/r/AmItheAsshole/comments/1r1ug4x/update_aita_for_getting_an_apartment_next_to_my/",
        "body_summary": "Original post: \\[ https://www.reddit.com/r/AmItheAsshole/s/6FnfGO3wgV \\](https://www.reddit.com/r/AmItheAsshole/s/6FnfGO3wgV)\n\nThank you all for the feedback. I was beginning to feel like I was going crazy and it was comforting to see people having a similar reaction to my own. Many of you told me that this girl is not a true friend and I’ve reached a point where I agree.\n\nAfter asking for time to think before meeting up we finally did… in the time between me telling her about my new place and me moving in she found a new apartment that is two blocks away from my new street.\n\nShe told me she felt invalidated and uncared for because I didn’t sit down and have a conversation with her in person when I initially decided to tour the apartment. That I am reactivating her trauma, that I am being ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 7,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 7
        },
        "total_judged": 7,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-02-12T05:59:08.953937"
    },
    {
        "id": "1r22fmw",
        "title": "AITA for completely lost it with my sister in front of my parents",
        "url": "/r/AmItheAsshole/comments/1r22fmw/aita_for_completely_lost_it_with_my_sister_in/",
        "body_summary": "so, I am an F20 and my sister a F26. For as long as I can remember, I always felt like I was being left out by my parents and sister. Since childhood I've always had the feeling that I was the black sheep of the family, and it seemed like nobody denied it; they always insinuated that I was slower, more difficult, and weirder than the other children.  And somehow, I never had the paternal and maternal comfort that a child suffering from emotional problems would have.\n\nThis intensified when I started my early teenage years, which were really difficult times for me in terms of mental health, and they were never there for me, and often made things even worse. I shared a room with my sister, and there were days when I would cry myself to sleep, and she wouldn't say a single word to me. I used t...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 38,
            "ESH": 3,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-12T05:59:16.544191"
    },
    {
        "id": "1r2fmhk",
        "title": "AITA for not telling my friend's partner that she didn't get the job at my company",
        "url": "/r/AmItheAsshole/comments/1r2fmhk/aita_for_not_telling_my_friends_partner_that_she/",
        "body_summary": "So I've taken over the family business along with my sister. Recently a friend of mine, who I always considered a very good friend, started just distancing himself. Yesterday I found out what it was. \n\nA few months ago we opened a position in our company and one of the resumes was [friend's] gf (she did not know when she applied that it was my company). In order to keep it professional, I wasn't involved in the process. My sister did the interview. It was actually kind of awkward because as she was leaving the building, I was walking in but I pretended I didn't see her because she faltered in her step, clearly recognizing me and said hello and I just said hello back and kept going like I didn't recognize her which could've been genuine since I have not been in a lot of gatherings with her ...",
        "reddit_judgments": {
            "YTA": 97,
            "NTA": 12,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 112
        },
        "total_judged": 112,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-12T05:59:24.906257"
    },
    {
        "id": "1r2asyn",
        "title": "AITA for asking my friend to pitch in on grocery bill?",
        "url": "/r/AmItheAsshole/comments/1r2asyn/aita_for_asking_my_friend_to_pitch_in_on_grocery/",
        "body_summary": "During a recent trip to Hawaii I took my partner on, we invited another couple (friends) as we had a 2 bedroom condo. The room was paid for, the other couple only had to pay for their air fare to get there. I rented a car for the week and picked them up at the airport. We then went to Costco to stock up on groceries for the week. We each picked out a meal for 4 nights along with snacks for the days and decided we would go out to eat the remaining nights. I asked the couple to reimburse half the Costco bill as we would all be eating/drinking during the week. They said ok, but I sensed hesitation. I didn't mention it again, but after the trip, the husband texted me and voiced that they were offended that I requested to split the bill. Throughout the rest of the trip, we split checks every ti...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 37,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-12T05:59:32.487225"
    },
    {
        "id": "1r1s49x",
        "title": "AITA for wanting to split rent evenly between myself and my coworker and his girlfriend?",
        "url": "/r/AmItheAsshole/comments/1r1s49x/aita_for_wanting_to_split_rent_evenly_between/",
        "body_summary": "My coworker and I are planning on renting a 2 bedroom 2 bath apartment (both bedrooms are an en suite and are basically the same size). The arrangement we have is that we would split rent between the two of us equally for the first couple months until his girlfriend moves in. At that point, they would be sharing a bedroom and mentioned that they would split his portion of the rent and cover utilities while I cover my share of the rent.\n\nAt first, I thought nothing of it. But as we have narrowed down our housing choices and are about to apply, it has began to rub me the wrong way. They're a couple, so naturally they would be sharing a room and they are voluntarily choosing to do so. If we split rent the way they propose, I would be paying $1,400 while they both pay $800 each. To me, this fe...",
        "reddit_judgments": {
            "YTA": 101,
            "NTA": 10,
            "ESH": 4,
            "NAH": 10,
            "INFO": 7,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-12T05:59:41.457625"
    },
    {
        "id": "1r29djf",
        "title": "AITA for telling my roommate I'm not paying for utilities they waste by leaving lights/AC on constantly?",
        "url": "/r/AmItheAsshole/comments/1r29djf/aita_for_telling_my_roommate_im_not_paying_for/",
        "body_summary": "I (22M) live with a roommate (23M) and we split rent and utilities 50/50 The problem is he's constantly leaving lights on in every room runs the AC at full blast even when he's not home and takes 30+ minute showers\n\nOur electricity bill has been insane the past few months and when I brought it up he just shrgged and said that's what utilities cost I started keeping track and he's definitely the one driving up the costs\n\nLast month the bill was almost double what it normally is I told him I'm only paying my fair share based on my usage and he needs to cover the extra he's wasting He got pissed and said we agreed to split everything 50/50 and I can't just change that now\n\nI told him the agreement was fair when we were both being reasonable but I'm not subsidizing his wastefulness He called m...",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 6,
            "ESH": 2,
            "NAH": 1,
            "INFO": 8,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-12T05:59:49.518540"
    },
    {
        "id": "1r1z4x4",
        "title": "AITA for not wanting my parents to stay at my apartment when they come visit?",
        "url": "/r/AmItheAsshole/comments/1r1z4x4/aita_for_not_wanting_my_parents_to_stay_at_my/",
        "body_summary": "I (27F) live in the US alone. I came here in 2016, and have been living in my current studio apartment since 2020. I haven’t been back to China since 2021. When I was doing MA and still had my parents’ support, I told them they can stay at my apartment when they visit. They came visit once in 2024, however it was for my graduation in a different city.\n\nThey asked to come visit this Chinese new year and at first I was happy. I haven’t seen them for 2 years and I was so excited to show them around. I almost forgot about the fact that we never had a good relationship growing up. However, my excitement was gone when they said their plan is to stay at my place for 2 weeks. I told them it’s better to get a hotel room since my apartment is 350 sqft and will be way too cramped for 3 people, and I ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 28,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-12T05:59:57.003584"
    }
]