[
    {
        "id": "1ntoz9d",
        "title": "AITA for not bringing my daughter’s friend home and making her parents come get her?",
        "url": "/r/AmItheAsshole/comments/1ntoz9d/aita_for_not_bringing_my_daughters_friend_home/",
        "body_summary": "OP took daughter and friends to NYC, warning about lots of walking. New friend Leah complained constantly and wanted to go home. Mom refused to drive/pay for train. Dad picked her up. Leah's mom is now angry. AITA for not taking Leah home myself?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 137,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 140
        },
        "total_judged": 140,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-30T05:11:30.303607"
    },
    {
        "id": "1nta8zg",
        "title": "AITA for doing a group Halloween Costume with my Stepdaughters that their Mother doesn't approve of?",
        "url": "/r/AmItheAsshole/comments/1nta8zg/aita_for_doing_a_group_halloween_costume_with_my/",
        "body_summary": "OP(35F) agreed to a \"Parent Trap\" group costume with her stepdaughters (10F) for Halloween. Stepdaughters wanted OP as Meredith Blake. The girls' mother disapproves of OP doing a group costume at all, accusing her of laziness. OP's husband defended the costume choice. AITA for agreeing to the costume?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 59,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-30T05:11:32.153744"
    },
    {
        "id": "1ntm2gw",
        "title": "AITA for using my Aunt’s personal employee discount code to buy clothes?",
        "url": "/r/AmItheAsshole/comments/1ntm2gw/aita_for_using_my_aunts_personal_employee/",
        "body_summary": "OP's aunt gave OP her employee discount code. OP used it to buy a lot of clothes. Aunt is now angry, making OP feel guilty. AITA for using the code so much since she offered it?\n...",
        "reddit_judgments": {
            "YTA": 38,
            "NTA": 60,
            "ESH": 30,
            "NAH": 1,
            "INFO": 12,
            "TotalJudged": 141
        },
        "total_judged": 141,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-30T05:11:35.689435"
    },
    {
        "id": "1ntkvnf",
        "title": "AITA for refusing to let my parents track me 24/7 just because I’m their daughter and not my brother?",
        "url": "/r/AmItheAsshole/comments/1ntkvnf/aita_for_refusing_to_let_my_parents_track_me_247/",
        "body_summary": "OP(19F) must share her location but her brother doesn't. Parents say it's due to her being female. OP refused, citing unfairness. Parents called her ungrateful. AITA for refusing tracking?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 54,
            "ESH": 0,
            "NAH": 9,
            "INFO": 2,
            "TotalJudged": 69
        },
        "total_judged": 69,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-30T05:11:40.336503"
    },
    {
        "id": "1ntrysk",
        "title": "AITA for refusing to let my friend turn my apartment into her “second closet”?",
        "url": "/r/AmItheAsshole/comments/1ntrysk/aita_for_refusing_to_let_my_friend_turn_my/",
        "body_summary": "Kayla (OP) let Kate store a few boxes, which became many bags. OP asked Kate to remove her things or pay rent. Kate refused, calling OP greedy. OP feels her space is overwhelmed & asks if she's TA for wanting Kate's stuff gone.\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 123,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 126
        },
        "total_judged": 126,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-30T05:11:42.821225"
    },
    {
        "id": "1nthvu3",
        "title": "Update - WIBTA - If I didn’t allow my half brother to move into the house we inherited from my father?",
        "url": "/r/AmItheAsshole/comments/1nthvu3/update_wibta_if_i_didnt_allow_my_half_brother_to/",
        "body_summary": "OP and sister bought out their half-brother's share of inherited house. The process was less dramatic than expected. OP asks AITA for overreacting previously, given the amicable outcome.\n...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 1,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 14
        },
        "total_judged": 14,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-09-30T05:11:45.611522"
    },
    {
        "id": "1ntw4l0",
        "title": "AITA for getting upset with my mom because she permantly banned me from taking my phone to her house and now wants me to buy a new one?",
        "url": "/r/AmItheAsshole/comments/1ntw4l0/aita_for_getting_upset_with_my_mom_because_she/",
        "body_summary": "OP, 13, has a phone from Dad that Mom now bans. Mom offered to split cost of a new phone but Dad disapproved. Mom then proposed OP give her $400 for her old phone. OP argued, calling Mom responsible for OP's alleged entitlement. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 21,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-30T05:11:47.073668"
    },
    {
        "id": "1nthqdj",
        "title": "UPDATE AITA for telling my brother that if he wants something done perfectly, he can do it himself?",
        "url": "/r/AmItheAsshole/comments/1nthqdj/update_aita_for_telling_my_brother_that_if_he/",
        "body_summary": "Original post : https://www.reddit.com/r/AmItheAsshole/s/TqYIcb2I58\n\nI talked to my brother again and following advice heard him out. He admitted that he was frustrated about something else and took it on me. My brother also confessed that a part of him was a little disappointed his son picked a different club to support but is over that now. I got my nephew an additional book to read - Thierry Henry’s biography. ",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 0,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 0
        },
        "total_judged": 0,
        "reddit_verdict": "No Judgments Found",
        "fetched_utc": "2025-09-30T05:11:47.275372"
    },
    {
        "id": "1ntzr0b",
        "title": "AITA for not letting my friend bring her dog on my kayak trip?",
        "url": "/r/AmItheAsshole/comments/1ntzr0b/aita_for_not_letting_my_friend_bring_her_dog_on/",
        "body_summary": "I (26F) planned a kayaking trip with two of my  friends, I have my own kayak and they were going to rent from the local shop. The night before, one friend asked if she could bring her big lab mix and I  said no that the rentals don’t allow pets and honestly it felt unsafe, If the dog jumped out or tipped over the kayak it could ruin the whole trip and I even suggested we hang out after somewhere dog-friendly. She blew up and  called me “controlling,” and said if her dog wasn’t welcome neither was she then she bailed and later told our mutuals that I “excluded” her. Now some people are acting like I was too strict.\r   \nAll I wanted was a calm day on the lake, not babysitting a 70lb dog. AITA?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 60,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-30T05:11:47.954808"
    },
    {
        "id": "1ntjbtp",
        "title": "AITA for not paying for my boyfriend??",
        "url": "/r/AmItheAsshole/comments/1ntjbtp/aita_for_not_paying_for_my_boyfriend/",
        "body_summary": "OP (18F) pays for dates with her BF (18M, athlete). She's now enjoying solo outings to save money. BF feels excluded and calls her selfish as he pays when with his friends. AITA for not inviting/paying for him?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 26,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-30T05:11:49.293689"
    }
]