[
    {
        "id": "1r4fivs",
        "title": "AITA for making my friend pay for my Uber home after she \"surprised\" me?",
        "url": "/r/AmItheAsshole/comments/1r4fivs/aita_for_making_my_friend_pay_for_my_uber_home/",
        "body_summary": "so i went out last night w some friends. one of them (let’s call her Sarah) offered to drive since she doesn’t drink and said she’d stay sober. cool.\n\neverything was fine until like 1am when she suddenly says she’s “too tired” and wants to leave. i told her i was good staying and i’d just uber home later. she kept saying she “felt responsible” for me and wouldn’t leave without me. it honestly turned into a whole thing and i didn’t feel like arguing in the middle of the club so i just went with her.\n\nthen once we get to the car she goes, “actually i’m gonna go to my bf’s place, it’s closer.” his place is like 20 mins the opposite direction from mine. she drives there, pulls into a gas station near his house and tells me to just call a ride from there.\n\nthe uber back to my place was $25 bc o...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 105,
            "ESH": 0,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 114
        },
        "total_judged": 114,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-15T05:48:57.740835"
    },
    {
        "id": "1r4ebgv",
        "title": "AITA for suggesting we swap weeks instead of automatically taking the kids for two extra weeks?",
        "url": "/r/AmItheAsshole/comments/1r4ebgv/aita_for_suggesting_we_swap_weeks_instead_of/",
        "body_summary": "My partner has 5 kids from a previous relationship. We do a one week on / one week off schedule.\n\nRecently, it feels like we’ve had the kids almost every weekend due to various adjustments. A few weeks ago, his ex messaged saying she’ll be going overseas for two weeks. The second week overlaps into her scheduled week by about 5 days.\n\nIn the past, he would usually just agree to these changes without discussing them with me. This time, he asked for my input, which I genuinely appreciated because it does affect our household and daily life.\n\nI suggested that we keep the kids for the two weeks she’s away, and then she keeps them for two weeks when she gets back so things stay balanced. After that, we’d return to the normal schedule.\n\nShe reacted by saying he was being difficult. She wants to ...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 41,
            "ESH": 2,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-15T05:49:05.986700"
    },
    {
        "id": "1r4lb3c",
        "title": "AITA for making a slight joke out of my pregnancy?",
        "url": "/r/AmItheAsshole/comments/1r4lb3c/aita_for_making_a_slight_joke_out_of_my_pregnancy/",
        "body_summary": "I am currently 6 months pregnant and very much showing, hard round bulging belly and all. Usually I am in hobo mode and do not care about how I look when I’m out running errands, but yesterday I decided to do my hair and put on a nice maternity outfit to go grocery shopping with my husband. \n\nWhile checking out an older lady approached me and told me I looked very pretty and was “rocking this pregnancy”. I genuinely thought this was very sweet of her and before I could say anything in response she asked me how far along I was. I took this as an opportunity to joke with her so I turned to my husband and said “pregnant? I know I had a big lunch but do I really look THAT big?” \n\nI proceeded to laugh to show that I was just kidding around but the lady made a face and my husband answered for me...",
        "reddit_judgments": {
            "YTA": 16,
            "NTA": 113,
            "ESH": 2,
            "NAH": 19,
            "INFO": 0,
            "TotalJudged": 150
        },
        "total_judged": 150,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-15T05:49:15.775868"
    },
    {
        "id": "1r4kah4",
        "title": "AITA for buying my daughter a car for her birthday, which my ex said made me the \"favourite parent\"?",
        "url": "/r/AmItheAsshole/comments/1r4kah4/aita_for_buying_my_daughter_a_car_for_her/",
        "body_summary": "Throwaway account here. \n\nAs a quick background, I (M52) was married to my ex-wife (F47) for 6 years. We have one daughter (F18, who I'll call Millie for ease) together and we generally have a \"fine\" co-parenting relationship. We only communicate when it relates to Millie, and it's always to the point and almost standoffish. I tend to have Millie from Thursday evening to Sunday, and my ex has her for the remainder of the week.\n\nWhilst my ex remarried about 10 years ago and had another kid, I have mostly stayed single. It's not for want of trying but due to work commitments and just not finding the right person, I've never found anything settled. I've managed to build myself a very solid career (think high six figures) and, as such, most of my spare income goes on Millie. She certainly isn'...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 139,
            "ESH": 3,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 152
        },
        "total_judged": 152,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-15T05:49:25.583023"
    },
    {
        "id": "1r4uoh2",
        "title": "AITA for refusing to help host a party",
        "url": "/r/AmItheAsshole/comments/1r4uoh2/aita_for_refusing_to_help_host_a_party/",
        "body_summary": "I 27f live with my boyfriend 28m and we both work full time but I end up doing most of the cleaning because he says he does not notice mess the same way last week I had a brutal few days at work and told him I was exhausted and just wanted a quiet weekend he said okay\n\nfriday night he tells me his friends are coming over saturday to watch the game and that it will be chill I asked why he did not talk to me first and he said it is our place not just mine\n\nI told him if he wants them over he needs to clean and handle everything because I am not hosting he said fine\n\nsaturday I stayed in the bedroom and did not clean the dishes or pick up the living room his friends came over and one of them joked about the mess my boyfriend was annoyed and barely talked to me after later he said I made him l...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 69,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 69
        },
        "total_judged": 69,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-15T05:49:33.451010"
    },
    {
        "id": "1r507ee",
        "title": "AITA for telling my friend she’s too big to go certain places?",
        "url": "/r/AmItheAsshole/comments/1r507ee/aita_for_telling_my_friend_shes_too_big_to_go/",
        "body_summary": "Weird tile but I’ll role with it. So I (16m) was talking to my friend (15f), I recently have been getting into urban exploring and was talking about it with her. She asked if she could come at some point, it’s important to mention she is plus sized. I said of course, but there would be certain places she wouldn’t be able to go because the only entrances were very small holes or there were parts you needed to be lifted into. I didn’t say it in a way that was intended to shame her, I just stated it like above, she got upset about what I said, I told her it wasn’t meant to hurt her- I just wanted her to know for future reference, but she hung up on me and we haven’t talked since. AITA?\n\nEDIT: I feel I should mention this: I didn’t mention her size just because, I mentioned it because of the h...",
        "reddit_judgments": {
            "YTA": 25,
            "NTA": 66,
            "ESH": 1,
            "NAH": 9,
            "INFO": 1,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-15T05:49:42.369729"
    },
    {
        "id": "1r4oe69",
        "title": "AITA for ruining their upcoming wedding",
        "url": "/r/AmItheAsshole/comments/1r4oe69/aita_for_ruining_their_upcoming_wedding/",
        "body_summary": "Hi Reddit, my husband and I are standing up in my brother’s upcoming wedding in June. Are we the a-holes for not attending the out of country bachelor and bachelorette parties. \n\nA little back story him and his fiancé got engaged almost 3 years ago in France. He wanted our parents and us to take the trip with them minus our 2 year old daughter. I was fortunate to attend, however my husband stayed home with our daughter. \n\nFor the last year they have “talked” about what they wanted to do for their bachelor and bachelorette parties without any set plans. He wanted to do a ski trip to Colorado in the beginning of the year and she wanted to go to Arizona. We honestly had both been on board for these trips. By Fall of last year, nothing was actually planned or set. In November the trip talks ha...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 52,
            "ESH": 2,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-15T05:49:50.195702"
    },
    {
        "id": "1r50qoo",
        "title": "AITA for assuming leftovers go in the fridge?",
        "url": "/r/AmItheAsshole/comments/1r50qoo/aita_for_assuming_leftovers_go_in_the_fridge/",
        "body_summary": "So my boyfriend (26m) and I (26f) rented an apartment for a night out. We went to a restaurant and I couldn't finish my dinner so I got a box for my leftovers. His friend is a manager at the restaurant and gave us a dessert for free but we were so full we took it in a to go container. Before we left the restaurant I placed both my leftovers container and dessert container in a plastic bag and tied it to make it easier to carry. \n\nWhen parked outside of the apartment, my boyfriend offered to carry the plastic bag of containers since we needed to walk upstairs and I was wearing heels and was carrying a purse. \n\nHere is where I might be the AH: I put my purse down and went to the bathroom to start getting ready for bed. I assumed my bf would put the plastic bag of takeout in the fridge. \n\nThe...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 31,
            "ESH": 3,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-15T05:49:57.691623"
    },
    {
        "id": "1r4iaf5",
        "title": "AITA blocking people in for parking",
        "url": "/r/AmItheAsshole/comments/1r4iaf5/aita_blocking_people_in_for_parking/",
        "body_summary": "i live in a gated community with assigned parking spaces. for context, ive been up since 8 between going to class and then having work at 6 and closing, so its been a long day. brother texted me letting me know his friend moved his car out of my assigned spot so im good to park. get home, ready to park and sleep. someones in my spot. i get pissed because everyone knows its assigned parking and block them in. keep in mind its 2am and i really dont give two fucks, or at least i didnt. 20 minutes goes by and i go back to my car to grab something i left/turn off the light. i move it forward a little to block my neighbors less. another hour goes by and i decide to move my car again bc its a nuisance for other people (in case they also get home at 2am). leave a note bc i still want them to feel ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 6,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 7
        },
        "total_judged": 7,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-02-15T05:50:05.072534"
    },
    {
        "id": "1r4n95h",
        "title": "AITAH for allowing my daughter to play on the 3 step ladder?",
        "url": "/r/AmItheAsshole/comments/1r4n95h/aitah_for_allowing_my_daughter_to_play_on_the_3/",
        "body_summary": "&#x200B;\n\nAITAH? Am I a bad mom that deserved it?\r\n\n\r\n\nFirst time posting, I was told to ask other parents their opinion if I didn’t like his, so here I am.\r\n\n\r\n\n This morning, valentine’s day BTW. Me (32f) and my daughter (5yo) woke up at 6am per usual and lately my daughter has been on a Kpop kick so its our wake up movie. We dance to the songs every morning. She likes to pretend she is on stage by using my 3 step, step ladder. I am always there with her, I don’t let her be ‘crazy’ on it but she enjoys it and has never gotten hurt. This morning is Saturday and she asked for the movie and the step ladder and so I turned it on and pulled it out, but she didn’t want me, she wanted to show and dance with her dad (45m) so she goes and gets him. He comes out and sees her climb on the ladder an...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 74,
            "ESH": 8,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 91
        },
        "total_judged": 91,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-15T05:50:13.597835"
    }
]