[
    {
        "id": "1luy4zp",
        "title": "AITA for donating my roommate’s family heirloom to goodwill?",
        "url": "/r/AmItheAsshole/comments/1luy4zp/aita_for_donating_my_roommates_family_heirloom_to/",
        "body_summary": "OP's roommate stopped paying rent and moved in with her boyfriend. OP repeatedly asked her to pay/move out, but got no response. OP paid rent, packed/donated roommate's belongings, and changed the locks. Roommate returned, upset about the donated items (including a wedding dress). AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 150,
            "ESH": 1,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 154
        },
        "total_judged": 154,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-09T05:16:54.810087"
    },
    {
        "id": "1luqn6d",
        "title": "AITA for telling my identical twin sister to stop calling us \"fat twins\" ?",
        "url": "/r/AmItheAsshole/comments/1luqn6d/aita_for_telling_my_identical_twin_sister_to_stop/",
        "body_summary": "I (23f) have an identical twin sister who loves the idea that we have a psychic connection. We were thin during our childhood. I stayed in my home state and she went to a university in a different state. While far away, we both got very overweight and we're only 20 pounds apart.\n     My sister is back in our home state and she's amazed that we had a similar change. She's been calling us \"fat twins.\" I eventually told her I stop calling us that and she got upset. She said if I don't like how I look then I must dislike how she looks. She said I'm shallow and ignoring our special bond. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 50,
            "ESH": 0,
            "NAH": 5,
            "INFO": 2,
            "TotalJudged": 58
        },
        "total_judged": 58,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-09T05:16:55.708212"
    },
    {
        "id": "1lumnur",
        "title": "WIBTA if I canceled my husband's birthday party?",
        "url": "/r/AmItheAsshole/comments/1lumnur/wibta_if_i_canceled_my_husbands_birthday_party/",
        "body_summary": "OP hosted a BBQ for husband's bday, SIL declined, wanting a restaurant dinner. SIL planned nothing, realized it's too costly, and now wants OP to host another party. OP is considering refusing. WIBTA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 73,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 74
        },
        "total_judged": 74,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-09T05:16:57.181389"
    },
    {
        "id": "1luvqbk",
        "title": "AITA for using GPS instead of my in-laws' directions in rural Iowa",
        "url": "/r/AmItheAsshole/comments/1luvqbk/aita_for_using_gps_instead_of_my_inlaws/",
        "body_summary": "OP drove in-laws, using GPS for directions. They preferred slower, known routes. OP ignored their directions once, taking a faster GPS route. In-laws were annoyed. OP asks AITA for using GPS over their preferred route, despite their GPS use elsewhere.\n...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 41,
            "ESH": 1,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-09T05:16:59.248115"
    },
    {
        "id": "1lutkd2",
        "title": "AITA for saying that my parents’ comments infantilizing me for my life choices and being disabled were demeaning and hurtful?",
        "url": "/r/AmItheAsshole/comments/1lutkd2/aita_for_saying_that_my_parents_comments/",
        "body_summary": "OP, 25, helps at parents' business, feeling undervalued compared to a coworker with kids. After parents dismiss her & call her a \"kid\" due to her childfree status, she points out the hypocrisy of judging women based on life choices. AITA for calling out their double standard?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 48,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-09T05:17:01.565861"
    },
    {
        "id": "1luit4p",
        "title": "AITA for not lending my sister money even though I have a high paying job now?",
        "url": "/r/AmItheAsshole/comments/1luit4p/aita_for_not_lending_my_sister_money_even_though/",
        "body_summary": "OP got a high-paying job. Sister, who raised him, asked for $5k to avoid eviction, promising repayment. OP refused, citing savings goals & sister's history. Mom says OP is abandoning her. AITA?\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 47,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-09T05:17:03.761013"
    },
    {
        "id": "1luz2km",
        "title": "AITA for not participating in my company’s Christmas in July?",
        "url": "/r/AmItheAsshole/comments/1luz2km/aita_for_not_participating_in_my_companys/",
        "body_summary": "OP dislikes coworker Mara for poor work ethic, costing OP tips. Coworkers planned a \"Christmas in July\" potluck and secret Santa. OP refused secret Santa due to not wanting to buy Mara a gift. Managers pressured OP to participate, OP threatened to skip the potluck too. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 34,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-09T05:17:05.235054"
    },
    {
        "id": "1lul5k6",
        "title": "AITA for not telling my dad when my scholarship money came in?",
        "url": "/r/AmItheAsshole/comments/1lul5k6/aita_for_not_telling_my_dad_when_my_scholarship/",
        "body_summary": "OP, a PhD student, received scholarship money. She planned a surprise vacation for her parents using it, not telling her father immediately. He's now angry, feeling she hid the money and assumed he'd ask for it. He refuses the trip and is being stubborn. AITA for delaying telling him about the money?\n...",
        "reddit_judgments": {
            "YTA": 20,
            "NTA": 8,
            "ESH": 3,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-07-09T05:17:07.463685"
    },
    {
        "id": "1luxx3o",
        "title": "AITA for using the bathroom at work?",
        "url": "/r/AmItheAsshole/comments/1luxx3o/aita_for_using_the_bathroom_at_work/",
        "body_summary": "OP (25F) with IBS uses work bathrooms to poop. Coworker called it gross, others agree. OP asks if pooping at work makes them an AH, given sufficient bathrooms/breaks.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 125,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 125
        },
        "total_judged": 125,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-09T05:17:11.034112"
    },
    {
        "id": "1luqlex",
        "title": "AITA for considering backing out of a trip after my friend decided to spend our only full night with his ex-gf?",
        "url": "/r/AmItheAsshole/comments/1luqlex/aita_for_considering_backing_out_of_a_trip_after/",
        "body_summary": "OP planned a beach trip with a friend. Friend now wants to spend Saturday dinner with his ex & her family. OP feels ditched, considers canceling. Friend accuses OP of overreacting. AITA for wanting to back out?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 54,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-09T05:17:12.362420"
    }
]