[
    {
        "id": "1o6qrl1",
        "title": "AITA for having a new neighbor's car towed?",
        "url": "/r/AmItheAsshole/comments/1o6qrl1/aita_for_having_a_new_neighbors_car_towed/",
        "body_summary": "OP's wife's paid parking spot was taken by a new neighbor. OP called security, the car was towed, and his wife parked far away. The neighbor confronted OP, saying the office said it was first-come-first-served. AITA for towing instead of knocking?\n...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 125,
            "ESH": 0,
            "NAH": 1,
            "INFO": 6,
            "TotalJudged": 138
        },
        "total_judged": 138,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-15T05:11:16.862557"
    },
    {
        "id": "1o683ra",
        "title": "AITA Teacher got into family discussion and reprimanded my child before I could say a word",
        "url": "/r/AmItheAsshole/comments/1o683ra/aita_teacher_got_into_family_discussion_and/",
        "body_summary": "MIL and daughter argued after a concert. Teacher intervened, scolding daughter and attempting physical discipline. OP pulled daughter away, arguing with the teacher. MIL defended teacher's actions. AITA for interfering?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 67,
            "ESH": 3,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 76
        },
        "total_judged": 76,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-15T05:11:18.880871"
    },
    {
        "id": "1o6trfp",
        "title": "AITA for refusing my parents’ curfew and 24/7 tracking while I’m just trying to study and maintain somewhat of a social life while away from college for a semester?",
        "url": "/r/AmItheAsshole/comments/1o6trfp/aita_for_refusing_my_parents_curfew_and_247/",
        "body_summary": "OP (20s) returned home for mental health reasons while still in college. Parents track her location 24/7, spam texts/calls despite knowing her whereabouts. OP wants privacy & refuses constant tracking/curfew due to accusations when location glitches. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 59,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-15T05:11:20.202625"
    },
    {
        "id": "1o6cksm",
        "title": "AITA for keeping my grandmother out of the loop with my pregnancy",
        "url": "/r/AmItheAsshole/comments/1o6cksm/aita_for_keeping_my_grandmother_out_of_the_loop/",
        "body_summary": "OP(f28), pregnant with HG, is overwhelmed by her grandmother's frequent, unhelpful advice on how to manage her condition. OP decided to limit contact, only answering direct questions, not discussing her health. Aunts say she's wrong to exclude family. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 49,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-15T05:11:21.578941"
    },
    {
        "id": "1o6pbad",
        "title": "AITA for not letting a stranger use my toilet?",
        "url": "/r/AmItheAsshole/comments/1o6pbad/aita_for_not_letting_a_stranger_use_my_toilet/",
        "body_summary": "For context: I live in an urban area where not many public toilets are available, I'm a guy and in my late 20s\n\nI was just on my way into my apartment when a stranger stopped me and asked if he could use my bathroom. He looked like an ordinary person, roughly my age. Nothing scary or intimidating about him. \n\nI really didn't (and don't) like the idea that somebody I don't know would see and use such a private space. So I told him he can't. He tried to offer me 5$, but it didn't change my mind.\n\nI feel kind of bad about it now that I didn't help. Something like this has never happened to me before and in the moment it really caught me off guard. But now that I'm thinking about it, I am not sure if I would react differently next time.\n\nSo AITA for not helping?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 116,
            "ESH": 0,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 120
        },
        "total_judged": 120,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-15T05:11:22.777743"
    },
    {
        "id": "1o6sids",
        "title": "AITA: I’m doing everything my roommate asks and I’m still waking him up at night",
        "url": "/r/AmItheAsshole/comments/1o6sids/aita_im_doing_everything_my_roommate_asks_and_im/",
        "body_summary": "OP's roommate complains about noise when OP returns late from studying. OP adjusted behavior, avoiding drawers. Roommate still wakes, despite having noise-canceling headphones but not using them. OP feels all the burden is on them to keep the roommate asleep. AITA?\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 44,
            "ESH": 0,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 57
        },
        "total_judged": 57,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-15T05:11:24.308415"
    },
    {
        "id": "1o6tgg7",
        "title": "AITA for telling my friends that their dog couldn’t stay at my house any longer?",
        "url": "/r/AmItheAsshole/comments/1o6tgg7/aita_for_telling_my_friends_that_their_dog/",
        "body_summary": "OP, allergic and uncomfortable around dogs, was pressured into watching a friend's dog. The dog destroyed OP's house, causing stress. OP returned the dog and offered help at friend's house. Friends reacted coldly. AITA for returning the dog?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 57,
            "ESH": 13,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-15T05:11:26.225750"
    },
    {
        "id": "1o6kj4c",
        "title": "AITA because I refuse to change my clothing choices even though it’s causing family problems?",
        "url": "/r/AmItheAsshole/comments/1o6kj4c/aita_because_i_refuse_to_change_my_clothing/",
        "body_summary": "OP, a 27F of Middle Eastern background, wears revealing clothing when clubbing. Her family disapproves, saying she's attracting the wrong attention and embarrassing them. OP only dresses like this when clubbing & covers her private parts. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 30,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-15T05:11:27.571105"
    },
    {
        "id": "1o66xt3",
        "title": "AITA for asking my mom if my grandma could live anywhere else?",
        "url": "/r/AmItheAsshole/comments/1o66xt3/aita_for_asking_my_mom_if_my_grandma_could_live/",
        "body_summary": "OP(15f)'s grandma moved in after grandpa's death & is making rude remarks. Mom & grandma discussed having her stay permanently. OP asked mom if grandma could stay elsewhere. Mom threatened to send OP to uncle's. Grandma blames OP for things. AITA for not wanting grandma to live there?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 13,
            "ESH": 1,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 18
        },
        "total_judged": 18,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-15T05:11:28.716232"
    },
    {
        "id": "1o6ebay",
        "title": "AITA for having to leave my grandaughters birthday party?",
        "url": "/r/AmItheAsshole/comments/1o6ebay/aita_for_having_to_leave_my_grandaughters/",
        "body_summary": "My first granddaughters birthday party was Saturday. I have always had and will always have severe social anxiety. It's just there. And its awful. It was halfway through the party and I thought I was going to pass out. So I left to take the medication that I left at my daughter's house and I couldn't get back up. I couldn't go to the second half of her party. This isnt the first time I've had to leave a social engagement and my daughter has given me an ultimatum of either being there and dealing with the anxiety or don't be there at all. I feel broken,lost and unloved. Just wanna know if I'm also the asshole ",
        "reddit_judgments": {
            "YTA": 38,
            "NTA": 19,
            "ESH": 1,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-10-15T05:11:29.744657"
    }
]