[
    {
        "id": "1rdlw7l",
        "title": "AITA for asking my friend group to send deposits upfront for the trip after last time only half paid me back?",
        "url": "/r/AmItheAsshole/comments/1rdlw7l/aita_for_asking_my_friend_group_to_send_deposits/",
        "body_summary": "our friend circle, which comprises 6 friends, takes a trip every year. i usually plan the trip, including booking airbnb and other arrangements. last year, i had to pay 600$ from my pocket as everyone was saying \"pay me later.\" only half of them actually paid me later, though. when we were planning the trip this year, i suggested that everyone pay the deposit first, and then i wouldn't have to pay from my pocket. some of my friends got upset and said that it was making things complicated and that i was overthinking. one of my friends said, \"you're usually good at this, what's changed.\" am i the aita for requesting the deposits this time?",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 135,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-25T05:53:58.185188"
    },
    {
        "id": "1rdmrv4",
        "title": "AITA for refusing to switch project topics after my classmate “claimed” it late?",
        "url": "/r/AmItheAsshole/comments/1rdmrv4/aita_for_refusing_to_switch_project_topics_after/",
        "body_summary": "In one of my university classes, we had to pick presentation topics from a shared Google Sheet. It was first come, first served. The professor said once you put your name down, it’s yours.\n\nThere was one topic everyone wanted because it’s easier and has a lot of sources. I checked the sheet the night it opened and saw no one had written their name yet, so I added mine.\n\nThe next morning, a girl from my class messaged me saying she was “planning to take that one” and had already told her friends she was doing it. She said she forgot to add her name before going to bed and asked if I could switch with her. The only topics left were more complicated and would definitely require more work.\n\nI told her I was sorry but I picked it fairly and didn’t want to switch.\n\nNow some classmates are saying...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 143,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 143
        },
        "total_judged": 143,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-25T05:54:07.675643"
    },
    {
        "id": "1rdq89u",
        "title": "AITA for not giving my Roommate more space?",
        "url": "/r/AmItheAsshole/comments/1rdq89u/aita_for_not_giving_my_roommate_more_space/",
        "body_summary": "I'm using a throwaway because she knows my real reddit. So I hope you all understand.\n\nI (29F) am a homeowner, I inherited a 3 bedroom house after my Aunt died of cancer two years ago. She had no children and we were close so it was a no brainer that she'd leave it to me. I spent the first year after the house passed to me renovating it and making it feel like mine, it was around the time this finished that my friend (29F) had to leave her boyfriends flat after they broke up and she didn't have a backup plan. I let her move in with me and told her she was of course welcome to stay.\n\nI gave her the second largest bedroom which is 13 square meters with its own bathroom. I have the master bedroom and the box room is my office as I work from home. I told her that the bedroom she had was her sp...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 142,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 143
        },
        "total_judged": 143,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-25T05:54:17.088680"
    },
    {
        "id": "1rdy299",
        "title": "AITA for not letting my bridesmaid change out of her bridesmaid dress after the ceremony?",
        "url": "/r/AmItheAsshole/comments/1rdy299/aita_for_not_letting_my_bridesmaid_change_out_of/",
        "body_summary": "I (27 F) am getting married in 6 weeks and I was asked by one of my bridesmaids if they could change out of their bridesmaid's dress into a black dress after the ceremony because she's uncomfortable in color. \n\nA little background, all of my bridesmaids are wearing a dusty blue. I allowed them to pick whatever style of dress they wanted; my request is that they all wear the blue and length needs to be long. The reason she feels uncomfortable is because of the color of her hair and skin tone on top of her thyroid issues that just arose and causes her to gain weight. She wants to be respectful but she is uncomfortable in the color.\n\nI told her I would like everyone in their bridesmaids dresses as we will be taking pictures all night and I didn't want any other bridesmaids asking \"can I chang...",
        "reddit_judgments": {
            "YTA": 94,
            "NTA": 34,
            "ESH": 0,
            "NAH": 13,
            "INFO": 7,
            "TotalJudged": 148
        },
        "total_judged": 148,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-25T05:54:27.788490"
    },
    {
        "id": "1rdj40i",
        "title": "AITAH for not changing my lifestyle to accomodate my neighbours ?",
        "url": "/r/AmItheAsshole/comments/1rdj40i/aitah_for_not_changing_my_lifestyle_to_accomodate/",
        "body_summary": "Alright everybody, get ready for a long one.\n\nA few months ago my fiancee (F29) and I (M29) bought our first appartment. It took years of saving and 6 months of renovation, but we finally managed to move in at the end on January.\n\nI have recently been laid off for economic reasons and to top it off, I have trouble relaxing/lazing around during the day. If the sun is out, I feel the need to do stuff. As a consequence, my only real \"relax time\" is at night, when I do not feel any internal pressure to be active. You might imagine that, as an unemployed nightowl, my bedtime is a little bit dephased with the rest of society and it is not rare for me to get to bed at 5am.\n\nWhen renovating the kitchen/living area, we realised that the concrete slab rigidifying my hardwood floor had been destroyed...",
        "reddit_judgments": {
            "YTA": 19,
            "NTA": 41,
            "ESH": 10,
            "NAH": 1,
            "INFO": 7,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-25T05:54:38.006977"
    },
    {
        "id": "1rdimnl",
        "title": "AITA for refusing to bring a package as a favour to a former colleague?",
        "url": "/r/AmItheAsshole/comments/1rdimnl/aita_for_refusing_to_bring_a_package_as_a_favour/",
        "body_summary": "My (former) colleague recently moved to a new city in a different country (about an hour flight away). I can’t say we were friends, but we’ve always been friendly. Recently she heard on the grapevine that I’m going to her city for a brief work trip in about 2 weeks and reached out to ask if I can bring her a small package - a small item from a clothing brand that’s more expensive where she lives now. Sure, I don’t mind. I gave her my address and asked her to please order it to my home and I’ll bring it to her. \n\nA few days later she writes back and says that she ordered it to her friend’s address because it was somehow slightly cheaper, and gave me the friend’s number to “coordinate with her to pick it up”. When I reached out to the friend, I quickly learned that she lives over an hour awa...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 78,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-25T05:54:45.769015"
    },
    {
        "id": "1re1abp",
        "title": "AITA for having my wedding on the same day ( different year ) as my brother?",
        "url": "/r/AmItheAsshole/comments/1re1abp/aita_for_having_my_wedding_on_the_same_day/",
        "body_summary": "My girlfriend and I just got engaged. She has a brain tumor ( not cancer ) that has accelerated our timeline. We are going to get legally married so that I can get her on my insurance for treatment and eventually brain surgery .  Because she is going to need brain surgery which will require a good portion of her head to be shaved and will leave a scar she wants to have the formal wedding this year so she can feel beautiful and not have a bald spot/ scar. \n\nWe have looked at a few venues and we found one we love and is in our budget. The problem is the only date they have available in 2026 is Halloween. My brother in his fiance have said they are getting married on Halloween 2027 but they have not put money down on a venue , have not sent out save the dates , and honestly i dont believe the...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 87,
            "ESH": 4,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 97
        },
        "total_judged": 97,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-25T05:54:53.821187"
    },
    {
        "id": "1rdapfc",
        "title": "AITA Am i asshole for refusing to lend my sister money after she never paid me back the first time am the ass hole?",
        "url": "/r/AmItheAsshole/comments/1rdapfc/aita_am_i_asshole_for_refusing_to_lend_my_sister/",
        "body_summary": "I 27M have a younger sister 24F who I’ve always tried to support. About a year ago she asked to borrow a decent amount of money because she was behind on rent. She promised she would pay me back within two months. I didn’t hesitate and transferred it the same day.\n\n\n\nTwo months passed. Then three. Then six. Every time I gently brought it up she’d say she was struggling but would sort me out soon. Eventually, she stopped bringing it up entirely I never got a single payment back not even a small one.\n\n\n\nLast week she called me again asking for another loan because her car needs repairs. I told her I wasn’t comfortable lending her more money until she paid back what she already owes me. She got upset and said I was being selfish and that family is supposed to help each other. Our mom even cal...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 64,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-25T05:55:01.508168"
    },
    {
        "id": "1rdwboe",
        "title": "AITA for wanting my bed to be mine?",
        "url": "/r/AmItheAsshole/comments/1rdwboe/aita_for_wanting_my_bed_to_be_mine/",
        "body_summary": "AITAH for telling my mum to stop sleeping in my bed when I stay at my boyfriend’s?\n\nI (23F) live at home with my parents and younger sibling. I’ve just graduated and work full time. I don’t pay rent, but I regularly pay for groceries and help by driving my sibling to school and activities. They will not accept rent off me as they want me to save to get my own place which I appreciate.\n\nSometimes during the week I stay at my boyfriend’s house for one or two nights. When I do, my mum sleeps in my bed because she says it’s more comfortable than hers.\n\nI’ve told her multiple times this makes me uncomfortable because my bed and room are my private space. She shuts me down and says that if I’m not there, my bed is basically a “spare.” I would like my bed to be respected as my own private space.\n...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 54,
            "ESH": 0,
            "NAH": 4,
            "INFO": 3,
            "TotalJudged": 75
        },
        "total_judged": 75,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-25T05:55:09.614927"
    },
    {
        "id": "1rdwp3w",
        "title": "AITA for not paying for my mother’s $4,000 wardrobe and eventually screaming at her?",
        "url": "/r/AmItheAsshole/comments/1rdwp3w/aita_for_not_paying_for_my_mothers_4000_wardrobe/",
        "body_summary": "My wife and I moved to the US (SF) from India back in 2022. I was making about $8k a month after taxes, apart from stocks. While my annual salary sounds massive when converted to Indian Rupees, my family doesn’t seem to realize that I am not spending in Rupees. Between SF rent, general expenses, and a loan I was still paying off in 2022, we were barely saving $1,000 to $2,000 a month.\n\nWithin three months of moving, my parents asked me to buy my brother a $1,000 laptop, which I did. I also bought my dad a $2,200 laptop. He didn’t necessarily need it, but I remembered how he bought me an expensive laptop when I joined engineering, so I wanted to do something similar for him. I have also spent on other things, sending money home almost every other month: $300 here and $600 there. I even sent...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 27,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-25T05:55:17.718317"
    }
]