[
    {
        "id": "1kmbc3t",
        "title": "AITA for not skipping my stepson’s graduation even though his mom is threatening to make a scene?",
        "url": "/r/AmItheAsshole/comments/1kmbc3t/aita_for_not_skipping_my_stepsons_graduation_even/",
        "body_summary": "OP's stepson wants her at his graduation, but his mom, Jan, doesn't, contacting the school to exclude OP. Step-son wants OP there, & her husband supports it. Relatives say OP should stay home to avoid drama. AITA for still wanting to go?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 138,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 139
        },
        "total_judged": 139,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-15T05:12:02.461736"
    },
    {
        "id": "1kmhzor",
        "title": "AITA for not properly telling my acquaintance that the dish they ordered would be stinky?",
        "url": "/r/AmItheAsshole/comments/1kmhzor/aita_for_not_properly_telling_my_acquaintance/",
        "body_summary": "OP, half Korean, took friends to a Korean restaurant. \"B\" questioned OP's Korean-ness. OP warned B about stinky dish, B ignored, hated it, & thinks OP baited him. AITA for not dissuading B more?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 151,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 152
        },
        "total_judged": 152,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-15T05:12:04.440827"
    },
    {
        "id": "1kmru7h",
        "title": "AITA for not letting my husband with $13k debt have access to my credit card",
        "url": "/r/AmItheAsshole/comments/1kmru7h/aita_for_not_letting_my_husband_with_13k_debt/",
        "body_summary": "OP, establishing credit, refuses to add her husband (bad credit history) as an authorized user on her credit card. He argues married couples should share assets/credit. OP feels guilty but wants to protect her credit score. AITA?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 101,
            "ESH": 1,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 110
        },
        "total_judged": 110,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-15T05:12:06.497799"
    },
    {
        "id": "1kmfphf",
        "title": "AITA for telling a mother that having a baby in the passengers seat without a car seat is dangerous?",
        "url": "/r/AmItheAsshole/comments/1kmfphf/aita_for_telling_a_mother_that_having_a_baby_in/",
        "body_summary": "So I (24f) work at starbucks and yesterday a woman pulled up to the drive thru window with a baby sitting in the passengers seat without a car seat. I asked her if the baby had a car seat and she said \"yeah but he was crying when I put him in it.\" \nHer drinks were still being made so I stepped away to calm down. \nWhen I handed her the drinks I said \"Its incredible unsafe and illegal in ohio to have a baby in the front seat like that.\" \nShe just looked pissed and rolled her eyes as she  drove away. \nI was at work so maybe I should have just kept my mouth shut? ",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 102,
            "ESH": 1,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 114
        },
        "total_judged": 114,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-15T05:12:07.735358"
    },
    {
        "id": "1kmlcup",
        "title": "AITA for not cancelling my camping trip to go to a family BBQ?",
        "url": "/r/AmItheAsshole/comments/1kmlcup/aita_for_not_cancelling_my_camping_trip_to_go_to/",
        "body_summary": "OP & husband have a coveted RV trip planned. SIL invited them to a BBQ the same weekend; they declined. SIL pressured them to reschedule, citing limited time with family. OP offered an alternative weekend. They don't want to cancel the trip. AITA for not changing plans?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 141,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 141
        },
        "total_judged": 141,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-15T05:12:09.987276"
    },
    {
        "id": "1kmv2fq",
        "title": "AITA for asking my in-laws not to bring their dog to our house when they come into town?",
        "url": "/r/AmItheAsshole/comments/1kmv2fq/aita_for_asking_my_inlaws_not_to_bring_their_dog/",
        "body_summary": "OP's in-laws bring their dog (Rover) despite OP's discomfort with his behavior (licking, rubbing). They previously agreed not to, but ignored the rule. Husband is unsupportive. AITA for insisting they leave Rover home?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 110,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 111
        },
        "total_judged": 111,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-15T05:12:12.868123"
    },
    {
        "id": "1kmu395",
        "title": "AITA for telling my mom \"You lost two kids, do you want to lose another?\" when she treatened to kick me out?",
        "url": "/r/AmItheAsshole/comments/1kmu395/aita_for_telling_my_mom_you_lost_two_kids_do_you/",
        "body_summary": "OP's (20F) mom (50F), a substance abuser with mental illness, relapsed on Mother's Day. They argued, and OP left for her partner's. Later, her mom threatened to kick her out. OP suggested therapy and removing alcohol. Mom refused therapy and proposed leaving OP the house but taking her sister. The argument escalated, and OP said, \"Do you want to lose another kid?\" Now OP wonders if she was disrespectful. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 26,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-15T05:12:14.187184"
    },
    {
        "id": "1kmaiyk",
        "title": "AITA for refusing to answer my friend’s messages after she accused my mom of cheating?",
        "url": "/r/AmItheAsshole/comments/1kmaiyk/aita_for_refusing_to_answer_my_friends_messages/",
        "body_summary": "OP, SE Asian with pale skin, is avoiding his friend after she suggested his mom had a relationship with a Caucasian man due to his complexion, despite his denial of this explanation. She called him petty for avoiding her. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 38,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 39
        },
        "total_judged": 39,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-15T05:12:15.239575"
    },
    {
        "id": "1kmq8pf",
        "title": "WIBTA If I choose to not attend my (29F) friend's (29F) wedding in 3 days despite being a bridesmaid?",
        "url": "/r/AmItheAsshole/comments/1kmq8pf/wibta_if_i_choose_to_not_attend_my_29f_friends/",
        "body_summary": "OP, a bridesmaid, faces deployment shortly after the wedding. She can't stay the night before due to back issues and wanting time with family. The bride demands she either stay or step down from the bridal party. OP asks if skipping the wedding would make her TA.\n...",
        "reddit_judgments": {
            "YTA": 23,
            "NTA": 43,
            "ESH": 7,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 79
        },
        "total_judged": 79,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-15T05:12:18.163602"
    },
    {
        "id": "1kmhx27",
        "title": "AITA for accusing my MIL and FIL of being racist?",
        "url": "/r/AmItheAsshole/comments/1kmhx27/aita_for_accusing_my_mil_and_fil_of_being_racist/",
        "body_summary": "OP's in-laws showed up unannounced, blaming her for her husband's estrangement after they skipped their wedding (held in OP's home country). They accused OP of influencing him and revealed their dislike stems from her nationality and religion. OP accused them of racism. AITA?\n...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 26,
            "ESH": 0,
            "NAH": 0,
            "INFO": 7,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-15T05:12:19.825633"
    }
]