[
    {
        "id": "1n7ciex",
        "title": "AITA for refusing to leave my apartment for a day because of my muslim roommate’s conservative mom?",
        "url": "/r/AmItheAsshole/comments/1n7ciex/aita_for_refusing_to_leave_my_apartment_for_a_day/",
        "body_summary": "OP's (M) Muslim roommate, Sana, asked him to leave their apartment for a day during her mother's visit due to her mother's disapproval of men living with women. OP refused, citing a major assignment and paying equal rent, but offered to stay in his room all day. Sana insisted he leave. OP asks AITA for not complying with Sana's request. He later edited the post and said he will be leaving after receiving many comments.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 143,
            "ESH": 0,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 148
        },
        "total_judged": 148,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-04T05:10:18.685273"
    },
    {
        "id": "1n7bzl8",
        "title": "AITA - For saying “I’m sorry to hear that.”?",
        "url": "/r/AmItheAsshole/comments/1n7bzl8/aita_for_saying_im_sorry_to_hear_that/",
        "body_summary": "OP (35M) planned a wine tour/dinner. A friend (30F) canceled last minute due to illness. OP said \"get some rest,\" but she now ghosts him, finding his message callous. OP asks if he's the asshole for not rescheduling the event, which he finds unreasonable.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 90,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 93
        },
        "total_judged": 93,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-04T05:10:20.909341"
    },
    {
        "id": "1n76vyc",
        "title": "AITA for the way I ate at a buffet?",
        "url": "/r/AmItheAsshole/comments/1n76vyc/aita_for_the_way_i_ate_at_a_buffet/",
        "body_summary": "I(18m) recently got into law school and am now an LLB(Bachelor of Laws) student. My parents decided to take me to a special lunch at a buffet as a reward. My aunts, uncle and cousins were also there. My uncle gave me a labor law textbook as a gift.\n\nNow I usually don’t eat a lot for lunch. I actually used to skip the meal or have just a banana to save money to buy books. But this was a buffet and they had some really nice dishes. I sampled many things and ended up wolfing down forty pieces of sashimi(I know because I went to the counter five times and got eight pieces each time).\n\nMy dad didn’t say anything but my mom later told me I embarrassed her by eating like a starving kid. That the amount I ate made it look like she didn’t feed me enough. She was very upset about it.",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 123,
            "ESH": 0,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 129
        },
        "total_judged": 129,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-04T05:10:22.623150"
    },
    {
        "id": "1n7b9ms",
        "title": "AITA for warning a family?",
        "url": "/r/AmItheAsshole/comments/1n7b9ms/aita_for_warning_a_family/",
        "body_summary": "OP warned a family with young kids about jellyfish while snorkeling. The kids got scared & refused to swim, upsetting the parents who blamed OP. Partner thinks OP should've stayed quiet. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 67,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-04T05:10:23.976304"
    },
    {
        "id": "1n7n2l4",
        "title": "AITA for hiding my food from my housemate’s partner?",
        "url": "/r/AmItheAsshole/comments/1n7n2l4/aita_for_hiding_my_food_from_my_housemates_partner/",
        "body_summary": "My housemate and I share a flat. We share stuff like salt, pepper, and spices, but otherwise our food is separate, and we each have our own shelves in the cupboard.\n\nEvery time my housemate’s partner comes over, they cook a huge meal… often using all my fancy stuff like soy sauce and sesame oil (never offering me any of what they made). They also don’t really clean up after themselves, but that’s a whole other story.\n\nLately, I’ve started hiding some of my food on the higher shelves (I’m tall, so I can reach it easily) so it’s not so easy for them to grab. They’ve noticed and have been a bit off with me ever since.  \n  \nAITA for doing this, or am I just protecting my groceries?",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 44,
            "ESH": 0,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-04T05:10:25.010516"
    },
    {
        "id": "1n7x2kn",
        "title": "AITA my fish is missing and my parents immediately went nuclear",
        "url": "/r/AmItheAsshole/comments/1n7x2kn/aita_my_fish_is_missing_and_my_parents/",
        "body_summary": "OP's fish disappeared after her parents pet-sat. Parents found a dead rat, but deny anything happened to the fish. Dad exploded when questioned. Mom called OP rude for implying she lied. AITA for pressing the issue?\n...",
        "reddit_judgments": {
            "YTA": 16,
            "NTA": 7,
            "ESH": 2,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-09-04T05:10:27.134027"
    },
    {
        "id": "1n7dqxj",
        "title": "AITA Found tackle box and returns it to be called a thief",
        "url": "/r/AmItheAsshole/comments/1n7dqxj/aita_found_tackle_box_and_returns_it_to_be_called/",
        "body_summary": "I live in a neighborhood where we have several common areas and one has a boat ramp. Unfortunately we deal with alot of trespassing, so things have gone missing from time to time. On Labor Day I was on my way home when I noticed a tackle box sitting in the boat ramp,  not wanting a trespasser to come along and take it if it was a residents I turned around in my driveway and I picked it up and looked around for anyone in the are after seeing no one I  immediately posted to the neighborhood page, a few days later the owners posted in the facebook group saying I had stolen from their disabled nephew. I even put a few extra of my own baits in the tackle box once I knew where to return it yet they’ve still been nasty to me. ",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 28,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-04T05:10:27.784712"
    },
    {
        "id": "1n7eppg",
        "title": "AITA for getting my fiancé throat lozenges and not cough sweets",
        "url": "/r/AmItheAsshole/comments/1n7eppg/aita_for_getting_my_fiancé_throat_lozenges_and/",
        "body_summary": "OP bought Strepsils for her fiancé's cough, thinking it would soothe his throat. He's angry, calling it a waste of money and accusing her of not thinking. OP apologized for assuming he had a sore throat, but he remains upset. AITA for buying the \"wrong\" cough remedy?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 92,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 95
        },
        "total_judged": 95,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-04T05:10:30.117250"
    },
    {
        "id": "1n7y1l8",
        "title": "AITA for not letting my roommate’s boyfriend used my bed when I was out of town?",
        "url": "/r/AmItheAsshole/comments/1n7y1l8/aita_for_not_letting_my_roommates_boyfriend_used/",
        "body_summary": "OP's roommate's boyfriend slept in her bed while she was away despite her stated boundaries. Roommate dismisses OP's anger, suggesting she's uptight. OP threatened to report the issue to housing if it happens again. AITA for not allowing the boyfriend in her bed?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 48,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-04T05:10:31.645921"
    },
    {
        "id": "1n7zar4",
        "title": "AITA for changing the Disney+ account password after my roommate’s boyfriend kept using my account?",
        "url": "/r/AmItheAsshole/comments/1n7zar4/aita_for_changing_the_disney_account_password/",
        "body_summary": "OP's roommate's boyfriend used OP's Disney+ account (paid for solely by OP) without permission. OP asked the roommate to have him stop, but she refused. OP changed the password. Roommate is angry. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 28,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-04T05:10:32.938373"
    }
]