[
    {
        "id": "1jy1gx5",
        "title": "AITA if i give my ex husband clothes that don't fit our kids?",
        "url": "/r/AmItheAsshole/comments/1jy1gx5/aita_if_i_give_my_ex_husband_clothes_that_dont/",
        "body_summary": "OP, with full custody and no child support, argued with her ex about packing clothes for his visits. He claimed she owed him clothes from their separation. OP then gave him old, outgrown clothes. He's angry. AITA?\n...",
        "reddit_judgments": {
            "YTA": 18,
            "NTA": 69,
            "ESH": 19,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-14T05:12:04.841114"
    },
    {
        "id": "1jy0cxk",
        "title": "AITA for breaking the News that my FIL is not ever going to be cancer free again?",
        "url": "/r/AmItheAsshole/comments/1jy0cxk/aita_for_breaking_the_news_that_my_fil_is_not/",
        "body_summary": "OP's FIL has chronic cancer. Family keeps telling him to rest until he's \"better\", but he'll never be cancer-free. This upsets him. OP told the family they were asking him to stop living. They acted surprised. AITA for reminding them of the diagnosis?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 74,
            "ESH": 1,
            "NAH": 3,
            "INFO": 4,
            "TotalJudged": 83
        },
        "total_judged": 83,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-14T05:12:06.998866"
    },
    {
        "id": "1jyggrl",
        "title": "AITA for not telling my friend that the “volunteer gig” he flaked on was actually paid?",
        "url": "/r/AmItheAsshole/comments/1jyggrl/aita_for_not_telling_my_friend_that_the_volunteer/",
        "body_summary": "OP volunteered at a tech event, telling Ryan about it. Ryan declined due to no pay. OP later learned it paid $300 and didn't tell Ryan. Ryan saw OP's IG post about the stipend, got angry, and accused OP of being shady and setting him up. AITA?\n...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 104,
            "ESH": 3,
            "NAH": 1,
            "INFO": 7,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-14T05:12:08.796514"
    },
    {
        "id": "1jyksrp",
        "title": "AITA for yelling at a 19 year old and asking for him to be fired?",
        "url": "/r/AmItheAsshole/comments/1jyksrp/aita_for_yelling_at_a_19_year_old_and_asking_for/",
        "body_summary": "OP confronted Joe, husband's employee, after he called OP \"Fenian f---t.\" OP finds Joe's jokes inappropriate. Husband thinks OP overreacted. AITA?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 135,
            "ESH": 11,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 152
        },
        "total_judged": 152,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-14T05:12:11.526368"
    },
    {
        "id": "1jycbdz",
        "title": "AITA for shouting at kids for entering my home?",
        "url": "/r/AmItheAsshole/comments/1jycbdz/aita_for_shouting_at_kids_for_entering_my_home/",
        "body_summary": "My partner (34F) and I (29M) were sat in our living room at about 5pm with the front door behind us. I heard the handle go so I turned around and saw the door fly open.\nWithout thinking I jumped over the sofa and ran out on the road to see a group of kids running away. I shouted \"don't open my f***ing door, DO ONE!\"\n\nWhen I got back in the house, my partner told me that they're just kids, it was a cowardly way to act and I wouldn't have done it, had it been adults.\n\nI responded that if it were adults I would've done whatever it took to protect our home. That i chose not to chase them because they were kids, but I couldn't just say nothing to this violation in privacy.\n\nWas my reaction really out of line?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 79,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 80
        },
        "total_judged": 80,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-14T05:12:12.727215"
    },
    {
        "id": "1jyhd1k",
        "title": "AITA because we won’t let anyone live with us?",
        "url": "/r/AmItheAsshole/comments/1jyhd1k/aita_because_we_wont_let_anyone_live_with_us/",
        "body_summary": "OP & husband have a large, child-free home and made a \"no long-term guests\" rule after a bad experience. Family/friends keep asking to move in due to financial issues, homelessness, etc. OP keeps saying no, and is tired of the requests. AITA for refusing?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 70,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 75
        },
        "total_judged": 75,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-14T05:12:14.097546"
    },
    {
        "id": "1jyomee",
        "title": "AITA for telling my wife if she keeps excluding our oldest I’m going to take the locks off the doors",
        "url": "/r/AmItheAsshole/comments/1jyomee/aita_for_telling_my_wife_if_she_keeps_excluding/",
        "body_summary": "Wife (autistic) favors autistic daughter, excluding energetic older daughter. OP told wife to include older daughter or he'd remove locks & stop DoorDash. Wife left with younger daughter. AITA for the ultimatum?\n...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 76,
            "ESH": 30,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 123
        },
        "total_judged": 123,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-14T05:12:18.327698"
    },
    {
        "id": "1jyei67",
        "title": "AITA because I wouldn't put my step dad on my child's emergency contacts",
        "url": "/r/AmItheAsshole/comments/1jyei67/aita_because_i_wouldnt_put_my_step_dad_on_my/",
        "body_summary": "OP's stepdad was allegedly abusive. Now, OP's mom's partner criticized OP for wedding plans. Then, Mom was drunk while babysitting. Finally, Mom threatened to cut contact after learning stepdad wasn't an emergency contact for OP's child. AITA?\n...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 36,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 43
        },
        "total_judged": 43,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-14T05:12:19.515789"
    },
    {
        "id": "1jy75t5",
        "title": "AITA for leaving a party early because no one was talking to me?",
        "url": "/r/AmItheAsshole/comments/1jy75t5/aita_for_leaving_a_party_early_because_no_one_was/",
        "body_summary": "My friend invited me to her boyfriend’s birthday party. I don’t really know him well, but I wanted to support her, so I went just because I like her. I showed up on time, brought a gift, and tried to make conversation, but most people already knew each other and were sticking to their own groups, I barely knew any of those people. My friend was busy hosting and didn’t really have time to talk. After about an hour of sitting there pretty much by myself and drinking, with only a few polite exchanges, I decided to leave. I messaged her later that evening to wish her a good night, but she responded saying she was disappointed I “bailed so early” and that it seemed like I didn’t want to be there. Now I’m wondering if I really did something wrong.\n\nAITA?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 37,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-14T05:12:19.930440"
    },
    {
        "id": "1jy0k66",
        "title": "AITA for saying my MIL can't stop by the house she bought us?",
        "url": "/r/AmItheAsshole/comments/1jy0k66/aita_for_saying_my_mil_cant_stop_by_the_house_she/",
        "body_summary": "MIL bought OP & husband a house across the street. MIL made a cash offer without consulting OP. OP is independent and uncomfortable with MIL's actions, especially unannounced visits. Husband is stuck in the middle. AITA for setting boundaries against unannounced visits to \"their\" (deed is in OPs name) house?\n...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 47,
            "ESH": 20,
            "NAH": 3,
            "INFO": 3,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-14T05:12:22.301035"
    }
]