[
    {
        "id": "1qumqz5",
        "title": "AITA for avoiding my bf’s mom after she called me a bitch",
        "url": "/r/AmItheAsshole/comments/1qumqz5/aita_for_avoiding_my_bfs_mom_after_she_called_me/",
        "body_summary": "My bf’s family gets together a lot for meals, we got invited to his family cookout and I don’t eat beef (it’s just a preference) but I offered to bring something for myself so they wouldn’t have to go out of their way to feed me, and I still wanted to go and join my bf’s family as they’re still getting to know me, I showed up to the cookout.\n\nas soon as I sat down my bf’s mom walked up to me and said “why don’t you eat beef?” And I said it just was a preference and it is harder for me to eat, and she said “okay I guess we will have to stop calling you a bitch now, we all were talking about how you won’t come to any future family events cause you don’t eat beef and thought you were bitchy” I was so shocked to have this said so directly to me with a straight face… it wasn’t even jokingly and...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 113,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 117
        },
        "total_judged": 117,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-04T05:40:51.802076"
    },
    {
        "id": "1qv3sjf",
        "title": "AITA. Boyfriend thought he was entitled to 100% of the sales price of a part that was thrown in on a purchase I made.",
        "url": "/r/AmItheAsshole/comments/1qv3sjf/aita_boyfriend_thought_he_was_entitled_to_100_of/",
        "body_summary": "Hi there!  This happened more than 10 years ago, but I've always wondered who was right.  I (female) bought a used motorcycle with my own money and my boyfriend at the time went with me to check it out.  As we were talking to the seller, she mentioned that she had recently upgraded the pipes.  My boyfriend asked if she still had the old pipes.  She did.  So he asked her if she would include the pipes in the purchase.  She agreed!  So when I paid several thousand dollars in cash for the motorcycle, it also came with a spare set of pipes worth a few hundred dollars.\n\nMy boyfriend took the pipes home and started taking pictures of them to put them for sale on Craigslist.  I said that was good thinking on his part to ask for the pipes and that I would be happy to give him a cut of the sale.  H...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 100,
            "ESH": 1,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 114
        },
        "total_judged": 114,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-04T05:41:00.994415"
    },
    {
        "id": "1qv7c3b",
        "title": "AITA for asking my brother not to bring a cam girl as his plus-one to my wedding",
        "url": "/r/AmItheAsshole/comments/1qv7c3b/aita_for_asking_my_brother_not_to_bring_a_cam/",
        "body_summary": "I (F29) am getting married in April. The wedding is a bit short notice as my fiancé only proposed in December, but we chose April as we got a really good price for our dream wedding venue. We are offering plus-ones for our single guests.\n\nMy brother Fran (M27) is single and took us up on the plus-one offer. He wants to bring a girl, Dani (F26).  Dani is a cam girl and Fran is a client of hers. Fran sometimes pays her to meet up in person and go on dates, and my wedding would be one of those times. I only know about the nature of their relationship because Fran started this while living with our parents and they eventually found out. \n\nI've only met Dani a few times, once when Fran brought her to our aunt's potluck baby shower. I feel like Dani's behavior during this event was really inappr...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 144,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 150
        },
        "total_judged": 150,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-04T05:41:11.064112"
    },
    {
        "id": "1qupio1",
        "title": "AITAH for setting a boundary and refusing to drive my partner’s sister home?",
        "url": "/r/AmItheAsshole/comments/1qupio1/aitah_for_setting_a_boundary_and_refusing_to/",
        "body_summary": "So I (26NB) am the only person currently in my immediate surrounding with a car and license. My partner’s (30M) sister (25F) currently doesn’t have a car. Her last car was impounded for fines she didn’t pay. (For context, i’m not leaving someone incapable of driving, FAaFO.) Anyways, she asked me to bring her into town a couple days ago to get groceries. I don’t mind helping where it counts, but there’s a limit. The long and short is she asked me if I could help her friends who were stranded first. She gave me a town name, which was just under an hour from my location. So, I agree, given i’ll be compensated; and the friends are chill. Apparently as i’m driving and we’re almost to said town, she says it’s actually a different town. She claimed she didn’t know, but that’s on her to communica...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 41,
            "ESH": 2,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-04T05:41:18.642077"
    },
    {
        "id": "1qukcv1",
        "title": "AITA for not letting my neighbors son (who I’ve never met)connect to my WIFI?",
        "url": "/r/AmItheAsshole/comments/1qukcv1/aita_for_not_letting_my_neighbors_son_who_ive/",
        "body_summary": "I was away from home earlier today and I got a ring notification that someone was at my door. I answered and he said “hey I live next door, my WIFI is out and I’m trying to finish my homework for school, can I access your WIFI to do my homework?” He looked to be in high school or older and I have never met or talked to him before. I told him no and said sorry. \n\nAs he walked away he was taking to himself saying he just wanted to do his homework and went back next door. I actually felt bad for not helping the kid out if it was a legitimate need. Currently I’m not working and my internet is something I make sure I pay so I can use it for job searches and obviously entertainment.\n\nHonestly I’m not comfortable giving out my password to someone I don’t know to use my internet. Also would he con...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 48,
            "ESH": 0,
            "NAH": 9,
            "INFO": 0,
            "TotalJudged": 60
        },
        "total_judged": 60,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-04T05:41:26.476049"
    },
    {
        "id": "1quun8a",
        "title": "AITAH for Calling my Brother a “Demonic Child”",
        "url": "/r/AmItheAsshole/comments/1quun8a/aitah_for_calling_my_brother_a_demonic_child/",
        "body_summary": "This happened last night, and I’ve found I like getting insight from random Redditers. So I can tell if I’m being gaslit or not by family.\n\nMy brother (16m) has never been super nice to me (18f). I do not care, he’s the “baby“.\n\nMy dog (10f) has been acting odd. won’t go down the stairs, our German shepherd attacked her, our Pomeranian is being more caring towards her, etc.\n\nYesterday when we were sitting on the couch I found a big lump on her stomach. I barely touched it and she yelped and started shaking. I’m pretty sure it’s a cyst or a tumor. I realized then that I have not taken any videos or pictures of her in over a month. if she was going to be gone soon I wanted some more recent videos and pictures to remember her by.\n\nMy brother made fun of this saying “haha, ”my name” is trying ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 47,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-04T05:41:34.403504"
    },
    {
        "id": "1qv8b1k",
        "title": "AITA if I ask to order à la carte instead of paying $80 for a set menu at my friend’s birthday?",
        "url": "/r/AmItheAsshole/comments/1qv8b1k/aita_if_i_ask_to_order_à_la_carte_instead_of/",
        "body_summary": "I (30F) live in city A and my best friend (29F) lives in city B. She invited me to her 30th birthday dinner with a month’s notice, but I was happy to attend as this is a milestone birthday. I booked a 4-hour train ride ($70), and bought a birthday gift ($130). All of this was within my planned budget. \n\nOriginally, the dinner was booked at a Thai restaurant where everyone orders their own plate. But then, a day or so after the restaurant was communicated, she changed the venue to a Japanese izakaya. The dinner is now a group booking with a set menu of shared tapas for the table, costing $80 per person (tax & gratuity are included, drinks are not). The dinner is also @8 p.m. meaning I’ll be killing time in the city for most of the day. \n\nNow, I have dietary restrictions after going through ...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 16,
            "ESH": 1,
            "NAH": 9,
            "INFO": 0,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-04T05:41:42.177553"
    },
    {
        "id": "1qvd9nb",
        "title": "AITA for telling my girlfriend that her clothes aren't shrinking, she's gaining weight?",
        "url": "/r/AmItheAsshole/comments/1qvd9nb/aita_for_telling_my_girlfriend_that_her_clothes/",
        "body_summary": "I've been with my girlfriend since around September. Her body has changed a lot since then, and for awhile she was losing weight, but in December she started to gain weight again. She's been claiming that the dryer keeps shrinking her clothes, and she's in complete denial that she's actually just gaining weight. I thought she was just making excuses to me about it, so I told her that it's okay if she's gaining weight and she doesn't need to blame it on her clothes. This really set her off and she said I was calling her fat and now her and her whole group of friends think I'm an asshole when I was just trying to be supportive and leting her know I dont care what size she is",
        "reddit_judgments": {
            "YTA": 18,
            "NTA": 43,
            "ESH": 1,
            "NAH": 7,
            "INFO": 1,
            "TotalJudged": 70
        },
        "total_judged": 70,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-04T05:41:43.481701"
    },
    {
        "id": "1qvbzrw",
        "title": "AITA: My sister left a dog here for 3 months and I gave him to someone else",
        "url": "/r/AmItheAsshole/comments/1qvbzrw/aita_my_sister_left_a_dog_here_for_3_months_and_i/",
        "body_summary": "Ok, hit me with a reality check.\n\nMy 32-year-old sister is an addict with a history of not just animal abuse and neglect, but even her own children that are currently in the custody of my terminally ill mother. \n\n6 months ago, I let her come and stay with me and within two weeks she brought in a large breed puppy without permission. For the next 3 months she was here, my husband and I were horrified at the way she did this dog. She would lock him in a cage all day and one time we caught her, tying him to a post with less than 2 feet of slack to move. \n\nIn November, she went on a bender and disappeared for four days and when she came back, she and her boyfriend had made a decision that she needed to move away to stay sober so upstate they went, and they manipulated my husband into saying th...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 57,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-04T05:41:51.110650"
    },
    {
        "id": "1qusc0u",
        "title": "AITA for bringing my dog to the dog park?",
        "url": "/r/AmItheAsshole/comments/1qusc0u/aita_for_bringing_my_dog_to_the_dog_park/",
        "body_summary": "My dog isn't overly defense or aggressive, but he does get anxious around crowds and lots of dogs. He's medium size, 40 lbs, well socialized, and spends two days a week in day care playing with other dogs his size or larger.\n\nI take my dog to the dog park because even though he gets nervous around large groups of dogs, he does just fine when it's not crowded. He's gentle, playful, and has no bite history.\n\nLast weekend I took him to our favorite dog park. Only 4 other dogs there: two labs, an aussie shep mix, and a ginormous Anatolian shep mix. This was a big boi. He was LORGE. Around 120 lbs. I let the dogs sniff each other through the fence first before letting him in. All seems well. Then I unleash my dog and let him inside. \n\nThere's 20 seconds of \"let's all go sniff the new guy\" then ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 45,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-04T05:41:59.962038"
    }
]