[
    {
        "id": "1p6kqld",
        "title": "WIBTA for refusing to bring $100 minimum to Thanksgiving",
        "url": "/r/AmItheAsshole/comments/1p6kqld/wibta_for_refusing_to_bring_100_minimum_to/",
        "body_summary": "My family and I celebrate Thanksgiving every year with my siblings, parents, and their kids. Roughly 20-25 people (including kids). My family is only 2 people with one 6 month old baby.\n\nIn the group chat it was decided that my nephew would cook meat since he bought a grill. He also told us that we could bring the sides. He chose to spend $300 on meat.\n\nI messaged in the group chat that we would bring mashed potatoes. My sister responding that every \"family\" has to bring $100 worth of food minimum or help my nephew pay for the meat.\n\nI'm not totally against the idea of bringing that much food, but just the way it was presented and the fact that it wasn't agreed to beforehand makes me upset.\n\nThe following day in the group chat, my sister said: \"Option 1: bring food enough for everyone, not...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 112,
            "ESH": 1,
            "NAH": 1,
            "INFO": 7,
            "TotalJudged": 122
        },
        "total_judged": 122,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-26T05:12:26.876871"
    },
    {
        "id": "1p667d3",
        "title": "AITA for telling my sister that if she needs this much handholding I won’t have her babysit anymore",
        "url": "/r/AmItheAsshole/comments/1p667d3/aita_for_telling_my_sister_that_if_she_needs_this/",
        "body_summary": "I am very good friends with the woman across the hall from me. She’s a single mom to 2 kids (2 and 6) and I help her a lot with the kids. She handles school and daycare drop off, I do pick up and extracurricular activities, dinner’s a solid 60% her, 20% me, 20% restaurants. When school and daycare are closed, I’m typically the one that stays home with them because my schedule is more flexible. I do get paid for my help with the kids but I charge her below market rate for babysitting. \n\nThe older one is out of school all week. I also have the week off so I’m mostly home with him but earlier today I had a dentist appointment so I left my sister (18) with him for 2 hours. \n\nI left instructions saying that he needed to read for 15 minutes, could have 30 minutes of screen time, a list of things...",
        "reddit_judgments": {
            "YTA": 67,
            "NTA": 37,
            "ESH": 11,
            "NAH": 11,
            "INFO": 7,
            "TotalJudged": 133
        },
        "total_judged": 133,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-26T05:12:45.084262"
    },
    {
        "id": "1p6hdqx",
        "title": "AITA for telling my bil I'll be on a see food diet",
        "url": "/r/AmItheAsshole/comments/1p6hdqx/aita_for_telling_my_bil_ill_be_on_a_see_food_diet/",
        "body_summary": "For context, I'm super pregnant right now. My husband (29M) and I (26F) have another child who is almost 3. I didn't have a positive breastfeeding experience with her, I'm determined to have a better experience with our 2nd. His brother, my bil (30M) is a chronic yo-yo dieter. I personally think it's annoying because he tries to get everyone else around him to try it. I've always politely said no thanks. My husband has told him several times to stop bringing it up to me, but he's sneaky, and will ask when my husband is not in the room. I've just brushed it off as he's insecure.\n\nThere was one day when he and their sister (34F) were at our house and my husband had to use the bathroom. Bil asked me if I had done any research on how to loose weight when I have the baby. I had to take a deep b...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 71,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-26T05:13:01.062009"
    },
    {
        "id": "1p6jjdt",
        "title": "AITA for not being more discreet at the store for my son?",
        "url": "/r/AmItheAsshole/comments/1p6jjdt/aita_for_not_being_more_discreet_at_the_store_for/",
        "body_summary": "My son 9m is upset with me right now for an incident that happened yesterday at the store. Yesterday we were at the store to stock up on groceries, it was me 37f, my son 9m and daughter 7f.\n\nMy son still wets the bed and wears  Goodnites ( big kid pull ups for bedwetting) for it and we went and got those first like we always do so we can hide them underneath other stuff. It went pretty good for most of the trip but there was an issue when we got to checkout. \n\nI was unloading the last of the groceries when I heard him say in a kinda worried voice \" no mom please stop \", but i had already put his Goodnites on the belt. I asked him what was wrong, he pointed out that his friend was at the store with her parents and might see us and he didn't want her to see his Goodnites.  \n\nI said it would ...",
        "reddit_judgments": {
            "YTA": 49,
            "NTA": 35,
            "ESH": 2,
            "NAH": 37,
            "INFO": 5,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-11-26T05:13:19.169907"
    },
    {
        "id": "1p6hfq1",
        "title": "AITA for telling my wife she should take the car if she wants alone time instead of asking me to leave the house with our kids?",
        "url": "/r/AmItheAsshole/comments/1p6hfq1/aita_for_telling_my_wife_she_should_take_the_car/",
        "body_summary": "\n\n\n\nMy wife works from home part-time (2–3 days a week) and is the main at-home parent to our two kids. We live in a tiny apartment with very thin walls so I understand that it’s overwhelming and she’s always been a very introverted person who needs more alone time than most people.\n\n\n\n1-2 times a week I take the kids out for an hour or two so she can have the house to herself. She really appreciates it. The issue is that now she wants this every day, for longer and wants me to drop whatever I’m doing to take the kids out whenever she needs space.\n\n\n\nI’ve obliged several times when she’s been explicitly asking for it even when it was inconvenient for me, but I’ve started feeling taken advantage of. I also work full-time outside the house Monday–Friday, so the home is my decompression space...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 80,
            "ESH": 12,
            "NAH": 20,
            "INFO": 4,
            "TotalJudged": 122
        },
        "total_judged": 122,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-26T05:13:36.556759"
    },
    {
        "id": "1p6660p",
        "title": "AITA- F (49) telling a stranger (M 50+)to stop trying to bully me and the passenger next to me?",
        "url": "/r/AmItheAsshole/comments/1p6660p/aita_f_49_telling_a_stranger_m_50to_stop_trying/",
        "body_summary": "Sitting in BC on a flight to YYZ from YVR. Overhead bin space is allocated above our  seats and a little tricky. Had to finesse my carry on flat not sideways (Lower height bins) and my seat mate looked up from her laptop and laughed with me as I took a moment to figure it out and said she had the same issue. It was sorted i closed the full bin and settled in for our flight. A man and a woman come rushing into the flight just after last call, and he’s huffing and complaining under his breath. He has 2x carry on’s and a huge backpack and starts opening bins left and right and tries to stuff his bags wherever he can. Then he opens ours and yells at us and says we did it wrong and that obviously we don’t know a thing about loading bags … and pulls out our luggage, puts his in and tries to  stu...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 31,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-26T05:13:52.163174"
    },
    {
        "id": "1p6uhxn",
        "title": "AITA for basically kicking my husband’s cousin out because my husband refuses to \"embarrass\" him?",
        "url": "/r/AmItheAsshole/comments/1p6uhxn/aita_for_basically_kicking_my_husbands_cousin_out/",
        "body_summary": "AITA? I feel like I’m taking crazy pills here so I need an outside perspective because my husband is making me feel like a controlling monster.\n\nI (26f) and my husband (33m) have two kids, a 4yo boy and a 1yo girl. We do okay money-wise, nice house, suburbs, etc. My husband works crazy hours in finance so he’s gone most of the day. I work from home as a project manager. People seem to think \"work from home\" means \"I sit around watching Netflix,\" but I am actually working. It’s stressful.\n\nTwo months ago husband’s cousin \"Greg\" (27m) moved in. He lost his job/apartment and needed a place to crash to get back on his feet. I said yes because I honestly thought, hey, another adult around might help? Maybe he can watch the baby while I pee?\n\nHuge mistake.\n\nGreg is basically a phantom teenager. ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 81,
            "ESH": 8,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 93
        },
        "total_judged": 93,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-26T05:14:08.316003"
    },
    {
        "id": "1p64v3k",
        "title": "WIBTA for telling my dad to pick between me and his wife?",
        "url": "/r/AmItheAsshole/comments/1p64v3k/wibta_for_telling_my_dad_to_pick_between_me_and/",
        "body_summary": "I (18f) haven't seen my dad since I was 3. He had me at a young age and I was taken away from him. I spent my entire life building up this image of him and fantasizing that he would come rescue me from my home. (I grew up in a very abusive house and got removed at age 14). From age 12 to 17, I searched all over the internet trying to find him, but I didn't know anything about him so it was pointless. Eventually, after years and years of searching, at age 17 I found him. It was a sweet and tear filled virtual reunion. He told me how much he missed me and how much he loves me. All was well until the first time I asked to meet him in person. He told me something about his wife being the reason he can't. It has been over a year since that time, and I asked him if he would meet up with me for m...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 24,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 24
        },
        "total_judged": 24,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-26T05:14:23.971658"
    },
    {
        "id": "1p6oqeo",
        "title": "AITA for not holding a baby",
        "url": "/r/AmItheAsshole/comments/1p6oqeo/aita_for_not_holding_a_baby/",
        "body_summary": "Family from all over came to visit for the holidays. My partner‘s brother in law asked me if I wanted to hold his baby. I said no. He then asked if I would be willing to hold the baby. I said that I am not willing Then he asked if I would hold the baby so he could unload the dishwasher. I gestured to the baby’s uncle, my partner, who took the baby. \n\n  \nPeople told me that was rude, but I did not want to hold the baby. I was in the middle of doing something for work. I’m not a free babysitter just because I’m a woman. If he needed help, he should have asked for it. The baby is also old enough to just be left to run around too. No one needed to hold them. ",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 22,
            "ESH": 2,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 29
        },
        "total_judged": 29,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-26T05:14:24.726390"
    },
    {
        "id": "1p6nze0",
        "title": "AITA for refusing to redo a project for my group after they ignored everything I contributed?",
        "url": "/r/AmItheAsshole/comments/1p6nze0/aita_for_refusing_to_redo_a_project_for_my_group/",
        "body_summary": "Hi so I’m 19 and freshly in uni, I have a pretty good passion towards my major so I don’t mind working on it. We had a huge group assignment worth a chunk of our grade. Our lecturer told us clearly that everyone had to contribute fairly and that the group was going to be marked as a whole. The groups were random and I ended up in a group with 3 others I didn’t know, at first everything was okay for the first week or so.\n\nWe made a plan, divided the sections, and set the dead lines for the assignment. I finished my part early and I sent it to the group chat asking if Anyone wanted edits or changes to be made in case they weren’t happy with it. Nobody ended up replying after 2 days so I assumed everything was okay and I shifted my focus to my other courses.\n\nA week later when we met up to co...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 36,
            "ESH": 0,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-26T05:14:40.416955"
    }
]