[
    {
        "id": "1pd6r8v",
        "title": "AITA for not making my twin girls sit together at lunch because I find it unfair to one of them",
        "url": "/r/AmItheAsshole/comments/1pd6r8v/aita_for_not_making_my_twin_girls_sit_together_at/",
        "body_summary": "edit: sara is in clubs and already talks to a counselor, who basicallly gave the same advice of put herself out there\n\nthe friend group fell apart because of boy drama\n\nedit2: people keep asking why she doesn’t want Sara to join. The answer is she doesn’t want to be the twin package anymore. She wants her own friend, she wants to be independent.\n\ni can’t force them to sit together because that would make resentment. I can give a conversation about empathy witch i will do but it will not be a guilt trip becuase she Is allowed to say no to sitting with someone.\n\nMaybe sit with her once and while at lunch would be good. Not all siblings are best friends and people treating them as the as a package  is the reason they are not close to begin with\n\n———————\n\nThis is about my two girls ( twins) th...",
        "reddit_judgments": {
            "YTA": 28,
            "NTA": 64,
            "ESH": 8,
            "NAH": 36,
            "INFO": 3,
            "TotalJudged": 139
        },
        "total_judged": 139,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-04T05:12:53.225268"
    },
    {
        "id": "1pdbe5w",
        "title": "WIBTA if I ask my husband to stop cooking breakfast?",
        "url": "/r/AmItheAsshole/comments/1pdbe5w/wibta_if_i_ask_my_husband_to_stop_cooking/",
        "body_summary": "My (31F) Husband (34M) is a creature of habit and has made himself the same breakfast every single morning for the 10 years that we have been together: a tofu scramble with various veggies made on the cast iron skillet. For years I would barely notice his cooking in the morning, however a couple years ago he started getting distracted while cooking and would walk out of the room to sit down at his computer and start thinking about work for the day. He will claim that the stove is off or on super low, but the result is that almost every single morning the food smells like burnt oil and just awful. I find the smell to be revolting and on a few occasions have had coughing fits from smoke in the air. He usually disagrees and says that there isn't any smoke in the air.\n\nAt present, a couple of ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 115,
            "ESH": 0,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 120
        },
        "total_judged": 120,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-04T05:13:11.173756"
    },
    {
        "id": "1pcx98k",
        "title": "AITAH for leaving the movies after being lied to?",
        "url": "/r/AmItheAsshole/comments/1pcx98k/aitah_for_leaving_the_movies_after_being_lied_to/",
        "body_summary": "I was enjoying a nice night out with my friends or so i thought. it started out with five of us going to this event in our town, while we were there one of my \"friends\" bf joins us halfway through the event.\n\nwe were all having a good time and had later plans to go and watch this new movie in the theatre. we left the event and decided to go get dinner at a restaurant. while we were there i noticed that my friend's bf was texting someone on his phone and smiling and my friend then looked at his phone and got a bit visibly upset, REMEMBER THIS bc this is important.\n\ndinner ended and we all made our way to the movies where we all purchased our tickets. we all picked our seats and made it into the theatre, i went to go sit in the seat that i paid for when one of my friends says \"oh this seat i...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 31,
            "ESH": 9,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-04T05:13:27.383126"
    },
    {
        "id": "1pd4u9k",
        "title": "AITA for accusing a friend of purposefully trying to upstage every bride, including me?",
        "url": "/r/AmItheAsshole/comments/1pd4u9k/aita_for_accusing_a_friend_of_purposefully_trying/",
        "body_summary": "Hi all, \n\nGenuinely curious if I am in the wrong here and should have kept my mouth shut. Some context:\n\nMy (ex) best friend from high school, let's call her Sally (currently 39F), has always been a bit of a show-off. She's a beautiful woman who pursued a musical-theatre career and is very talented, so I get it to some extent. She gets work from being noticeable. \n\nHowever, she did earn some raised brows at my wedding several years ago. As a struggling actress, she warned me in advance that she would not be able to afford a gift. I was fine with that, as many friends were in the same boat and I was happy to accept gifts in the form of help with the prep or anything handmade to remember the day by. Many helped me with decorations, one made adorable, fimo cake toppers, another offered free p...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 68,
            "ESH": 6,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-04T05:13:43.428452"
    },
    {
        "id": "1pdkp88",
        "title": "AITAH for leaving after my friend showed up extremely late again?",
        "url": "/r/AmItheAsshole/comments/1pdkp88/aitah_for_leaving_after_my_friend_showed_up/",
        "body_summary": "My friend and I made plans earlier this week to meet at a bar at 5:30 PM. We don’t get to hang out super often, so I was actually looking forward to it. I even showed up early around 5:15 and let her know I was already there.\n\nShe told me, “Go ahead and grab us a seat inside.”\n\nSo I did. I picked out a table, ordered a drink, and settled in to wait.\n\nTime kept passing and I noticed she still wasn’t there. At first I assumed traffic or maybe parking issues. But by 6:15 PM, almost an hour past the time we agreed on she finally texted me saying she was still at home, which is a full 25 minutes away.\n\nI was honestly furious. Why tell me to go inside and grab a table if you haven’t even left your house yet? It felt inconsiderate and like she expected me to just sit there indefinitely.\n\nAnd this...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 125,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-04T05:13:59.985477"
    },
    {
        "id": "1pdjxfp",
        "title": "AITA for telling my wife she needs to clean the house?",
        "url": "/r/AmItheAsshole/comments/1pdjxfp/aita_for_telling_my_wife_she_needs_to_clean_the/",
        "body_summary": "Context: been married 13 years, have three kids. I have been fully employed for 16 years, with only a 2 months gap in my resume when I was laid off a couple years ago, sometimes I worked extra part time jobs when money got tight from debt and stuff. \n\nIssue: From the beginning of marriage my wife made a strong point that I carry my weight around the house. Chores split 50/50, which I’ve kept up on, and even cook dinners most nights, while my wife was a SAHM, nothing else. She hasn’t had to have a job our entire marriage, until now. 2 months in her fulltime job and she’s stopped doing anything around the house. I’m now doing the all the cleaning, grocery shopping, laundry, dishes, prepping the meals, taking the kids to and from childcare. She gets full access to her phone at work (a 100% de...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 53,
            "ESH": 23,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 86
        },
        "total_judged": 86,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-04T05:14:17.121996"
    },
    {
        "id": "1pcw4xf",
        "title": "AITA for blowing up on my friend after she leaked private art I made.",
        "url": "/r/AmItheAsshole/comments/1pcw4xf/aita_for_blowing_up_on_my_friend_after_she_leaked/",
        "body_summary": "i’m 17 and like 2 months ago i started therapy for something that happened to me. art ended up being the only thing that really helped. i do digital art but i’ve never posted it or really saved it anywhere.\n\na week ago my friend “lacey” messaged me saying she saw the art on my phone and that it was “harmful” and “disgusting” and basically said i had some fetish. i kinda lost it on her and sent like 15 long messages bc i couldn’t believe she said that or maybe even went thru my phone. she left me on read so i thought that was it.\n\nthen a few days later my other friend “kyle” dm’d me asking what was going on and sent a screenshot of some groupchat. lacey had sent almost half of my art in there, told them i made it, and there were like 12 ppl in the chat. some i barely know. i was terrified b...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 33,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-04T05:14:32.980945"
    },
    {
        "id": "1pdbbho",
        "title": "AITA for refusing to agree to my mom’s holiday request?",
        "url": "/r/AmItheAsshole/comments/1pdbbho/aita_for_refusing_to_agree_to_my_moms_holiday/",
        "body_summary": "I spent my childhood going to multiple places on holidays. (Ex: 2 hours here, 2 hours there, basically driving around appeasing different sets of grandparents). As I entered young adulthood, I realized how NOT ENJOYABLE that was. When I had my own children in early 2018, husband and I decided to create our own traditions that still included our parents.\nAll of our immediate family are local.\n\nWhat we developed was an alternating system for holidays that we have found seems to work for everyone. Or so we thought. \n\nThanksgiving: We alternate. One year we spend it with husband’s family and my dad (who happens to be friends with husband’s fam, so it works out), next year we spend it with my mom and stepdad/mom’s side of the family. And so on.\n\nChristmas: mornings/getting up/breakfast/opening ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 58,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 60
        },
        "total_judged": 60,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-04T05:14:49.040830"
    },
    {
        "id": "1pd3e2s",
        "title": "AITA for telling my friend he can't stay at my apartment anymore after he insulted my girlfriend?",
        "url": "/r/AmItheAsshole/comments/1pd3e2s/aita_for_telling_my_friend_he_cant_stay_at_my/",
        "body_summary": "i (28) let my friend \"carl\" (28M) crash at my apartment for a few days while he was between jobs. my girlfriend came over the other night and carl straight up told her she was \"too good\" for me and could \"do better\"\n\ni told him that was disrespectful and he needed to apologize. he refused and said he was \"just being honest\".\n\nso i told him he had to find somewhere else to stay. he packed his stuff and left, but now he's telling everyone I \"chose a girl over a friend\".\n\nmy other friends are split because some say i over reacted and others say he crossed a line.\n\nAITA?\n",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 40,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-04T05:14:49.659175"
    },
    {
        "id": "1pdl9i4",
        "title": "AITA for being angry at my mother for telling me she’d be home at a certain time?",
        "url": "/r/AmItheAsshole/comments/1pdl9i4/aita_for_being_angry_at_my_mother_for_telling_me/",
        "body_summary": "So I (17F) am stuck at home watching my 10 year old brother while my mother is at her office today working. Normally she’s working at home in her office but today I guess she just doesn’t want to do that. I texted her asking what time she was going to head home. She responded, “5 or 5:30”. Not that big of a deal. \n\nI was hoping she’d come home a little earlier since I wanted to go walk at the track and she normally gets angry if I ask her to go out past a certain time. So she asks why I asked when she was coming home, then I said that I wanted to go to the track after she headed home.\n\nShe says she’ll be home at 6. So she said she’d leave work at 5:30 ish and be home by around 6. That should work. Of course, she never does that. So she doesn’t leave her work at 5:30 and I text her at 5:40,...",
        "reddit_judgments": {
            "YTA": 39,
            "NTA": 30,
            "ESH": 4,
            "NAH": 7,
            "INFO": 2,
            "TotalJudged": 82
        },
        "total_judged": 82,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-04T05:15:07.212443"
    }
]