[
    {
        "id": "1ozgpvh",
        "title": "AITA for singing at my sister's wedding?",
        "url": "/r/AmItheAsshole/comments/1ozgpvh/aita_for_singing_at_my_sisters_wedding/",
        "body_summary": "I (F17) have an older sister (F23) who got married last weekend. The wedding had all of the extended family from her side and the groom's, and we both have big families so the wedding was pretty big.\n\nDuring the reception, my aunt had requested a song from the DJ and went up to the microphone by the dance floor and started singing along to a Katy Perry song. I assumed she just spontaneously did this and that this wasn't preplanned.\n\nI just assumed this was something any guests could do as a bit later my other sister did the same thing with a different song. Afterwards, I requested a song (Yellow by Coldplay if that makes a difference) and sang it. My sister (the bride) was giving me a weird look with her hands on her hips the whole time.\n\nTowards the end of the reception when most of the g...",
        "reddit_judgments": {
            "YTA": 70,
            "NTA": 67,
            "ESH": 6,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 149
        },
        "total_judged": 149,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-18T05:12:09.183362"
    },
    {
        "id": "1ozle73",
        "title": "AITA for treating my kids differently due to their own decisions?",
        "url": "/r/AmItheAsshole/comments/1ozle73/aita_for_treating_my_kids_differently_due_to/",
        "body_summary": "Having disagreement with my wife. \n\nKid 1 - 19m  saves money, and I’ve been teaching him about investing and he is very interested.\n\nKid 2 - 17m  saves no money (from doing the exact same work, during the same time period), spends it all on his friends and despite my guidance cares little about saving or investing.\n\nKid 3 - 14f  just started working this year, and has 7 times more money than Kid 2, which was a pleasant surprise to me the way she has taken responsibility, and has taken an interest in investing.\n\nThey have all held the exact same summer job, except Kid 1 is now old enough to legally work as an adult so he can work during the school year.\n\nWith Kid 1  I sold him a car for $5,000 which he paid for in cash (car was worth around $9k).  I tried giving him my old stick shift, but ...",
        "reddit_judgments": {
            "YTA": 20,
            "NTA": 48,
            "ESH": 1,
            "NAH": 7,
            "INFO": 7,
            "TotalJudged": 83
        },
        "total_judged": 83,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-18T05:12:26.222849"
    },
    {
        "id": "1oz8jc6",
        "title": "AITA for getting my money back?",
        "url": "/r/AmItheAsshole/comments/1oz8jc6/aita_for_getting_my_money_back/",
        "body_summary": "I f(35) and my sister(32) have had a recent argument about my mom. For context, i have been saving up since January this year because i have been wanting to get my own home (i rent and live alone) next year before my birthday on february as a gift for myself. 2 weeks ago my sister messaged me asking to borrow cash for some emergency at home and that she will return it in two weeks time. I told her i dont have spare cash with me and i live paycheck to paycheck to support myself. She knows im saving up for a house and told me she will pay it back as soon as possible so me being a people pleaser, i said okay.\n\nAfter a week i found out that its my Mom who needed the money not my sister and she outright lied to me to help my mom. Me and my mom are not on good terms, she disowned me long before ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 55,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 58
        },
        "total_judged": 58,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-18T05:12:42.374553"
    },
    {
        "id": "1ozukqx",
        "title": "WIBTA if I spent the money meant to pay someone who did a job for me?",
        "url": "/r/AmItheAsshole/comments/1ozukqx/wibta_if_i_spent_the_money_meant_to_pay_someone/",
        "body_summary": "UPDATE: I found him, thanks to a suggestion I search his phone number on PayPal or Venmo. I found him on PayPal, sent him $550 and a note thanking him for his excellent work and his kindness. Thanks for ALL of the kind words here, and for some of you, thanks for the laughs and giggles. \n\nTo put some minds at ease, I'm 1,000% positive he didn't bury anything under the chicken coop, as it is built on asphalt. LOL\n\n——————————\n\nI(F70) have backyard chickens. I planned to have a new, bigger coop built for them this year. My regular contractor ghosted me a couple times for an estimate, so I was whining to my lawn guy about that. My lawn guy said he knew a guy that would probably be willing to do it, and he probably \\*\\*wouldn’t\\*\\* ask for money. I said I would feel bad if someone did all that w...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 21,
            "ESH": 0,
            "NAH": 5,
            "INFO": 3,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-18T05:12:58.662873"
    },
    {
        "id": "1ozef7z",
        "title": "AITA for kicking my boyfriend’s friend out of my birthday party ?",
        "url": "/r/AmItheAsshole/comments/1ozef7z/aita_for_kicking_my_boyfriends_friend_out_of_my/",
        "body_summary": "\nI had my birthday party 2 weeks after my actual birthday due to the seasonal work i do so it would be finished in time for my party which I planned 6 months in advance, one of my partners best friends (lets call him Peter) birthday fell on my party night (I didn’t know this until a few days before the party). \n\nPeter arrived about 2 hours late to the party and I approached him to say happy birthday and gave him a hug, we are usually friendly with each other so I was shocked when I was met with a bit of a bad attitude but oh well I continued on having fun with my friends. An hour had passed and Peter went to his car and came out with a massive speaker which over powers mine and places in the centre of the party and starts blasting music, I ask my partner to please tell him to turn it off a...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 83,
            "ESH": 2,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 92
        },
        "total_judged": 92,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-18T05:13:15.094165"
    },
    {
        "id": "1ozrbig",
        "title": "AITA for telling my Brother's wife that she is a bad mom",
        "url": "/r/AmItheAsshole/comments/1ozrbig/aita_for_telling_my_brothers_wife_that_she_is_a/",
        "body_summary": "So I live in my brother's house, as I'm currently finishing my college, which is in the same city as my brother, and he suggested I should stay in his house until I finish my college so I can save up the money which would have gone for rent instead. I told him that I will be a headache for his family, but he insisted on staying with them.\n\nNow, he has 2 daughters; one's 6 months and one's 6 years old. The older daughter is a huge trouble-maker; she goes inside my room and steals things, tears up my books, eats my snacks, etc., and her mom blames it on me for why I keep these things within her reach even if it's in my room. \n\nShe doesn't even allow me to eat junk food at home, as her daughter then starts to cry for her to eat some too, which her mom doesn't like. However, one day I found he...",
        "reddit_judgments": {
            "YTA": 20,
            "NTA": 83,
            "ESH": 24,
            "NAH": 1,
            "INFO": 8,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-18T05:13:34.242085"
    },
    {
        "id": "1ozjclo",
        "title": "AITA for saying my mom only cares about her reputation and not her kids at a friends dinner.",
        "url": "/r/AmItheAsshole/comments/1ozjclo/aita_for_saying_my_mom_only_cares_about_her/",
        "body_summary": "Context: I'm 18 atm and when I was 16 i ran away from home for about 1 week after a big argument with my mother, who i have a very turbulent relationship with. I ended up coming back after a call with my middle brother.\n\nToday we went to a dinner with some family friends and one of them was congratulating me on getting into the university i wanted. I'm the first person of our family to go to university (including cousins, aunts etc..) so this is a big deal for me cause im very proud of it. Then another person joined in and said I was a very good child and would love to have a child like me. My mother decided to join in and said I wasn't a good child, I was selfish and self centered and I gave too much trouble and decided to tell them about the time i ran away from home (which she always br...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 45,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-18T05:13:49.941976"
    },
    {
        "id": "1ozld8c",
        "title": "AITA for refusing to help my cousin financially for his house?",
        "url": "/r/AmItheAsshole/comments/1ozld8c/aita_for_refusing_to_help_my_cousin_financially/",
        "body_summary": "My grandparents had a big house. A few years before they died, they donated it to their 3 children. The donation was purposefully unbalanced to the benefit of Marie, who lived all her life in that house and had been taking care of her parents for years. My father, Thomas, accepted the principle of an unbalanced donation, but he refused to renounce his reserved portion of his parents' inheritance (in French law). He warned profusely that their part of the family basically couldn't afford the house over the long term: it's big and quite poorly maintained. In practice, it meant that Marie paid my father approximately 100K for a house that was worth 700 or 800K. The third brother, Alain, didn't ask payment from his sister, even though the payment was due by law. From that moment on, my father ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 39,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-18T05:14:05.668541"
    },
    {
        "id": "1ozlj8n",
        "title": "WIBTA if I told someone about a mistake in their tattoo?",
        "url": "/r/AmItheAsshole/comments/1ozlj8n/wibta_if_i_told_someone_about_a_mistake_in_their/",
        "body_summary": "I just saw someone I know post a photo of their tattoo on social media. It is a nice tattoo, but has an obvious mistake, that shows that they only tattooed it for aesthetics and don't actually know much about it.\n\nThink along the lines of misspelling a word in another language that you don't speak, or getting a tattoo of a chemical compound but getting the elements wrong. It is obvious to someone who knows the theory behind it, but to others it just looks nice.\n\nOn one hand I feel like there is no good thing that can come from telling them. They are excited about the tattoo and would be upset if they knew it was wrong. It is also not easily fixable unless covered up. On the other hand, I think I'd want to know. And also, there is just that part of me that really has to tell them about it \\...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 2,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 15
        },
        "total_judged": 15,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-18T05:14:21.636624"
    },
    {
        "id": "1ozpmhk",
        "title": "WIBTA if I didn't invite my twin brother to my Wedding?",
        "url": "/r/AmItheAsshole/comments/1ozpmhk/wibta_if_i_didnt_invite_my_twin_brother_to_my/",
        "body_summary": "When my brother got married, I wasn't even supposed to be there. His wife insisted that I be there, and that I be the best man at the wedding. He didn't want me to be, and even told her that, but she told him if he didn't do it, the wedding was off. \n\nHe relented and invited me to be the best-man. I didn't know any of this backstory till years later. At their wedding the preacher when on a homophobic rant about the sanctity of Marriage and how we have to protect it from the \"evil gays\". When this happened while I was standing there at the wedding I completely froze. My Brother and his Wife BOTH knew I am gay, and the only other family member to come to his wedding was gay as well. We both went low contact after that happened.\n\nHe tried to claim he didn't know the preacher did that off the ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 20,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-18T05:14:37.236252"
    }
]