[
    {
        "id": "1n2zpqr",
        "title": "AITA because I won’t let my partner set 17 alarms every morning?",
        "url": "/r/AmItheAsshole/comments/1n2zpqr/aita_because_i_wont_let_my_partner_set_17_alarms/",
        "body_summary": "Every single morning my partner sets like 17 alarms starting at 6am. I don’t need to be up until 8. The alarms go off every 5 minutes, they snooze them all, and then roll over and go back to sleep instantly while I’m lying there wide awake reconsidering my life choices.\n\nThis morning I grabbed their phone and turned off the last 10 alarms. They woke up late, got mad, and said I “sabotaged their system.” AITA?",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 82,
            "ESH": 9,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-30T05:09:45.512077"
    },
    {
        "id": "1n37mfl",
        "title": "AITA for telling my friend I share everything with my wife and I don't believe in bro code?",
        "url": "/r/AmItheAsshole/comments/1n37mfl/aita_for_telling_my_friend_i_share_everything/",
        "body_summary": "OP always shares confided information with his wife, despite telling his friend beforehand. The friend is now upset, as he wanted to confide something in secret. The friend consulted others who agree with him. AITA for not keeping secrets from my wife?\n...",
        "reddit_judgments": {
            "YTA": 111,
            "NTA": 35,
            "ESH": 5,
            "NAH": 13,
            "INFO": 6,
            "TotalJudged": 170
        },
        "total_judged": 170,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-30T05:09:52.912020"
    },
    {
        "id": "1n335ye",
        "title": "AITA for calling my friend out for constantly wasting my time and then deciding to stop engaging when she brushed it off",
        "url": "/r/AmItheAsshole/comments/1n335ye/aita_for_calling_my_friend_out_for_constantly/",
        "body_summary": "OP's friend is consistently very late, disrespecting OP's time. When late for a pre-flight coffee, the friend kept pushing back the meeting time. OP confronted her, accusing her of lacking accountability. Friend unfollowed OP. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 73,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 74
        },
        "total_judged": 74,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-30T05:09:54.362319"
    },
    {
        "id": "1n34n2n",
        "title": "AITA for refusing to split the alcohol costs at a bachelorette party even though I’m pregnant?",
        "url": "/r/AmItheAsshole/comments/1n34n2n/aita_for_refusing_to_split_the_alcohol_costs_at_a/",
        "body_summary": "OP, pregnant, attended friend's bachelorette. All split Airbnb with hot tub (OP didn't use), and groceries. OP refused to split alcohol bill, citing pregnancy & unused hot tub. Friends say OP's TA for not splitting evenly. AITA?\n...",
        "reddit_judgments": {
            "YTA": 82,
            "NTA": 45,
            "ESH": 7,
            "NAH": 0,
            "INFO": 10,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-30T05:09:58.792133"
    },
    {
        "id": "1n38sz7",
        "title": "AITA for giving notice to vacate my house?",
        "url": "/r/AmItheAsshole/comments/1n38sz7/aita_for_giving_notice_to_vacate_my_house/",
        "body_summary": "OP (28F) lives with her mother (46F), partner (26M), children, mother's partner, and her daughter. OP pays rent while her mother and partner pay utilities, which OP suspects are less than their rent contribution. OP & partner helped her family get good paying jobs. OP wants to move out with her family due to frequent arguments. After hinting at moving, OP gave notice to the landlord without explicitly informing her mother the same day. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 35,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-30T05:10:00.332661"
    },
    {
        "id": "1n397vy",
        "title": "AITA for refusing to pay my husband's credit cards?",
        "url": "/r/AmItheAsshole/comments/1n397vy/aita_for_refusing_to_pay_my_husbands_credit_cards/",
        "body_summary": "OP's husband secretly sent $1500 to his family using a credit card, violating their agreement. OP, the primary breadwinner, refuses to pay it, arguing they can't afford it and he broke their trust. Husband says his credit damage affects them both. AITA?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 47,
            "ESH": 4,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-30T05:10:02.200097"
    },
    {
        "id": "1n3lpnj",
        "title": "AITA for asking my husband family to grill hotdogs instead of roasting over a fire, since smoke irritates our daughter’s asthma?",
        "url": "/r/AmItheAsshole/comments/1n3lpnj/aita_for_asking_my_husband_family_to_grill/",
        "body_summary": "OP's daughter has asthma triggered by smoke. They were planning a bonfire with family. Due to upcoming oral surgery where inhaler use is restricted, OP asked family to cook hotdogs differently. Husband disagrees, calling OP unreasonable and not wanting to change plans. AITA for asking family to alter cooking method?\n...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 83,
            "ESH": 4,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-30T05:10:04.829912"
    },
    {
        "id": "1n3heoj",
        "title": "AITA for asking my partner to tell her ex-wife to take her wedding dress out of our house?",
        "url": "/r/AmItheAsshole/comments/1n3heoj/aita_for_asking_my_partner_to_tell_her_exwife_to/",
        "body_summary": "OP moved in with her partner and found his ex-wife's wedding dress. She asked him to have the ex take it. After months, it was still there. OP brought it up again, and he threw the dress in the trash. OP didn't want it trashed, just removed by the ex. AITA for asking to have the dress removed?\n...",
        "reddit_judgments": {
            "YTA": 26,
            "NTA": 59,
            "ESH": 18,
            "NAH": 3,
            "INFO": 3,
            "TotalJudged": 109
        },
        "total_judged": 109,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-30T05:10:07.837445"
    },
    {
        "id": "1n3k5l2",
        "title": "AITA for canceling a visit with my mom after she put being a landlord first?",
        "url": "/r/AmItheAsshole/comments/1n3k5l2/aita_for_canceling_a_visit_with_my_mom_after_she/",
        "body_summary": "OP rented from their mom, then moved out. Mom initially agreed to return the deposit for dog bills but withheld $500 for cleaning/painting despite saying it wasn't needed. OP canceled mom's visit due to this broken promise and financial strain. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 35,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 35
        },
        "total_judged": 35,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-30T05:10:09.278099"
    },
    {
        "id": "1n3b60x",
        "title": "AITA for calling out my husband in front of my family for how much he spends on fast food?",
        "url": "/r/AmItheAsshole/comments/1n3b60x/aita_for_calling_out_my_husband_in_front_of_my/",
        "body_summary": "OP's husband spends ~$200/week on fast food, concerning OP due to health and cost. He refuses to change despite her requests & concerns. At her parents' house, OP revealed his fast food habit, leading to criticism from them and anger from her husband. AITA for discussing his eating habits publicly?\n...",
        "reddit_judgments": {
            "YTA": 74,
            "NTA": 41,
            "ESH": 28,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 146
        },
        "total_judged": 146,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-30T05:10:13.682364"
    }
]