[
    {
        "id": "1nqwzzy",
        "title": "AITA, I bought my gf a Dyson Airwrap now she’s mad…",
        "url": "/r/AmItheAsshole/comments/1nqwzzy/aita_i_bought_my_gf_a_dyson_airwrap_now_shes_mad/",
        "body_summary": "OP, wanting to buy his girlfriend an Airwrap after a pay rise, asked a coworker for advice on which one to get. His girlfriend is now upset because she feels it's embarrassing for coworkers to know how much he's spending and that it implies she's only dating him for his money. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 114,
            "ESH": 0,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 121
        },
        "total_judged": 121,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-27T05:10:39.462658"
    },
    {
        "id": "1nqtrgx",
        "title": "AITA for not correcting my friend when she called me \"Grandma\"?",
        "url": "/r/AmItheAsshole/comments/1nqtrgx/aita_for_not_correcting_my_friend_when_she_called/",
        "body_summary": "OP's (33F) friend jokingly called her a GILF at a party celebrating OP's niece's baby. OP's sister (38F), the baby's grandma, was offended, feeling OP was overstepping. Sister is now not speaking to OP. AITA for not correcting friend?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 55,
            "ESH": 0,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-27T05:10:41.326023"
    },
    {
        "id": "1nr302r",
        "title": "AITA for pushing back on my nutrition professor’s assignments?",
        "url": "/r/AmItheAsshole/comments/1nr302r/aita_for_pushing_back_on_my_nutrition_professors/",
        "body_summary": "OP (18F) with a history of anorexia and weight issues, including Wegovy use, challenged her nutrition professor in Paris. The professor required students to share BMI and photograph their meals. OP said this was harmful. Professor dismissed OP's concerns, leading OP to leave the class. AITA for speaking up?\n...",
        "reddit_judgments": {
            "YTA": 34,
            "NTA": 70,
            "ESH": 6,
            "NAH": 9,
            "INFO": 6,
            "TotalJudged": 125
        },
        "total_judged": 125,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-27T05:10:46.382188"
    },
    {
        "id": "1nqya87",
        "title": "AITA for not buying spare travel tickets in case of an emergency?",
        "url": "/r/AmItheAsshole/comments/1nqya87/aita_for_not_buying_spare_travel_tickets_in_case/",
        "body_summary": "OP offered to pay for their brother & partner's coach tickets to their sister's wedding, warning them they must follow the schedule/rota. If they miss the coach, OP won't buy new tickets. Brother, partner, & mom are upset, assuming OP *would* cover it. AITA for refusing to pay for new tickets if they miss the coach?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 84,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 87
        },
        "total_judged": 87,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-27T05:10:48.817838"
    },
    {
        "id": "1nrdk5t",
        "title": "AITA For treating people like dogs?",
        "url": "/r/AmItheAsshole/comments/1nrdk5t/aita_for_treating_people_like_dogs/",
        "body_summary": "OP ignores people who raise their voice, a learned behavior from childhood and a past relationship. During an argument, OP ignored her current boyfriend when he raised his voice. He accused OP of \"training\" people like dogs and being manipulative. OP asks AITA for employing this tactic.\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 68,
            "ESH": 11,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 87
        },
        "total_judged": 87,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-27T05:10:51.056690"
    },
    {
        "id": "1nr3zcz",
        "title": "AITA helping a kid stuck in a tree then calling mall security.",
        "url": "/r/AmItheAsshole/comments/1nr3zcz/aita_helping_a_kid_stuck_in_a_tree_then_calling/",
        "body_summary": "OP helped a stuck child after the parents refused. The child then injured their ankle. OP's dad thinks they should've stayed out of it. AITA?\n...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 62,
            "ESH": 0,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-27T05:10:52.848351"
    },
    {
        "id": "1nr8moa",
        "title": "AITA: I don't want SIL to stay with us over Christmas with new baby",
        "url": "/r/AmItheAsshole/comments/1nr8moa/aita_i_dont_want_sil_to_stay_with_us_over/",
        "body_summary": "OP cares for MIL with Alzheimer's. SIL criticizes OP's care but offers no help. Husband wants SIL to stay for holidays, but OP is 8 months pregnant, mom has cancer, and SIL staying caused problems before. AITA for saying SIL can't stay?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 82,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 82
        },
        "total_judged": 82,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-27T05:10:55.909554"
    },
    {
        "id": "1nquljx",
        "title": "AITA for not letting my BIL wear my tuxedo at his cousin's wedding?",
        "url": "/r/AmItheAsshole/comments/1nquljx/aita_for_not_letting_my_bil_wear_my_tuxedo_at_his/",
        "body_summary": "OP refused to lend his unique tuxedo to GF's brother for a wedding, citing personal discomfort & a past incident. GF called him selfish & uncooperative. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 59,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-27T05:11:01.108272"
    },
    {
        "id": "1nrftx2",
        "title": "AITA for choosing to spend time with my half sister instead of with my family that keeps excluding her",
        "url": "/r/AmItheAsshole/comments/1nrftx2/aita_for_choosing_to_spend_time_with_my_half/",
        "body_summary": "My half sister is the result of my father cheating on my mom. So it’s no surprise that apart from a few aunts, uncles, and cousins my family doesn’t really like her and will often times exclude her from family events. \n\n\nI personally never held a grudge against her because she’s the closet thing to a sibling I have since I’m an only child and besides I just never understood taken anger and frustration out on the child of an affair because she’s a victim of the whole situation too.  So I’m sure you can imagine that I hate how they pretty much just try to push her out of the family and make sure she doesn’t feel welcomed. An event was coming up nothing crazy it was just a simple get together. (this was a 2 weeks ago) and I knew they wouldn’t invite my half sister so I just decided I wasn’t g...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 17,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-27T05:11:17.073451"
    },
    {
        "id": "1nrgwt8",
        "title": "AITA. Parents calling me entitled for not getting a job",
        "url": "/r/AmItheAsshole/comments/1nrgwt8/aita_parents_calling_me_entitled_for_not_getting/",
        "body_summary": "So my parents are forcing me to get a job. For context \n\nI’m 16 \nI’m dual enrolled meaning I do high school and college \nI have sports Monday-Friday from 4:00-7:00 Every night. \n\nSo I told them, I’m fine with getting a job, but when will I have free time to myself? \n\nMy parents yell at me and say that I’m entitled and my dad says he is the father of the house and it goes by what he says.\n\nHow and when will I have free time for myself and my friends, genuinely. My mom wants me to work on the weekends at target. \n\n\nso am I entitled? ",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 57,
            "ESH": 0,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-27T05:11:18.305536"
    }
]