[
    {
        "id": "1jt7ogm",
        "title": "AITA for not buying my stepdaughter a new car after she's repeatedly gotten into accidents?",
        "url": "/r/AmItheAsshole/comments/1jt7ogm/aita_for_not_buying_my_stepdaughter_a_new_car/",
        "body_summary": "My step daughter is not a good driver. She was not a good driver when she was a teen and certainly not as an adult. When she was first learning to drive, she did very fast hard breaks, she repeatedly left her car's lights on or left her car unlocked.\n\nWhen she first got her permit at 16, we gave her two rules. We would help buy her first car but she'd be on her own for car insurance, gas, and up keep. If she wanted a car, she needed to be the sole caretaker of it and it was on her to ensure she was taking good care of it. Her brothers had the same rules.\n\n3 months into her being 17, she got in her first accident. It was her first time driving in the ice and she slid. Her car hit another car. It was not a serious accident, but it caused roughly 1k in damages. Her car drove for another 2 mon...",
        "reddit_judgments": {
            "YTA": 45,
            "NTA": 20,
            "ESH": 0,
            "NAH": 5,
            "INFO": 3,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:41:41.650391"
    },
    {
        "id": "1jt74ox",
        "title": "AITA for how I explained to SIL that she wouldn't be my son's godmother?",
        "url": "/r/AmItheAsshole/comments/1jt74ox/aita_for_how_i_explained_to_sil_that_she_wouldnt/",
        "body_summary": "My wife and I aren’t practicing Catholics per se but we do follow certain traditions such as christening ceremonies for our children. Some people choose a married couple to be godparents; when I was a baby, my parents chose my uncle and his then-wife, and they divorced when I was still a child and I lost all contact with my former-aunt and basically grew up ‘without’ a godmother.\n\nSo my wife and I always thought it was best to choose one of our relatives, and one from each side of our family. For our second son, I chose my brother as godfather, and my wife chose a cousin of hers as godmother. When I called my brother to invite him, he assumed I was asking both him and his wife, and there was this awkward moment when I had to explain to him my SIL wouldn’t be the godmother. He seemed fine w...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 46,
            "ESH": 7,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 67
        },
        "total_judged": 67,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:41:52.535287"
    },
    {
        "id": "1jt0s1f",
        "title": "AITA for canceling my mom’s surprise farewell dinner because she called me messy?",
        "url": "/r/AmItheAsshole/comments/1jt0s1f/aita_for_canceling_my_moms_surprise_farewell/",
        "body_summary": "Hi Reddit,\nEnglish isn’t my first language, but I’ll try my best.\n\nMy mom (59F) and I (27F) have been “living together” for the past 10 months. I say “living together” because I’m only home 2–3 days a week—I usually stay at work or with my boyfriend.\n\nShe moved with me to Europe from Latin America. It was hard for her to adjust at first, but she’s active and has built a little community here. She’s retired and brought some savings to live and travel, and when she moved in, I started covering rent and bills. I’m lucky to have a good job and was okay with supporting her.\n\nWe don’t have the best relationship. I felt free for the first time when I moved out at 20. But I still wanted to be there for her.\n\nWe share my room (I have roommates), and she’s been living with me while we handled some l...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 39,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:42:03.101941"
    },
    {
        "id": "1jt9ifz",
        "title": "AITA for playing volleyball in the day of my sister's wedding?",
        "url": "/r/AmItheAsshole/comments/1jt9ifz/aita_for_playing_volleyball_in_the_day_of_my/",
        "body_summary": "I’m (18F) in my school’s volleyball team and we had a match scheduled for the day of my sister’s (24F) wedding. The game was early in the morning, the wedding would be at night, so there would be no conflict.\n\nAnyway, some relatives of ours who were in town just for the wedding heard me talking about the match and chose to go. It was their own decision, I only mentioned the game but didn’t invite anybody personally. After the game, I come home. My team had won, I was excited, and some of our relatives were asking me about the team, and whether I plan to continue on playing when I’m in college etc.\n\nMy sister was already there – she chose our parents’ place as her HQ – and I could instantly tell she looked upset. When we were alone, I asked her what was the problem (I thought something was ...",
        "reddit_judgments": {
            "YTA": 72,
            "NTA": 62,
            "ESH": 6,
            "NAH": 9,
            "INFO": 0,
            "TotalJudged": 149
        },
        "total_judged": 149,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:42:15.266133"
    },
    {
        "id": "1jtl8ua",
        "title": "AITA for sending my niece back home after lying multiple times and smoking in my home?",
        "url": "/r/AmItheAsshole/comments/1jtl8ua/aita_for_sending_my_niece_back_home_after_lying/",
        "body_summary": "My husband and I were asked if our teenage niece could come live with us for a few months. We said yes and clearly stated what our rules would be. We don't allow minors to use drugs/alchohol/nicotine and no one is allowed to smoke in our home. Smoking marijuana and vapes is something we know our niece has been doing and my sister in law was aware of. \n\nFor the first few months everything went well. She was never a problem and we loved having her here, planning fun things, and taking her shopping. 3 weeks ago we noticed a sudden change, she was avoiding us and we were catching whiffs of a weed pen. We started being hyper aware of her behavior and within a few days noticed she was clearly high. We confronted her and she told us the truth and handed over the pen. Fast forward a few weeks late...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 24,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:42:25.818148"
    },
    {
        "id": "1jtg6xv",
        "title": "AITA for refusing to keep sending money for my partner’s family",
        "url": "/r/AmItheAsshole/comments/1jtg6xv/aita_for_refusing_to_keep_sending_money_for_my/",
        "body_summary": "I (29M) am in a relationship with my partner (28M), who comes from a culture where parents are seen as infallible and can ask for anything without question.\n\nWhen we decided to move to another country, my partner’s parents generously helped fund the move. Over time, we managed to pay them back, and even more than what they initially contributed. My partner’s mother regularly asks for money for things like bills, office trips, or even luxury items like a new iPhone. This started as small, occasional requests, but it’s been ongoing for three years now. I initially managed to convince myself how it’s fine and a little sum won’t hurt but lately it’s really wearing me down.\n\nFor context, we’ve also covered other expenses, like paying for legal fees for my partner’s dad when he got into trouble,...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 27,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 29
        },
        "total_judged": 29,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:42:36.387476"
    },
    {
        "id": "1jt47m8",
        "title": "AITA for how I responded to my friend’s mom asking for more money after I already paid what she had said I owed her?",
        "url": "/r/AmItheAsshole/comments/1jt47m8/aita_for_how_i_responded_to_my_friends_mom_asking/",
        "body_summary": "Basically, our agreement was I paid split rent, including utilities for half a bedroom I shared with my friend I left halfway through the end of the month and gave her the money that she said I owed her, which was a total of 280 and assume that was that and haven’t contacted them since until today here’s what went down \n\nThe mom: \"Morning, I have already paid the electric bill and still owe the water bill. Utilities are paid one month behind. I am extremely broke and cannot afford to pay the water bill or by groceries or I wouldn't ask. Can you please pay your split of the utilities for last month and this is half of what is owed for the room of $87?\nMy friend would owe the other $87 and her aunt would owe $174 same for me.\"\n\nMy reply:\n\"No, I wasn't even there for a majority, I'm not givin...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 13,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 24
        },
        "total_judged": 24,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:42:47.122584"
    },
    {
        "id": "1jt8t6i",
        "title": "AITA for refusing to take care of my ex’s dog even though I was the one who originally adopted him?",
        "url": "/r/AmItheAsshole/comments/1jt8t6i/aita_for_refusing_to_take_care_of_my_exs_dog_even/",
        "body_summary": "Using a throwaway because some people I know follow my main.\n\nI (28M) adopted a dog, Max, five years ago when I was living with my ex, “Riley” (30F). We were together for a little over three years. Technically I adopted him, I filled out the paperwork, I paid the adoption fees and the vet stuff in the beginning, but Riley was always way more attached. She did the training, took him on walks, taught him tricks, all that. She really bonded with him. I loved him too, but I honestly think he loved her more.\n\nWhen we broke up two years ago, she asked if she could keep Max. It sucked but I said okay. I remember saying something like, “I just want him to be happy.” She cried, I cried, it was a whole emotional thing. I moved out and she kept him.\n\nFast forward to last week. She calls me out of now...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 37,
            "ESH": 0,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:42:57.827834"
    },
    {
        "id": "1jtcizm",
        "title": "AITA for not sharing my savings account",
        "url": "/r/AmItheAsshole/comments/1jtcizm/aita_for_not_sharing_my_savings_account/",
        "body_summary": "I’m not a big writer, but basically one of my family members is upset with me because I have grown a savings account & they feel like I should be helping them. Mind you they are older than me. Has a steady job and all. They want to spend their money on new vehicles and gadgets. I’m saving to buy my first house. But im over here being guilt tripped. ",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 39,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:42:58.267091"
    },
    {
        "id": "1jtmfwg",
        "title": "AITA for taking over my parents’ condo and offering to give my siblings today’s value when I sell it?",
        "url": "/r/AmItheAsshole/comments/1jtmfwg/aita_for_taking_over_my_parents_condo_and/",
        "body_summary": "My parents bought a condo in South Carolina years ago for about $100,000. It’s worth at least three times that now, maybe more. They’re older now and living in a retirement home, and keeping up the condo has become too much for them.\n\nI stepped in and offered to take over the mortgage and handle everything going forward—mortgage payments, maintenance, property taxes, etc. There's about $29,000 left on the mortgage. \n\nAt some point down the line, I might sell the condo. To keep things fair, I told my siblings that when I do, I’ll give them their share of what the condo is worth today. The current market value. That way they still get something out of it, even though they're not paying the mortgage or doing any upkeep.\n\nNow my family’s acting like this is somehow unfair. I don’t really get i...",
        "reddit_judgments": {
            "YTA": 43,
            "NTA": 9,
            "ESH": 0,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 58
        },
        "total_judged": 58,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:43:09.162030"
    },
    {
        "id": "1jt00a7",
        "title": "AITA for not going to my grandma's 85th birthdaydinner probably 2 weeks to a month postpartum?",
        "url": "/r/AmItheAsshole/comments/1jt00a7/aita_for_not_going_to_my_grandmas_85th/",
        "body_summary": "So I (28 F) and my husband (33M) are expecting our first baby. With that I'm the first on my side of the family, so 1st grandkid and first great-grandchild, which is kinda special. \n\nToday my mom told me that, for my grandma's 85th birthday dinner, she wanted to look for a restaurant very close to my home (max 10 min. By car). My grandparents live over 1.5 hour away (I know its not far for most Americans, but where I live it is considered far away.) \n\nNow here is the deal. I'm expected to deliver my baby a month before the date of the birthdaydinner. But I dont know for sure when I will deliver. Especially with a first, I see a lot of people going 'till 41+ weeks. And in that case I wouldn't even be a month postpartum. \n\nI do not feel ready to go out at that time postpartum because I will ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 49,
            "ESH": 0,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 58
        },
        "total_judged": 58,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:43:19.965240"
    },
    {
        "id": "1jte15o",
        "title": "WIBTA If I asked my friends to pay the full amount?",
        "url": "/r/AmItheAsshole/comments/1jte15o/wibta_if_i_asked_my_friends_to_pay_the_full_amount/",
        "body_summary": "throwaway account for privacy’s sake\n\nI went out with my wife and a couple of friends to Korean BBQ to celebrate two of our group’s birthdays. There were 12 of us in total. I paid for the dinner in full since it’s annoying for servers to get each person’s card individually and get us to pay that way, plus some of us got extra items. After dinner, I asked “Can everyone except the birthday people pay me xyz amount? I already excluded the dish that my wife and I got.” \n\nMost everyone paid me the full amount except for two. These two are a couple and are getting married later on this year, and I have heard that one of them was freaking out about budgeting earlier on. This same person said: “Do we have to pay the full amount if we only had shots?” Which at the time I didn’t think too much about...",
        "reddit_judgments": {
            "YTA": 16,
            "NTA": 40,
            "ESH": 3,
            "NAH": 3,
            "INFO": 4,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:43:31.600732"
    },
    {
        "id": "1jtfwsc",
        "title": "AITA for not including my husbands siblings in life events for our kids?",
        "url": "/r/AmItheAsshole/comments/1jtfwsc/aita_for_not_including_my_husbands_siblings_in/",
        "body_summary": "To give some background My husband (m34) and I (f35) went no contact with my husbands parents about 8 months ago. The first 4 months we were just “taking space” sparked by a phone call we had with them. They opened the door on the phone call and said, “ I hope if there is anything we have done to hurt you we can talk about it in the moment” my husband has been extremely hurt by many of their actions and he took the opportunity to try to express those in a calm environment. (My husband grew up in a house where he always felt he had to tiptoe around his Moms mood and his Dad would defend that. When I married into the family I was all but told who I should like in the family and who I shouldn’t if I was going to make his mom like me.) \n \nAnyway, he told them about some past ways he had been h...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 18,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:43:42.043672"
    },
    {
        "id": "1jtkwl8",
        "title": "AITA Mom wants me to give her money she gifted me back",
        "url": "/r/AmItheAsshole/comments/1jtkwl8/aita_mom_wants_me_to_give_her_money_she_gifted_me/",
        "body_summary": "A few weeks ago, my mom came into a large sum of money and gifted both my sister and me a portion of it. For context, we grew up with very little money, so this was a huge deal for us. She gave me $40K.\n\nI live independently and have a significant amount of debt, so I met with an accountant to figure out the best way to use the money mainly to pay off debt or put it toward buying a condo, since housing is the main priority for me. I’ve already used some of the money to pay down debt that was in collections and to begin going to school. \n\nNow, my mom is asking me to give $8K of it back because she is saying she needs to pay more expenses which doesn’t make sense to me. \n\nMy mom is extremely emotional and can be aggressive. I suspect she has undiagnosed BPD. She’s lashed out at me in the pas...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 19,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:43:52.534053"
    },
    {
        "id": "1jt1okq",
        "title": "AITA for lying to my family so I don’t have to help my sick grandmother?",
        "url": "/r/AmItheAsshole/comments/1jt1okq/aita_for_lying_to_my_family_so_i_dont_have_to/",
        "body_summary": "I (30F) was asked to help my grandma move from her old house into a 1 bedroom apartment in a senior community. She is in her 80s, not in great health, and her house is about to be condemned by the city because she didn’t take care of it over the decades. \n\nShe’s also an asshole whom I haven’t spoken to in over a decade because she abused and neglected my father so bad that he now has severe mental and physical health conditions that are directly caused from her mistreatment of him during his childhood and adolescent years. \n\nAnyway, my mom asked me to help move my grandma and I vaguely agreed that I would show up this weekend to help out. The only reason I said yes is because it was my mom that was asking. \n\nHOWEVER, I have just now flat out lied to my mom feigning a “pet emergency” so I d...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 6,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:44:03.009748"
    },
    {
        "id": "1jti7gp",
        "title": "AITA for getting mad about my MIL coming to stay with us for 4 days?",
        "url": "/r/AmItheAsshole/comments/1jti7gp/aita_for_getting_mad_about_my_mil_coming_to_stay/",
        "body_summary": "We (my bf and I) live in a 43 foot trailer and I work a corporate job from home. It’s basically a studio apartment. We have a mini golden-doodle and a mini schnauzer. I am a heavy smoker, and don’t advertise it to the world. (Gardener not tobacco). My boyfriend works 7 days a week, 12 hour shifts for 2-3 months at a time. Right now he’s on a job where he is working those hours. His mother is 70 y/o and Christian Baptist from the South. She lost her husband last year in August and she is one of the sweetest people I know. So she’s been lonely. She’s been talking about visiting us for some time, but we always make time to come visit her instead because our living situation. She is on the school kid’s schedule so she gets spring break off work. She’s been wanting to “get away” from home for a...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 55,
            "ESH": 6,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 77
        },
        "total_judged": 77,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:44:14.643887"
    },
    {
        "id": "1jtm96u",
        "title": "AITA for ditching my dad’s funeral?",
        "url": "/r/AmItheAsshole/comments/1jtm96u/aita_for_ditching_my_dads_funeral/",
        "body_summary": "I'm 13 (F) and my dad just died from a heart attack.\n\nGrowing up, my dad was horrible. Like, horrible horrible. He was the #1 reason why I had severe mental issues, why I was afraid to come out, and a whole lot of other reasons.\n\nDon't get me wrong, he was a great father, but never a good dad. He saved money for our college, he cared for us financially, but it was a bad trade-off for completely neglecting me emotionally.\n\nHe also controlled my mom financially. That sucks.\n\nAnyways, I had to go to the funeral at first (because I'm a teen that's living under my mom's roof) but I decided to ditch when I saw my mom talking about how great he was. I just lost it, y'know?\n\nHe was never good to my mom. Or me. Or my sisters. Always yelling, always fighting, and sometimes he used to make my mom unc...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 50,
            "ESH": 0,
            "NAH": 12,
            "INFO": 0,
            "TotalJudged": 70
        },
        "total_judged": 70,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:44:25.701712"
    },
    {
        "id": "1jsxvup",
        "title": "AITA If I ignored my uncle on my Birthday Trip?",
        "url": "/r/AmItheAsshole/comments/1jsxvup/aita_if_i_ignored_my_uncle_on_my_birthday_trip/",
        "body_summary": "I (18M) am transgender, female to male. I've been trans since I was 11, and came out to my family at 14. I've always been comfortable with my gender and sexuality. My parents are divorced, and my Dad accepted me with open arms and joked about how he always knew I would be queer. \n\nMy mom took a little more convincing. She made it seem like I was personally attacking her, and even asked me to think of how difficult it was for her. She has since come around, and so has most of her side of the family. Except my uncle, who still calls me a girl and referred to the Minecraft Movie as 'Woke' for having a black woman in it. \n\nFor my birthday, my mom told me would buy me tickets for Florida's supercon, but wanted me to go with someone to be safe. Personally, I thought it would be cheaper and easie...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:44:36.061518"
    },
    {
        "id": "1jtfo72",
        "title": "WIBTA If I told my friend to stop bringing his girlfriend to everything we do",
        "url": "/r/AmItheAsshole/comments/1jtfo72/wibta_if_i_told_my_friend_to_stop_bringing_his/",
        "body_summary": "My friend (m22) and I(m23) have been friends for almost 10 years now and he recently got a girlfriend (first girlfriend fyi) which I am super happy for.\n\nBut I hate every time we hang out we have to see eat with her or have something to do with her. While I don't have a grudge against her or anything (I actually like talking to her), I just don't really enjoy third wheeling and really I just want a day with just me and my best friend.\n\nI genuinely understand why he's doing what he's doing (I've been in a relationship before) but I feel like he can simply go a day without seeing her.\n\nHowever I feel like it crossed the line a couple months ago when there was a time crunch for something we had to do and he was just hanging out at her place when I was waiting for him to get home so I could dr...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 14,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 14
        },
        "total_judged": 14,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:44:46.514044"
    },
    {
        "id": "1jt9zcv",
        "title": "AITA for refusing to meet my (36F)BFF's new boyfriend (40m)",
        "url": "/r/AmItheAsshole/comments/1jt9zcv/aita_for_refusing_to_meet_my_36fbffs_new/",
        "body_summary": "AITA for refusing to meet my (F36) bff's new boyfriend? (m40ish?) Context, two years ago she ended a 16 year common law relationship where she had two kids. Before that relationship was officially over, she jumped into a relationship with a disaster of a guy named Arrron. Employment insurance user, jobless, homeless, carless has a wife he's not divorced from, kids are unhappy etc... ....it was a pretty bad abusive relationship that lasted a year and half before she realized he had to go and cut him. Of course I'm overwhelmed with joy because I knew he was a gross cheater / user who was hurting her. I l live across Canada, three provinces away for added context, so I couldn't see a lot of the trauma she was going through from Aaron. But I digress. \n\nA couple weeks go by and she hits the tow...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:44:56.985669"
    }
]