[
    {
        "id": "1ptmh02",
        "title": "AITA for sleeping naked in my own room?",
        "url": "/r/AmItheAsshole/comments/1ptmh02/aita_for_sleeping_naked_in_my_own_room/",
        "body_summary": "throw away account cause i don’t want my roommate to see this\n\nsince i was a teenager i've always slept naked. i always get too hot at night and its just generally way more comfortable for me to sleep that way. whenever i leave my room i'm always dressed, or at the very least have shorts  or something on if i'm going to/from the shower. my roommate knows this and up to this point has had no problem with it and we always knock on each others doors anyway to be polite.\n\nthe issue started when he brought over his girlfriend to stay a couple nights. we all get along pretty well and have all hung out a few times before, but this was the first time she had come over and spent the night. we had all gone out drinking and got home pretty late so once we all walked in we just went straight to sleep....",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 136,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 137
        },
        "total_judged": 137,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-24T05:17:04.324635"
    },
    {
        "id": "1ptxnzc",
        "title": "AITA for not wanting to watch Netflix with subtitles?",
        "url": "/r/AmItheAsshole/comments/1ptxnzc/aita_for_not_wanting_to_watch_netflix_with/",
        "body_summary": "Ok, so my partner (36F) and I (36M) have been married for 11 years....our biggest fight has been because of Subtitles on Netflix, I want it, she does not....\n\nMy reasoning, I follow the story so much better when it is on, her reasoning...it is distracting. I said that when I decide on something we need to have it on, but it does create some friction still. AITA?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 57,
            "ESH": 3,
            "NAH": 41,
            "INFO": 4,
            "TotalJudged": 106
        },
        "total_judged": 106,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-24T05:17:12.513336"
    },
    {
        "id": "1ptpquj",
        "title": "AITA for refusing to let my homeless brother move back in after he trashed my house last time?",
        "url": "/r/AmItheAsshole/comments/1ptpquj/aita_for_refusing_to_let_my_homeless_brother_move/",
        "body_summary": "I (29F) own a small house I worked my ass off to buy and fix up. My brother (31M) has always been a total mess with jobs and life in general.\nLast year he begged to stay with me ,just a couple months, because he'd landed a good job right here in our state, super close to my house. He swore he'd save up quick and move out on his own. I said yes but set clear rules: pay some bills, clean up, no parties, stick to the job.\nHe never paid anything, trashed the place, had loud friends over all hours, borrowed my car without asking, and let his secret dog pee everywhere including my new rug. He ended up losing that job anyway, and after months of hell, I kicked him out.\nNow he's homeless again, but he says he's got another job lined up in the exact same area and is crying that he needs a place to ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 104,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 104
        },
        "total_judged": 104,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-24T05:17:28.604520"
    },
    {
        "id": "1ptpob7",
        "title": "AITA for hiding the Christmas food.",
        "url": "/r/AmItheAsshole/comments/1ptpob7/aita_for_hiding_the_christmas_food/",
        "body_summary": "For the last four years I (41F) have hosted a small Christmas dinner at my and my husband's house. it's usually me, my husband, my childhood friend, her bf, and sometimes my MIL. \n\n3 years ago my BIL came to live with us, and things were fine. Except when it comes to food. the first Christmas he was here,  two days before the chrismas he took half the ham I had bought for dinner. when I talked to him about it, he shrugged it off and said he thought he was \"part of everyone\", which he is, but he doesn't participate in the family gathering. he stays in his room until everyone leaves. So last year and the year before I told him \"please don't open/take the ham before christmas dinner, I want to make sure there is enough for everyone\" (I get the honey baked ham half ham, which isn't big). but h...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 39,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-24T05:17:45.015642"
    },
    {
        "id": "1ptvvvn",
        "title": "AITA For Wanting A Quiet Christmas After Baby Spends Nearly A Month In The NICU",
        "url": "/r/AmItheAsshole/comments/1ptvvvn/aita_for_wanting_a_quiet_christmas_after_baby/",
        "body_summary": "I recently gave birth at the end of November. Original plan was to visit my in-laws for Christmas Eve, Christmas, & Boxing Day. It would've given us a month to have our baby home & get into a routine.\n\nLife threw us a curve ball - she was admitted to the NICU, she remained there for nearly a month. She has now been home for 3 full days. I also had some trouble myself as I suffered a postpartum hemorrhage at home 2 weeks ago. Baby still has medicine & needs blood sugars monitored.\nIt has been a bumpy and stressful journey.\n\nNow Christmas is soon & we've decided to stay home. The in-laws are more than welcome to come for short visits, I was even open to a short Christmas day visit, but we would not be leaving the comfort of our house.\n\nAs a result my MIL is very upset. She doesn't even want ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 150,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 150
        },
        "total_judged": 150,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-24T05:18:01.570254"
    },
    {
        "id": "1pttwdj",
        "title": "AITA for refusing to cook for my family’s christmas event?",
        "url": "/r/AmItheAsshole/comments/1pttwdj/aita_for_refusing_to_cook_for_my_familys/",
        "body_summary": "Throwaway account because I’m pretty sure some of mt family scroll on reddit.\n\nI (15f) really like baking and cooking food. Most of the time im making everyone little treats to try or im cooking dinner for my family from our background and it’s sort of one of mt love languages, often I’ll bring food to family events because my aunts and uncles are busy all the time and have little time to make food before they host parties and stuff and because im not working yet i have more time to make all this fun stuff.\n\nSo on Christmas we typically open presents at home then all have lunch and /or dinner at someone’s house. But this year my mum said we wouldn’t all be together. was a bit upset but was like alright, that’s fine with me. then my aunt calls me and asks me if I’ve thought of what food im ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 80,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-24T05:18:17.679363"
    },
    {
        "id": "1pty32t",
        "title": "AITA for asking my ex husbands girlfriend to stop posting our kids on social media.",
        "url": "/r/AmItheAsshole/comments/1pty32t/aita_for_asking_my_ex_husbands_girlfriend_to_stop/",
        "body_summary": "I (33 f) have asked multiple times that my ex husband (32 m) ask his girlfriend to stop posting our kids on social media. Every ask has been met with lots of conflict and arguing. My favorite line is him claiming I’m being controlling. Here’s some back story for y’all we were together for 11 years married for 6 we have two kids together and he helps raise my oldest. We’ve been separated since last Halloween and divorced fully since May. Ex husband and his girlfriend have been together since February, she met my kids about 10 days after she met him and has been in their lives ever since. They live together and she seems to really love my kids. I don’t really have a problem with her except she continues to post my kids on social media with captions that make me and my family members extremel...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 44,
            "ESH": 15,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-24T05:18:34.864575"
    },
    {
        "id": "1ptoevb",
        "title": "AITA For never wanting to stay the night at my in-laws again.",
        "url": "/r/AmItheAsshole/comments/1ptoevb/aita_for_never_wanting_to_stay_the_night_at_my/",
        "body_summary": "I (31 yr F) and fiance  (29yr M) been together for 8 yrs have been traveling for the holidays visiting family with our 2 children. We have a big family and really try to see everyone for rhe holidays since we live out of town. It's been a busy week but we mostly stay at my parents place everytime we come up to visit for a couple days its just easier and just visit other family for the day. This time we agreed to stay his parents place for a night. We had made these plans for over a month. We also had stipulated some things prior to being able to stay bc of concerns. One thing I really wanted was a bed to sleep on or even a blowup mattress. I also suggested we could bring our blowup mattress but was assured we didn't need it from my fiance dad that they bought a new bed and the rooms would ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 30,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-24T05:18:50.906858"
    },
    {
        "id": "1pttl3a",
        "title": "AITA for locking up my snacks so my family can’t take them without asking?",
        "url": "/r/AmItheAsshole/comments/1pttl3a/aita_for_locking_up_my_snacks_so_my_family_cant/",
        "body_summary": "22M here. I buy my own snacks with my allowance from internship. If I leave them in the kitchen, they get eaten, so I keep them in my room. Even then, my family (parents and younger sibling) still take them without asking.\n\nI’ve asked them multiple times to at least ask first, but they say it’s not a big deal and laugh it off. After it kept happening, I bought a small lockbox and started keeping my snacks locked up.\n\nNow my family say I'm being selfish and mean for not sharing. To be honest, I don't mind sharing if people ask, but I really don't want my own things taken without permission.\n\nAITA?",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 28,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-24T05:18:51.707233"
    },
    {
        "id": "1ptwqq9",
        "title": "AITA for saying it's not my/my dogs fault that he stepped on a puppy?",
        "url": "/r/AmItheAsshole/comments/1ptwqq9/aita_for_saying_its_not_mymy_dogs_fault_that_he/",
        "body_summary": "I have a large dog, and live with my brother who has a small breed puppy. My dog is still young and is a herding breed so is VERY active, so when my brother wanted to get a puppy I said not to get a small breed as I was worried while playing my dog could accidentally hurt the puppy. Well he got a small breed a few months ago anyways. A few nights ago they were outside playing with the puppy running under my dog's paws (which it always does for some reason) and my dog accidentally stepped on it. The puppy had to get to the vet and its leg is sprained. My brother was blaming my dog saying he should be more gentle (he is actually very gentle with the puppy but i'm not going to stop him from running and playing in his own backyard) and that I shouldn't let my dog act like that. Am I the asshol...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 5,
            "ESH": 13,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "ESH",
        "fetched_utc": "2025-12-24T05:19:07.624868"
    }
]