[
    {
        "id": "1q6f2aq",
        "title": "AITA for not giving half of my fortune to my brother",
        "url": "/r/AmItheAsshole/comments/1q6f2aq/aita_for_not_giving_half_of_my_fortune_to_my/",
        "body_summary": "I (M30) and my brother (M32) are not so close from the beginning mainly due to favoritism and i being the unwanted middle child, we have a younger sister (F29).\n\nwe have farm lands but the farm were not so huge and yeild of the farm is comparatively very low, not enough for our family. so when my mom got an opportunity to send one of her sons to foreign land to work, she decided to send me instead because she wanted her favorite child to be with her, my brother.\n\neventhough i got married recently and leaving for work means leaving my wife here at the village because the pay and working conditions were not good enough alongside i have to keep on sending money at home also. i left for work & worked for 5 years with only 2 home visits a year, tough time for my wife & kid. i also had to miss m...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 76,
            "ESH": 0,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-08T05:17:10.460674"
    },
    {
        "id": "1q66t3g",
        "title": "AITA for not wanting to allow people to take pictures of me at my wedding (as someone with intense body dysmorphia)",
        "url": "/r/AmItheAsshole/comments/1q66t3g/aita_for_not_wanting_to_allow_people_to_take/",
        "body_summary": "(* edit added at the bottom *) \nI’ve struggled with body dysmorphia since I can remember honestly, and was diagnosed in high school. Even after therapy and recovering from an eating disorder, my intrusive thoughts about my appearance never fully stop. Sadly even though I’m in my mid (to upper) 20s, one bad photo (posed or candid) can still send me spiraling even on days I otherwise feel okay.\n\nMy fiancé and I have been together for over five years and are recently engaged. He’s incredibly supportive and understands my struggles. He’s probably more patient with me than he should be God bless him. We’ve started wedding planning, and I’ve realized that the idea of being the center of attention, especially photographed, has become one of my biggest anxieties.\n\nI’m generally very easygoing, esp...",
        "reddit_judgments": {
            "YTA": 25,
            "NTA": 82,
            "ESH": 0,
            "NAH": 18,
            "INFO": 3,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-08T05:17:28.396750"
    },
    {
        "id": "1q6hz2f",
        "title": "AITAH for causing issues in my best friend’s marriage?",
        "url": "/r/AmItheAsshole/comments/1q6hz2f/aitah_for_causing_issues_in_my_best_friends/",
        "body_summary": "I (30F) have been best friends with A (31M) since we were 10. We grew up together, went to the same schools, and are like siblings. There has never been anything romantic between us. Our families are very close, and my mom treats him like a son.\n\n\nIn high school, A met his now wife, Bea (31F). Bea and I were part of the same larger friend group with four other girls, A, and two other guys. I was close to her at the time, I even helped set her and A up. After high school, A moved abroad for med school. Bea and I stayed in the same city, but she and the four other girls formed a new group chat and social circle that excluded me. It hurt, but I took it as a clear signal they didn’t want to be close, so I moved on and made other friends. I don’t hold any resentment about this now.\n\n\nA and I re...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 13,
            "ESH": 2,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-08T05:17:44.122889"
    },
    {
        "id": "1q6gkvj",
        "title": "AITA for planning to take a solo weekend trip and leaving my wife at home by herself?",
        "url": "/r/AmItheAsshole/comments/1q6gkvj/aita_for_planning_to_take_a_solo_weekend_trip_and/",
        "body_summary": "I (42M) am married to my wife (35F). I like to travel- that's pretty much my only hobby. My wife enjoys travel too. My wife has been at her sisters out of state for the past 3.5 weeks given her sister had a baby and she wanted to be with her. During this time I have been by myself, taking care of our 12 year old son and managing full time-work, house and all our son's activities. I found myself with a 4 day weekend coming up for MLK weekend and I asked her if I can take a solo trip to a foreign country. She agreed if I agreed to let her extend her visit at her sisters by a week- so she can spend more time with the new born. She will be back before that MLK weekend starts. She can not travel international right now as we are waiting on her green card. Our son has a camp date with his friend...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 67,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-08T05:18:00.488270"
    },
    {
        "id": "1q6dd8o",
        "title": "AITA for not adhering to one of my mums invite wishes for my birthday party when she and my dad are paying a lot for it?",
        "url": "/r/AmItheAsshole/comments/1q6dd8o/aita_for_not_adhering_to_one_of_my_mums_invite/",
        "body_summary": "I (15f) and my mum have been arguing over this and i wanna know if i need to apologise or not basically.\n\nSo it’s my 16th birthday on the 13th and my party is on the 12th. My mum and dad are paying for the family party and for my friends im going to a waterpark with them. (I have a pass so they all get to go for free). But for the family party it’s at a restaurant where you can book out a room, there’s a bar for the adults that will be there. and then a space for the balloon setup things. It’s a pretty spacious room so im saying this to say it will cost. my dad said it’s 150 an hour to rent the room and the party would go for 4 hours.\n\nMy mums request was that she give me a list of people she wanted there. I didn’t love the idea but i said sure. She sent me the list and it included some fa...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 32,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-08T05:18:16.068072"
    },
    {
        "id": "1q6fpfv",
        "title": "AITA for not being there for my mom’s colonoscopy because of my marriage situation?",
        "url": "/r/AmItheAsshole/comments/1q6fpfv/aita_for_not_being_there_for_my_moms_colonoscopy/",
        "body_summary": "\nI’m really confused and honestly feeling guilty, so here goes\nMy mom is getting a colonoscopy soon. It’s not an emergency, and my dad will be with her the whole time. Doctor said it’s a day procedure and she’ll be under observation for a couple of hours after.\nAround the same time, my husband has been planning a trip to his native place. This is not last minute . he has been talking about this trip for almost a month. Recently it got finalized that we’ll go by car, and my mom-in-law will also be coming with us. It’s a long drive.\nHere’s the part people don’t really get: my marriage is not easy. My husband is not very open to discussions and just talk to him usually turns into fights, tension, and days of bad vibes. I’m honestly exhausted from constantly standing my ground and paying for i...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 112,
            "ESH": 1,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 124
        },
        "total_judged": 124,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-08T05:18:33.459646"
    },
    {
        "id": "1q6auxs",
        "title": "AITA for not wanting to buy my friend's painting",
        "url": "/r/AmItheAsshole/comments/1q6auxs/aita_for_not_wanting_to_buy_my_friends_painting/",
        "body_summary": "A friend of mine is an artist and is trying to sell me one of her paintings for $60. Tbh, I don't love the painting, and although I could technically afford it, it's still $60 which I would rather not part with for this. She first brought up the idea before Christmas and I fobbed her off a bit by saying I needed the money for presents and we could revisit the idea in January. Now she's brought it up again.\n\nAs a friend, she's always been good to me, and generous with her time, has cooked for me a few times, given me little gifts, etc. I've tried to reciprocate by making time for her as well though I think if you broke our friendship down in terms of a financial spreadsheet (which I know is not the right way to look at a friendship, but still) I think you would find that she has put more mo...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 13,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-08T05:18:48.952880"
    },
    {
        "id": "1q69n81",
        "title": "AITA for measuring a wall?",
        "url": "/r/AmItheAsshole/comments/1q69n81/aita_for_measuring_a_wall/",
        "body_summary": "My best friend decided to tell me a week ago that she was moving out tomorrow. Not great but whatever I figured it out I’ll make it work. So then I decided to start thinking about what I could do with her room once she moved out as something to somewhat take my mind off the stress of the situation. I decided I could possibly put my 3 big bookshelves in there so I measured my shelves and then measured her wall and she said I was insensitive for doing so. That I should at least wait til she’s gone and out to start planning what I’m doing with her room. (She’s moving out on her own accord I’d get it if I was kicking her out but I’m not) I just want to know if I’m in the wrong in this situation? My husband is bias so I can’t ask him and I don’t want to skew anyone’s opinion with the whole deta...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 5,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 8
        },
        "total_judged": 8,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-08T05:19:04.390061"
    },
    {
        "id": "1q6bbvx",
        "title": "WIBTA for asking my friend to pay me back?",
        "url": "/r/AmItheAsshole/comments/1q6bbvx/wibta_for_asking_my_friend_to_pay_me_back/",
        "body_summary": "I (24/F) met with my best friend (Kate) and another friend (Sara) shortly before Christmas. We went to a Christmas market and then we had something to eat. \nI mentioned before that I don't currently have a job. My friend S does have a job, one that pays well. We had the topic. Now if I'm out with K  we dont care who pays. It somehow equals out besides it's never high amounts. \n\nNow I said on the table to them to split the bill, I looked at Sara and told her to do 50:50, I took Kate out since she is the driver + had the least amount.\n\nSara and I we both pulled out our wallets, Sara put hers back like last second and tells me thanks for paying. \n\nNow. I wouldn't have minded it that hard if Sara hadnt went to buy 3 games for the switch right after.   Now my breaking point came actually on Chr...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 1,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 7
        },
        "total_judged": 7,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-08T05:19:19.908883"
    },
    {
        "id": "1q69ddt",
        "title": "AITA for calling my dad an asshole to his face?",
        "url": "/r/AmItheAsshole/comments/1q69ddt/aita_for_calling_my_dad_an_asshole_to_his_face/",
        "body_summary": "So today I called my dad an asshole to his face. This is a throwaway account because some of my family uses reddit. My dad has always been kind of an asshole and no one ever really stands up to him. He is constantly making comments to me for no reason. One time I was teasing/joking around with my brother about a hot dog from Costco (hes obsessed with Costco hotdogs) and he turned to my brother and said \"don't worry, I'll just say something to make her cry so she'll stop bothering you\" mind you my brother was also joking around with me. Another time when i was in the fridge and couldnt find my garlic and all I said was \"I can't find my garlic im not sure if someone threw it out\" (was making dinner for everyone) and he looked at me and said \"what are you going to start bitching and being nas...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 4,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 5
        },
        "total_judged": 5,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-08T05:19:35.314886"
    }
]