[
    {
        "id": "1otg5eh",
        "title": "AITA for using a disabled person for my “own benefit”?",
        "url": "/r/AmItheAsshole/comments/1otg5eh/aita_for_using_a_disabled_person_for_my_own/",
        "body_summary": "So I (18F) took ASL lessons in HS, but up until now I’ve never had a Deaf friend. This year I started college, and there’s a Deaf-mute person in my class. He uses an interpreter during lessons. Everyone has been nice to him, but no one really tried to get to know him or actually befriend him, so he wasn’t very close with anyone. (I’m not judging them for that, had I not already taken ASL in high school, I probably wouldn’t have learned just for him either)\n\nBut after I told him I knew some ASL and started signing with him, we naturally got close.\n\nSince September, I’ve been signing with him almost daily, and my signing has gotten sooooooo much better!!\n\nAnyway, about week ago, he suggested that I start taking ASL lessons again, and I joked “that’s what you’re for!”\n\nIt was absolutely a jok...",
        "reddit_judgments": {
            "YTA": 32,
            "NTA": 51,
            "ESH": 2,
            "NAH": 4,
            "INFO": 0,
            "TotalJudged": 89
        },
        "total_judged": 89,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-11T05:12:29.472162"
    },
    {
        "id": "1ot8jzb",
        "title": "AITA for buying my niece period panties",
        "url": "/r/AmItheAsshole/comments/1ot8jzb/aita_for_buying_my_niece_period_panties/",
        "body_summary": "My (30s F) brother in law is separated from his kids mother and last week they came into town to spend the weekend with us. Whenever they’re in town my husband and I usually let them spend the night at our house so they can spend time with our kids. \n\nWhile they were here my niece (11) got her period. I use a menstrual cup so I didn’t have any pads at all. When I asked her what kind her mom buys for her she didn’t really know and said that she doesn’t like pads because they feel weird and slide back sometimes and she ends up leaking on her pants. I told her that I had that issue a lot when I was her age and agreed that pads are sometimes really inconvenient. \n\nI asked if she wanted to try something different and she said yes. I told her that I thought she was a little young for tampons or ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 147,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 152
        },
        "total_judged": 152,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-11T05:12:47.432373"
    },
    {
        "id": "1otuwnx",
        "title": "AITA for refusing to visit the grandmother who blamed me for my father’s death?",
        "url": "/r/AmItheAsshole/comments/1otuwnx/aita_for_refusing_to_visit_the_grandmother_who/",
        "body_summary": "I’m a 21F, and my father passed away from cancer when I was three. My mother was pregnant with me when he fell ill, and after he died, my paternal family blamed me. They called me “bad luck,” treated me like I was responsible for everything that went wrong. My grandparents gave affection and support to my cousins and my older sister, but never to me while making it clear I didn’t belong.\n\nMy mother eventually took me away and raised me at her maternal home because she couldn’t stand how I was being treated. She worked long hours, so I spent most of my childhood alone, which left me with some deep abandonment issues. Even now, when I feel overwhelmed or unworthy, I end up distancing myself and ghosting people even friends who genuinely care. I hate that about myself, and I’m trying to work ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 132,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-11T05:13:03.904058"
    },
    {
        "id": "1otjk3z",
        "title": "AITA for not answering family calls while I was on vacation?",
        "url": "/r/AmItheAsshole/comments/1otjk3z/aita_for_not_answering_family_calls_while_i_was/",
        "body_summary": "I recently went on a vacation for the  first time in years. I told everyone beforehand that I would be taking a break from my phone and wouldn’t be available except for emergencies.\n\n\n\nDuring the trip, I kept receiving calls and texts about random updates, my aunt’s birthday, what my cousins were cooking, etc. I didn’t respond. When I got back, my mom said I was acting brand new and too good for family now.",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 39,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-11T05:13:04.287490"
    },
    {
        "id": "1ot8qj0",
        "title": "AITA for calling my friend out after he kept calling me a “fake Canadian”?",
        "url": "/r/AmItheAsshole/comments/1ot8qj0/aita_for_calling_my_friend_out_after_he_kept/",
        "body_summary": "I (Mid 20s M) recently became a Canadian citizen. I’m Indian, grew up in Dubai, and then moved to Canada for university and have been working there for about 6 years. I still am happy to be born an Indian, but I also feel proud and grateful to be Canadian now. I love Canada and its people a lot. \n\nI came back to Dubai to visit my dad. One of my old school friends, let’s call him Arjun, still lives here. When I texted Arjun the news that I’d finally gotten my citizenship, his first reply was, “You’re a fake Canadian.” I was surprised but replied jokingly and brushed it off.\n\nWhen we met up in person a few days later, he brought it up again, smiling and saying, “You’re still a fake Canadian.” This time I pushed back and asked why he kept saying that. He told me I’m “still just Indian” and th...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 104,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-11T05:13:20.533241"
    },
    {
        "id": "1otsxxf",
        "title": "AITA for not letting my 1-year-old step-niece into my room and for pulling her high chair away from the table?",
        "url": "/r/AmItheAsshole/comments/1otsxxf/aita_for_not_letting_my_1yearold_stepniece_into/",
        "body_summary": "I (21NB) live with my mom and stepfather. My room is messy, largely because I lack proper storage for my books and belongings. I also keep my door open for my cat, Boris, as his food, water, and litter box are in my room.\n\nThe issue is my stepsister’s visits with her 1-year-old daughter, Allie (fake name). Allie loves Boris, but he is clearly uncomfortable with her loud, eager approaches and always runs away. Since he retreats to my room, she follows him in there. Allie touches everything, grabbing trinkets, going for my plushies (many are expensive, limited edition, or deeply sentimental), and risking damage to my school laptop or textbooks. I’m worried she’ll break something or choke.\n\nI’ve repeatedly told my family I don’t want Allie in my room. My mom dismisses me, saying I should just...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 36,
            "ESH": 10,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 51
        },
        "total_judged": 51,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-11T05:13:37.178312"
    },
    {
        "id": "1ottz3c",
        "title": "AITA for not telling a man how his \"true love\" died?",
        "url": "/r/AmItheAsshole/comments/1ottz3c/aita_for_not_telling_a_man_how_his_true_love_died/",
        "body_summary": "My (36F) best friend, L (36F), passed away a few months ago. We were best friends since elementary school and had remained in constant contact through the years, even though I moved to another state for college and chose to remain in that state.\n\nWhen L passed, it was life shattering for me, her mother, and her other best friend she made as an adult. We became a grief trio who had to tell all of L's social and professional circle that she was no longer here. We didn't make any strict rules about what details to share about L's death, but we came to the consensus of just family and us two best friends would know the details because we knew that L was incredibly private. \n\nL's obituary posted about a week after her death, we shared it on her socials and fielded any questions. People were sat...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 25,
            "ESH": 0,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-11T05:13:52.904618"
    },
    {
        "id": "1otf6bm",
        "title": "AITA for not inviting my cousin to my wedding because she always turns everything into a photoshoot?",
        "url": "/r/AmItheAsshole/comments/1otf6bm/aita_for_not_inviting_my_cousin_to_my_wedding/",
        "body_summary": "My cousin (28F) isn’t even a professional influencer, but she shows up to every family event with a ring light, tripod, and multiple outfit changes. She makes everyone reshoot “candid” moments until she looks perfect and even stopped my parents’ anniversary cake-cutting once because “the lighting was bad.”\nI love her, but I don’t want that energy at my wedding. My mom says I’m being petty and that “family is family,” but I just want a normal, camera-free celebration and not make me and my remaining family members her unsaid reel characters!!!!\n\nAITA?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 15,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 18
        },
        "total_judged": 18,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-11T05:13:53.338013"
    },
    {
        "id": "1otxs4y",
        "title": "AITA for asking my husband to limit his time with his nephews because our daughters are missing out?",
        "url": "/r/AmItheAsshole/comments/1otxs4y/aita_for_asking_my_husband_to_limit_his_time_with/",
        "body_summary": "Hi, I had an issue yesterday with my husband which Im conflicted about, regarding whether I was in the wrong.\n\nMy husband and I have two daughters, 6 and 8. My SIL and her family live a couple of blocks away from us. They have two boys, both 9 years old. Her husband is in the army so he is away from home a lot.\n\nWhen he's away, the boys come to our house often. Theyre great boys, respectful and energetic. When they're here my husband takes them to the park to play soccer. They always say they have a great time and my SIL also thanks us for it.\n\nWhen they're not around, my husband takes our daughters to the park too, I often join them too, and they also look forward to it. However, when my husband takes the boys along, even though we encourage our girls to go along they told me they don't e...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 27,
            "ESH": 1,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-11T05:14:09.088346"
    },
    {
        "id": "1otiztg",
        "title": "AITA for refusing to put my dog down",
        "url": "/r/AmItheAsshole/comments/1otiztg/aita_for_refusing_to_put_my_dog_down/",
        "body_summary": "My dog is 17 years old, I have had him since he was a puppy and my entire adult life.  He is a little chihuahua Pomeranian mix and a very sweet and gentle soul. He is very healthy especially for a dog his age and, although you can clearly see he’s an old man, he has only shown signs of aging through partial loss of vision and hearing. He has been impressively housebroken for the duration of his life up until recently. He gets up out of his bed and just seems to go wherever he feels like it. When my husband and I are away, even for short durations, he is almost guaranteed to have an accident. He is still very mobile and verbal with a healthy appetite and joyful attitude. But now he just doesn’t care to wait when he has to “go”. I work from home and I am able to take him outside frequently w...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 78,
            "ESH": 1,
            "NAH": 13,
            "INFO": 2,
            "TotalJudged": 101
        },
        "total_judged": 101,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-11T05:14:26.500964"
    }
]