[
    {
        "id": "1mj5ykr",
        "title": "AITA for refusing to let my mom wear white to my wedding, even though she claims it’s her “last chance” to feel beautiful?",
        "url": "/r/AmItheAsshole/comments/1mj5ykr/aita_for_refusing_to_let_my_mom_wear_white_to_my/",
        "body_summary": "OP's mom bought a bridal-like white dress for OP's wedding, competing with OP. OP told her she couldn't wear it, offering to help her find another dress. Mom called OP controlling and now threatens to skip the wedding. AITA for refusing to let her wear the white dress?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 142,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-07T05:22:08.002617"
    },
    {
        "id": "1mj6has",
        "title": "AITA for refusing to translate for my parents after my brother moved back in and took over my role in the house ?",
        "url": "/r/AmItheAsshole/comments/1mj6has/aita_for_refusing_to_translate_for_my_parents/",
        "body_summary": "OP (19F) has always translated for her immigrant parents. Brother (22M) moved back, speaks some English, but parents still rely solely on OP. OP refused translating for an appt, suggesting her brother help. Parents and brother were upset. AITA for refusing to translate?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 136,
            "ESH": 2,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-07T05:22:11.090149"
    },
    {
        "id": "1mj0j0v",
        "title": "AITA FOR TELLING MY MOM I WILL BUY HER A HOME BUT MY BROTHER CAN NOT LIVE THERE EVER?",
        "url": "/r/AmItheAsshole/comments/1mj0j0v/aita_for_telling_my_mom_i_will_buy_her_a_home_but/",
        "body_summary": "OP (M35) offered to buy his parents (64) a house, but stipulated his brother (42) couldn't live there due to past lack of support. Mom questioned why OP wouldn't \"help\" his brother. OP feels unloved compared to his brother and expects guilt trips. AITA for setting this condition?\n...",
        "reddit_judgments": {
            "YTA": 24,
            "NTA": 51,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 79
        },
        "total_judged": 79,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-07T05:22:16.010331"
    },
    {
        "id": "1mjfh6g",
        "title": "AITA for refusing the sell the crystal I got from my grandmother",
        "url": "/r/AmItheAsshole/comments/1mjfh6g/aita_for_refusing_the_sell_the_crystal_i_got_from/",
        "body_summary": "OP's grandmother promised them a large crystal. After her death, OP received it. It's now valued at 5000 euros. Siblings want OP to sell it and split the money. OP refuses, honoring the grandmother's wishes. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 141,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-07T05:22:18.541927"
    },
    {
        "id": "1mj8ki5",
        "title": "AITA for refusing to be the \"family driver\" now that I have a car ?",
        "url": "/r/AmItheAsshole/comments/1mj8ki5/aita_for_refusing_to_be_the_family_driver_now/",
        "body_summary": "OP (24F) bought a car after saving for years. Her mom and sister, who don't drive, now expect her to drive them everywhere. OP tried setting boundaries, but they guilt-trip her. After OP refused to drive her sister to an interview due to an exam, she's being called selfish. AITA for refusing to be their chauffeur?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 95,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 98
        },
        "total_judged": 98,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-07T05:22:20.655225"
    },
    {
        "id": "1mjlxoo",
        "title": "AITA for not allowing my sister's fiancé to use my late father's guitar during their wedding, despite his belief that I'm being spiteful?",
        "url": "/r/AmItheAsshole/comments/1mjlxoo/aita_for_not_allowing_my_sisters_fiancé_to_use_my/",
        "body_summary": "OP refused to let her sister's fiancé use their deceased father's guitar at the wedding due to its sentimental value and fear of damage. The sister and fiancé are upset, accusing OP of being selfish. OP asks AITA for refusing.\n...",
        "reddit_judgments": {
            "YTA": 62,
            "NTA": 50,
            "ESH": 0,
            "NAH": 10,
            "INFO": 16,
            "TotalJudged": 138
        },
        "total_judged": 138,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-07T05:22:24.121430"
    },
    {
        "id": "1mj7w1w",
        "title": "AITA for not letting my 22 year old daughter move out with the cat",
        "url": "/r/AmItheAsshole/comments/1mj7w1w/aita_for_not_letting_my_22_year_old_daughter_move/",
        "body_summary": "Hi all. Some background. My daughter, 22, has moved out of my house to a city 2 hours away. She's working there and has a little apartment. We have a cat who is seven years old, bought \"for her\" when she was 15 but essentially is the family cat, I have done all the caretaking and paid for the cat her whole life. (My daughter of course loves and spends time with the cat, but has never looked after her. The cat is also bonded to my siamese and to our dog) So now she wants to take the cat to live with her, and I told her no, it's not best for the cat. This is an indoor only very timid lap type of cat who would likely be traumatized by a move like this. However my daughter says it is \"her\" cat and I can't hold it hostage. AITA for not letting her take the cat?",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 93,
            "ESH": 2,
            "NAH": 8,
            "INFO": 3,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-07T05:22:25.060910"
    },
    {
        "id": "1mj4ppe",
        "title": "AITA for taking my toddler on a free Hawaii vacation without my pregnant wife because she does not want to go?",
        "url": "/r/AmItheAsshole/comments/1mj4ppe/aita_for_taking_my_toddler_on_a_free_hawaii/",
        "body_summary": "Me, my pregnant wife and my toddler were offered a free trip to Hawaii by some of my family members. By the time the trip comes around, my wife will by 7 months pregnant. She does not want to go because she thinks she will be miserable and does not want to have to fit into a bathing suit. Our son is 3 years old and has never been to Hawaii and I think he (and myself) would really enjoy it. AITA if I tell my wife that's okay if she wants to stay home and relax, while I take our son to Hawaii for the week with my family. I of course would love to have her come and join us, but I don't think that just because she thinks she would be uncomfortable there should mean that I or our child have to miss out on a very rare opportunity. ",
        "reddit_judgments": {
            "YTA": 43,
            "NTA": 41,
            "ESH": 0,
            "NAH": 18,
            "INFO": 10,
            "TotalJudged": 112
        },
        "total_judged": 112,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-08-07T05:22:29.112738"
    },
    {
        "id": "1mjbwy4",
        "title": "AITA for calling my partner a dick and refusing to clean to her crazy high standards?",
        "url": "/r/AmItheAsshole/comments/1mjbwy4/aita_for_calling_my_partner_a_dick_and_refusing/",
        "body_summary": "OP and partner split chores. OP did his, except hoovering and minor tasks. Partner was upset at the undone tasks & kitchen mess (her job), saying she felt let down. OP felt unappreciated, called her a dick (apologized), and asked for understanding. Partner is now considering leaving. AITA?\n...",
        "reddit_judgments": {
            "YTA": 93,
            "NTA": 20,
            "ESH": 12,
            "NAH": 4,
            "INFO": 7,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-07T05:22:34.415821"
    },
    {
        "id": "1mjas3s",
        "title": "AITA for telling my step mother she can't come to my son's birthday?",
        "url": "/r/AmItheAsshole/comments/1mjas3s/aita_for_telling_my_step_mother_she_cant_come_to/",
        "body_summary": "OP's stepmom disregards their rules for gifts for their son, even being verbally abusive when confronted. Now, with OP's father sick, she plans to attend their son's party despite being uninvited. AITA for telling her not to come?\n...",
        "reddit_judgments": {
            "YTA": 30,
            "NTA": 24,
            "ESH": 14,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 75
        },
        "total_judged": 75,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-07T05:22:37.687438"
    }
]