[
    {
        "id": "1q76cob",
        "title": "AITA for snapping at my uncle after he kept calling me a girl because of my hair?",
        "url": "/r/AmItheAsshole/comments/1q76cob/aita_for_snapping_at_my_uncle_after_he_kept/",
        "body_summary": "I’m 19M and I have long, curly hair. I’ve been growing it out for a few years and I take care of it. I use conditioner, and I have leave ins and curl creams for when I need a little more styling as well. The brand I use has a little silhouette of a woman on it and is technically \"for\" women.\n\nLast week my girlfriend had a really stressful week, so I cooked her dinner. My parents wouldn't be coming home till late so I set up candles wrote her a card and tried to make it nice with flowers and stuff\n\nAs I was setting up my uncle (52) comes into the room. For context, he is bald and divorced, and currently living with us.\n\nHe looked around at the candles and said, “This looks like something a girl would set up.” I didn’t really respond, but he followed it with, “You do a lot of girly stuff for...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 133,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-09T05:17:55.216007"
    },
    {
        "id": "1q7480k",
        "title": "AITA I lent my friend a dress and she did not make an effort to return it",
        "url": "/r/AmItheAsshole/comments/1q7480k/aita_i_lent_my_friend_a_dress_and_she_did_not/",
        "body_summary": "My girlfriend rang me and asked if she could borrow a dress from me for her brother’s funeral a few weeks back. I lent her my only black dress which I also drove to her home about 45 minutes away. When I got there, her daughter saw the dress and told her mum that she would like to borrow the dress from her one day, she’s a size 18 and the dress is a size 6.\n\nAnyway, fast forward to the past Saturday when my father in law passed away and I asked for the dress back. Because I was unable to drive to their home to pick up the dress, and the mother is having difficulties driving at the moment, I asked if they could please send it to me via post.\n\nI didn’t receive a response but today my daughter offered to pick it up as I need it for the funeral tomorrow and I asked if they could leave it in th...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 23,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-09T05:18:11.077192"
    },
    {
        "id": "1q767m9",
        "title": "AITA: missing my cousins wedding for nursing school",
        "url": "/r/AmItheAsshole/comments/1q767m9/aita_missing_my_cousins_wedding_for_nursing_school/",
        "body_summary": "Apparently I'm selfish..\nMy cousin’s wedding is on April 11th, which unfortunately falls on the same day as the first day (orientation day) of my nursing school clinical rotation (mental health). According to my nursing program handbook, missing the first clinical day results in removal from the course and possible dismissal from the program. This isn’t flexible or negotiable. \nMy mother called me selfish and said I didn't care about the wedding. She said she hopes my cousin misses my wedding day. She told me to get away because she was upset and no longer wanted to talk. What I don't think my mother understands is.. This is my future career! I've been in school trying to become a nurse since 2022. I wish the dates didn’t conflict, and it genuinely sucks that I can’t be there. But I’m not ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 55,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-09T05:18:26.939310"
    },
    {
        "id": "1q73rz4",
        "title": "AITA for how I reacted during a migraine while my partner was already grieving?",
        "url": "/r/AmItheAsshole/comments/1q73rz4/aita_for_how_i_reacted_during_a_migraine_while_my/",
        "body_summary": "I’m posting because I genuinely don’t know if I handled this wrong and want outside perspective.\nThis morning, after dropping our son at school, I came home with a severe migraine. I’ve had migraines since I was about 10. When they hit, the pain can be extreme and can cause involuntary sounds, visible tension, and difficulty thinking or communicating.\n\nWhen I got home, I started taking out the trash. I know resting is usually better, but sometimes simple physical activity helps distract me from crying or screaming from the pain. I started alone.\n\nMy partner later came out and began helping. Earlier that morning, I had supported her emotionally because one of her chickens had died, and she was very upset. She had thanked me for being kind before I left for school drop-off.\n\nWhile tying tras...",
        "reddit_judgments": {
            "YTA": 22,
            "NTA": 25,
            "ESH": 8,
            "NAH": 8,
            "INFO": 3,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2026-01-09T05:18:43.889204"
    },
    {
        "id": "1q73gjp",
        "title": "AITA for Refusing to Skip Work for a Birthday Celebration I Never Asked For?",
        "url": "/r/AmItheAsshole/comments/1q73gjp/aita_for_refusing_to_skip_work_for_a_birthday/",
        "body_summary": "Tomorrow is my birthday, and I never planned to celebrate it because I already committed to working that day. I confirmed with management **back in December** that I would still be reporting to work on my birthday.\n\nOnly **today**, my girlfriend suddenly told me she had planned a small celebration because she decided it was a “special day” for me. I appreciated the thought, but the timing made it impossible. I still tried asking a coworker to cover my shift at the last minute, but management refused since the schedule was already finalized and couldn’t be changed on such short notice.\n\nNow my girlfriend is furious because her plans fell through, and instead of understanding the situation, she’s been taking her frustration out on me and cursing at me, even though I never asked for the celeb...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 16,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 18
        },
        "total_judged": 18,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-09T05:18:59.486073"
    },
    {
        "id": "1q7a891",
        "title": "AITA for not replying to my mom’s messages for a few hours and then snapping at her?",
        "url": "/r/AmItheAsshole/comments/1q7a891/aita_for_not_replying_to_my_moms_messages_for_a/",
        "body_summary": "Yesterday my mom called me while I (28F was sleeping and immediately started shouting at me for not responding to her messages. I could barely understand what was going on because I woke up from her yelling in the phone, but then I looked up the messenger and indeed there were 2 messages sent 3 hours ago.\n\nI tried telling her that this is stupid and that I can’t respond to her messages in my sleep. To which she said no one sleeps at that time of the day and that I can continue sleeping all I want, she doesn’t care. I was sleeping from 3 to 6-ish pm because I wasn’t feeling well.\n\nThere was a lot of back and forth messaging in the next 2 hours. My mom said that this is not the first time I’m not responding to the texts and that she’s fed up with my behavior because according to her I feel l...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 8,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 8
        },
        "total_judged": 8,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-09T05:19:14.939073"
    },
    {
        "id": "1q7e6g4",
        "title": "AITA - recycling cardboard",
        "url": "/r/AmItheAsshole/comments/1q7e6g4/aita_recycling_cardboard/",
        "body_summary": "So, this happened about two weeks ago - on Christmas Eve.\nOur city has no limit on cardboard recycling, and it is collected separate from cans/bottles - in case your city is different and that factors in your decision.\n\nOur recycling typically gets picked up between 1 and 3pm every Wednesday, with alternating weeks for type. On the 24th it was cardboard and we had a bunch in the garage I was going to put out when I finished work around 10am that day, I had a meeting to attend from 9-10 and had booked the entire day off but still had to attend this.\n\nDuring the meeting I heard loud music from outside around 930 how that seemed odd - it turns out that was the recycling guys coming early and moving at a fast pace because many people didnt have things out yet so they were not stopping at every...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 7,
            "ESH": 1,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-09T05:19:30.415380"
    },
    {
        "id": "1q7b1ks",
        "title": "AITA for being off with my mum after she guilt tripped me into looking at her \"parts\" for a medical problem?",
        "url": "/r/AmItheAsshole/comments/1q7b1ks/aita_for_being_off_with_my_mum_after_she_guilt/",
        "body_summary": "I (23M) am my mums (56F) carer. She has COPD and arthritis in both of her knees so she cannot walk or do much for long without being in pain or getting breathless, as well as being very overweight. We live together since its convenient for both of us. She told me that she had a pimple on her \"parts\" that she wanted me to take a look at because she wanted to know how bad it is. I told her that her request would make me uncomfortable, and instead suggested using the selfie option on her smartphone camera to help her get a look if she was struggling. Later that evening, she asked me 3 or 4 times to come look, insisting that she couldn't look on her own. I once again told her that this would make me uncomfortable, as I believe any child would, regardless the age. Im happy to do a lot of things...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 20,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 21
        },
        "total_judged": 21,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-09T05:19:45.928984"
    },
    {
        "id": "1q788wm",
        "title": "AITA for refusing to speak/interact with my dad?",
        "url": "/r/AmItheAsshole/comments/1q788wm/aita_for_refusing_to_speakinteract_with_my_dad/",
        "body_summary": "Hello. I will start by explaining the situation that occurred first and then I will provide some context.\n\n  \nThe incident in question took place a couple of years ago now, I think it was in 2021 or 2022, I can't quite remember. I was in the kitchen, tinkering with my PC on the kitchen table and my dad walks in. He asks me something, a yes or no question, I believe it was something along the lines of \"have you tried the new microwave yet?\". \n\n**The conversation went like this:** \n\n* Dad: \\[asks question\\]\n* Me: \\[doesn't respond\\]\n* Dad: Hello?\n* Me: \\[still doesn't respond\\]\n* Dad: HELLO?!\n* \\[A few seconds pass\\]\n* Dad: \\[yells as hard as he can at me in anger, a loud \"argh\" sound, basically\\]\n* Dad: \\[goes away to another room for about a minute\\]\n* Dad: \\[comes back to the kitchen\\]\n* ...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 5,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 13
        },
        "total_judged": 13,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-09T05:20:01.547574"
    },
    {
        "id": "1q78v5b",
        "title": "AITA for asking my groupmate not to remove my name from our research paper even if I can’t show up by Monday due to illness?",
        "url": "/r/AmItheAsshole/comments/1q78v5b/aita_for_asking_my_groupmate_not_to_remove_my/",
        "body_summary": "I’m part of a group research project, and recently I’ve been mostly unresponsive. I understand how that looks, but I want to explain the situation.\n\nFor the past week, I’ve been dealing with a high fever and I’m still not fully recovered. On top of that, my phone broke, so my communication has been very limited. I can only reply when I’m able to borrow my brother’s laptop, which isn’t always possible because he needs it for his own work.\n\nOne of my groupmates (who’s acting as the leader) told me that if I’m still not present by Monday, they’ll remove my name from the research paper. I tried to explain that I didn’t choose to be absent or unresponsive and that my situation is due to health issues and circumstances I can’t control. \n\nI also said that I’m willing to coordinate and make up for...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 3,
            "ESH": 1,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 17
        },
        "total_judged": 17,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-09T05:20:17.070516"
    }
]