[
    {
        "id": "1lfhxlp",
        "title": "AITA for calling out my sister in law for using her children to emotionally manipulate me into going to dinner “now” instead of waiting 45 minutes?",
        "url": "/r/AmItheAsshole/comments/1lfhxlp/aita_for_calling_out_my_sister_in_law_for_using/",
        "body_summary": "OP, 32, wanted to use a coupon to save money on dinner with spouse's family. SIL wanted to eat earlier, claiming kids were hungry. OP said SIL using kids to manipulate was pathetic. SIL retorted OP shouldn't have offered if they couldn't afford it. AITA for calling SIL pathetic?\n...",
        "reddit_judgments": {
            "YTA": 40,
            "NTA": 73,
            "ESH": 20,
            "NAH": 1,
            "INFO": 10,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-20T05:12:33.480165"
    },
    {
        "id": "1lfako2",
        "title": "AITA for using my college fund for a downpayment on a house",
        "url": "/r/AmItheAsshole/comments/1lfako2/aita_for_using_my_college_fund_for_a_downpayment/",
        "body_summary": "OP's brother gambled away his college fund. Parents want OP, who has a scholarship and substantial savings in *their* college fund, to help brother. OP refused, planning to use the money for a house down payment. Parents are now not speaking to OP. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 152,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 154
        },
        "total_judged": 154,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-20T05:12:37.688911"
    },
    {
        "id": "1lf7m73",
        "title": "AITA for not telling her why her dad doesn’t plan to make her his successor?",
        "url": "/r/AmItheAsshole/comments/1lf7m73/aita_for_not_telling_her_why_her_dad_doesnt_plan/",
        "body_summary": "OP tutors 'Uncle B's son, knowing the dad favors him for the banana business due to D being female. D confronted her dad and learned the reason. D is upset OP knew this bias and didn't warn her. AITA for keeping silent?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 25,
            "ESH": 2,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-20T05:12:39.028866"
    },
    {
        "id": "1lfnln7",
        "title": "AITA for refusing to be an unpaid maid for my BFF? Am I wrong for telling her her expectations should be that her husband cleans THEIR house? Am I wrong for saying she should be grateful for the help I'm offering, not expect more?",
        "url": "/r/AmItheAsshole/comments/1lfnln7/aita_for_refusing_to_be_an_unpaid_maid_for_my_bff/",
        "body_summary": "OP offered to help their pregnant friend, but the friend's C-section moved the date up. Friend now expects OP to clean the house during their visit while husband bonds with the baby. OP refuses, seeing it as a holiday (time off work) not full-time housework. AITA for not meeting friend's expectations?\n...",
        "reddit_judgments": {
            "YTA": 32,
            "NTA": 88,
            "ESH": 16,
            "NAH": 9,
            "INFO": 2,
            "TotalJudged": 147
        },
        "total_judged": 147,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-20T05:12:43.238696"
    },
    {
        "id": "1lfnrem",
        "title": "AITAH For saying my children will not be going to FIL's funeral.",
        "url": "/r/AmItheAsshole/comments/1lfnrem/aitah_for_saying_my_children_will_not_be_going_to/",
        "body_summary": "FIL died. Estranged relatives, including OP's disliked MIL, plan to attend the funeral. OP won't bring his daughters (who've never met them) unless they apologize for past actions. Relatives guilt-trip OP. AITA for refusing attendance without an apology?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 101,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-20T05:12:45.174309"
    },
    {
        "id": "1lfga61",
        "title": "AITA for not hiring my cousin at my startup?",
        "url": "/r/AmItheAsshole/comments/1lfga61/aita_for_not_hiring_my_cousin_at_my_startup/",
        "body_summary": "OP's aunt wants OP to hire her jobless son. OP offered an interview, but the cousin hasn't contacted OP. Aunt demands OP offer him a job, claiming \"family\" obligations and accusing OP of promising a job which stopped her son from applying elsewhere. OP refuses. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 61,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-20T05:12:46.646628"
    },
    {
        "id": "1lfdyhg",
        "title": "AITA for taking back the car I let my sister use after my own car was totaled?",
        "url": "/r/AmItheAsshole/comments/1lfdyhg/aita_for_taking_back_the_car_i_let_my_sister_use/",
        "body_summary": "OP financed a Mini for his sister, payments later shifted to parents. OP financed a Tesla under parents' name (they kept tax credit). Tesla totaled, OP needs a car. OP wants the Mini back from sister, who's still using it, to finish payments. AITA for taking back the Mini?\n...",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 7,
            "ESH": 13,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-06-20T05:12:47.935862"
    },
    {
        "id": "1lfclh7",
        "title": "AITA for trying to change my name",
        "url": "/r/AmItheAsshole/comments/1lfclh7/aita_for_trying_to_change_my_name/",
        "body_summary": "OP wants to legally change her complicated, culturally-linked name to her mother's simpler surname. Her father is deeply upset, accusing her of rejecting her heritage and being influenced by her mother. OP feels guilty but prefers the new name. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 28,
            "ESH": 0,
            "NAH": 4,
            "INFO": 2,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-20T05:12:49.228588"
    },
    {
        "id": "1lfico8",
        "title": "AITA for telling my wife's twin sister to stop asking my daughter to call her mom",
        "url": "/r/AmItheAsshole/comments/1lfico8/aita_for_telling_my_wifes_twin_sister_to_stop/",
        "body_summary": "40 M married to indian women 42 F who has an identical twin sister. Ever since , we got married , the twin tries to interfere too much into our marriage. It started with the twin giving me directions on how to live my married life and extended to where I should live or what house I should buy. This has been going on for years. I am blessed with a daughter and the twin wants to be called as mother as well. It may be harmless but annoys the hell out of me. This twin has  a weird control over my wife and am worried she will have the same control over my daughter as well. Thankfully my daughter refuses to listen. AITAH in asking my wife's sister to stop forcing my daughter to call her mommy?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 25,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-20T05:12:49.665520"
    },
    {
        "id": "1lfh018",
        "title": "AITA for not getting my boyfriend a birthday present?",
        "url": "/r/AmItheAsshole/comments/1lfh018/aita_for_not_getting_my_boyfriend_a_birthday/",
        "body_summary": "OP's broke & didn't buy BF a bday gift, instead made food, cleaned his house, planned a party. BF is upset, saying it's about the gesture. OP asks AITA for not buying a gift?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 127,
            "ESH": 0,
            "NAH": 12,
            "INFO": 1,
            "TotalJudged": 142
        },
        "total_judged": 142,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-20T05:12:51.913679"
    }
]