[
    {
        "id": "1m4hc1a",
        "title": "AITA for calling myself infertile when I can get pregnant?",
        "url": "/r/AmItheAsshole/comments/1m4hc1a/aita_for_calling_myself_infertile_when_i_can_get/",
        "body_summary": "OP, born with a defect causing a stomach scar, can technically get pregnant but carrying to term is deadly. At work, a coworker argued OP isn't infertile, accusing OP of disrespecting \"real\" infertile women due to OP not wanting kids. OP asks AITA for calling themselves infertile.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 137,
            "ESH": 1,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 142
        },
        "total_judged": 142,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-21T05:20:32.963689"
    },
    {
        "id": "1m52myo",
        "title": "AITA for telling my roommate's friend about my heritage?",
        "url": "/r/AmItheAsshole/comments/1m52myo/aita_for_telling_my_roommates_friend_about_my/",
        "body_summary": "OP, half Mexican/Chinese, spoke Spanish on the phone while cooking. Roommate Ann's friend asked about her background; they chatted. Ann accused OP of showing off/flirting. OP confronted Ann, who dismissed her. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 154,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 155
        },
        "total_judged": 155,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-21T05:20:36.629008"
    },
    {
        "id": "1m4zqq3",
        "title": "AITA for telling my friend he’s not even close to as handsome as my boyfriend?",
        "url": "/r/AmItheAsshole/comments/1m4zqq3/aita_for_telling_my_friend_hes_not_even_close_to/",
        "body_summary": "OP told her BF's friend, who constantly mocks the BF's looks, that he's not as handsome as the BF. The friend was hurt, and now OP wonders if she was the asshole for the comment.\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 98,
            "ESH": 1,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 113
        },
        "total_judged": 113,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-21T05:20:38.766253"
    },
    {
        "id": "1m4rhp0",
        "title": "AITA for threatening to kick my friend’s gf out of my car for smoking weed in my car?",
        "url": "/r/AmItheAsshole/comments/1m4rhp0/aita_for_threatening_to_kick_my_friends_gf_out_of/",
        "body_summary": "My friend’s car broke down today so I drove him and his gf to downtown. It takes about thirty minutes to get there. A few minutes after we started driving she started smoking weed in my car. I politely asked her to stop since my sister likes to use my car sometimes. She stopped, but she started doing it again. I politely reminded why I can’t have a weed smell and she stopped. But when we were ten minutes away she started smoking again and I told her if she kept smoking weed I was going to kick her out. I didn’t raise my voice but she started crying. My friend said it was not a big deal because we were not in the car for very long, but I did not see it that way. So Reddit, aita for wanting my car to smell clean?",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 140,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 143
        },
        "total_judged": 143,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-21T05:20:40.807682"
    },
    {
        "id": "1m4vkom",
        "title": "AITA because I refused to finish a cake my mom bought me (21m)?",
        "url": "/r/AmItheAsshole/comments/1m4vkom/aita_because_i_refused_to_finish_a_cake_my_mom/",
        "body_summary": "She said she's broken to me because I refused to eat the food considering what she did to it.\n\nWe where in IKEA, she spent a whole day touching everything and when we were sharing a cake she got crumbs on her hands and decided to pat them off back onto the said cake.\n\nI then asked her if she had washed her hands and she said rather defensively \"at home before we left\"\n\nI then refused to finished the cake and now as we returned home she ran into her room when we got back and doesn't want to speak to me.\n\nShe's 51 for god fucking sake.",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 59,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-21T05:20:41.682884"
    },
    {
        "id": "1m527cz",
        "title": "AITA for wanting my parents to pay me the money back that my brother stole from me",
        "url": "/r/AmItheAsshole/comments/1m527cz/aita_for_wanting_my_parents_to_pay_me_the_money/",
        "body_summary": "OP's brother steals from them. OP leaves cash in their room/wallet, which the brother takes. Parents blame OP. OP wants parents to reimburse stolen money, but isn't sure if they're the asshole for asking.\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 90,
            "ESH": 5,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 98
        },
        "total_judged": 98,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-21T05:20:43.556910"
    },
    {
        "id": "1m55cx7",
        "title": "AITA for telling my stepmother she lost all my respect?",
        "url": "/r/AmItheAsshole/comments/1m55cx7/aita_for_telling_my_stepmother_she_lost_all_my/",
        "body_summary": "OP, 18M, finally earned the right for his gf to visit after his stepmother initially banned her. His stepbrother then snuck his troubled gf into the house, causing OP's dad to install cameras. Step-mother now bans OP's gf too, citing \"fairness.\" OP confronted her and his dad, saying he'll remember their actions. Stepbrother calls OP a jerk. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 39,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-21T05:20:45.140768"
    },
    {
        "id": "1m4i3hf",
        "title": "AITA for telling my roommate I won’t won’t pay for her meals any more",
        "url": "/r/AmItheAsshole/comments/1m4i3hf/aita_for_telling_my_roommate_i_wont_wont_pay_for/",
        "body_summary": "OP paid for a nice dinner, but roommate Kate ordered excessively, ate little, & wasted the expensive leftovers. OP demanded Kate eat the leftovers or pay $70. Kate got angry. AITA?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 47,
            "ESH": 8,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 64
        },
        "total_judged": 64,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-21T05:20:47.202945"
    },
    {
        "id": "1m4wy8h",
        "title": "AITA for snapping at my cousin after she read a poem at my dinner",
        "url": "/r/AmItheAsshole/comments/1m4wy8h/aita_for_snapping_at_my_cousin_after_she_read_a/",
        "body_summary": "OP's cousin Camila is the family favorite, always getting attention. At OP's uni celebration, Camila read a poem, making it about herself. OP snapped, accusing Camila of attention-seeking. Family is angry. AITA for ruining the dinner?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 34,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-21T05:20:48.628058"
    },
    {
        "id": "1m553gt",
        "title": "AITA for “platonically cheating” on my best friend?",
        "url": "/r/AmItheAsshole/comments/1m553gt/aita_for_platonically_cheating_on_my_best_friend/",
        "body_summary": "OP (f19) is going on a trip with course mates. Best friend, Matt (m19), is upset she's spending time/money on newer friends instead of him, calling it \"platonic cheating.\" OP laughed, now Matt's ignoring her. OP doesn't want to apologize. AITA for choosing trip with new friends?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 60,
            "ESH": 0,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-21T05:20:50.580748"
    }
]