[
    {
        "id": "1rb2gak",
        "title": "AITAH for phone use in locker room",
        "url": "/r/AmItheAsshole/comments/1rb2gak/aitah_for_phone_use_in_locker_room/",
        "body_summary": "My wife (28F) and I (29F) take our son (2M) to the pool every Saturday morning for swim class. After class, I change first and my wife showers our son and then I change him while she gets changed. I changed my son and gave him a snack. He was pretty wiggly and wanting to run all over the locker room. I can’t take him to the lobby or he will cry for mom. So I took him into one of the private changing stalls and closed the curtain half way. The view to the locker room from the stalls is only the sinks in the bathroom. There were plenty of changing stalls available. I turned a YouTube kids thing on the lowest volume and set it on his lap on the chair while I packed the bag. My wife was changing in the main locker room. A lady came over from the sink and told me to put my phone away. I asked i...",
        "reddit_judgments": {
            "YTA": 141,
            "NTA": 14,
            "ESH": 12,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 167
        },
        "total_judged": 167,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-22T05:43:37.629389"
    },
    {
        "id": "1rb3kop",
        "title": "AITA for leaving the plane before the lady in row 1 did?",
        "url": "/r/AmItheAsshole/comments/1rb3kop/aita_for_leaving_the_plane_before_the_lady_in_row/",
        "body_summary": "I came home last night on a flight. There was a woman in row 1, and I was in row 4. I'd just come off a really lovely cruise, but for some reason, both my legs became horribly hard, swollen, and painful. I'm disabled, and had already requested a wheelchair on the way to my gate and from it when we landed, but I was in WAY more pain than normal.\n\nThe plane landed, and the lady in row 1 got up and headed past me towards the back of the plane. All I saw was her making her way backwards. I got up after that and got in the aisle right after that. The airplane seat was making my pain worse, and even though I requested a wheelchair, it doesn't always mean you'll get one before they run out, so I had to book it.\n\nTurns out for some reason, the other lady's luggage was halfway down the plane, which...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 82,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 87
        },
        "total_judged": 87,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-22T05:43:45.918190"
    },
    {
        "id": "1rawmmy",
        "title": "AITA for driving away while waiting for my wife, making her think I was leaving her?",
        "url": "/r/AmItheAsshole/comments/1rawmmy/aita_for_driving_away_while_waiting_for_my_wife/",
        "body_summary": "I need some outside perspective on a massive misunderstanding between my wife and me.\n\nWe had plans to go out, and I was waiting for her in my car inside her building’s parking lot. Suddenly, another car needed to exit, and I was completely blocking the way. I couldn't just sit there obstructing traffic, so I had to pull out of the lot.\n\nMy plan was to wait just outside the building. However, there was another car blocking the closest spot where I could pull over. I drove a little further up to find another spot, but right as I got there, another car took it. Because of the traffic and the layout of the street, I had absolutely no choice but to keep moving and drive around the entire block.\n\nThe problem is, exactly when I drove off, my wife came out. She saw me driving away and immediately...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 37,
            "ESH": 2,
            "NAH": 2,
            "INFO": 8,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-22T05:43:54.193662"
    },
    {
        "id": "1rasbjw",
        "title": "WIBTA for not dropping out as my ex-brother-in-law's groomsman.",
        "url": "/r/AmItheAsshole/comments/1rasbjw/wibta_for_not_dropping_out_as_my_exbrotherinlaws/",
        "body_summary": "For some backstory leading into this, my ex and I started dating back in 2019 as HS sweethearts. We got engaged a couple years later, then married a year after that (2022), when we were 21/20. Ever since we started dating, I would hang out with her little brother (he's 4 years younger than me, we'll call him “BIL”), support him at his football games, and hang out one on one. He was one of my groomsmen at the wedding and went to the bachelor's party, aka big camping trip, and he truly was/is just one of the boys.  \n\nLast year, in June 2025, despite me thinking our marriage was doing great, my ex confessed that she had been dissatisfied the entire time, and rushed into it too young. She reiterated that I didn't do anything wrong, that I'd been a great husband, we just were too incompatible. ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 48,
            "ESH": 0,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-22T05:44:02.335110"
    },
    {
        "id": "1rawqwx",
        "title": "AITA for not lying about skipping a grade?",
        "url": "/r/AmItheAsshole/comments/1rawqwx/aita_for_not_lying_about_skipping_a_grade/",
        "body_summary": "I (16F) skipped junior year (based on credits), so I'm a senior and graduating at 16. I have a summer birthday, so I don't turn 17 until after graduation. My main friend group was already all seniors because of extracurriculars and such. It wasn't an issue before, but now it seems like one friend in particular is annoyed by it? Whenever M, A, and I go out, M tells me to say I'm a junior, lie about my age, or say I started school early and not that I skipped a grade if anybody asks. When I asked why, she just claimed it makes me look dorky and her and A look stupid by comparison. I don't try to bring it up, but when age/grade/school stuff comes out, I'm not going to lie (but saying you're 16 and then saying you're a senior always raises questions). I told her I wasn't going to lie, but I wo...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 52,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-22T05:44:10.201142"
    },
    {
        "id": "1rb0nqx",
        "title": "AITA for taking away my daughter's driving priviledges after she got into 2 accidents.",
        "url": "/r/AmItheAsshole/comments/1rb0nqx/aita_for_taking_away_my_daughters_driving/",
        "body_summary": "I’m in my mid-40s and have a daughter 21 in college for CS and a son 23 who still lives with me. My son recently bought a truck. I and my parents gifted him part of the funds but he bought it himself since he’s learning HVAC and needs something practical. My daughter has been using a 2010 Corolla we had because she said she didn’t really want a new car at the time, and after graduating might move to NYC and not need one as she did her internship there.\n\n\nShe’s been in two accidents with it. The first time she came home with damage and said she found it like that when it was parked. The police registered it as a hit-and-run. Then recently she got rear-ended and the driver fled according to her. While technically it wasn’t her fault I honestly think she might have stopped suddenly or backed ...",
        "reddit_judgments": {
            "YTA": 162,
            "NTA": 0,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 166
        },
        "total_judged": 166,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-22T05:44:21.858661"
    },
    {
        "id": "1rb32kp",
        "title": "AITA? I lent my cousin my dead dad's tools. My dad was my hero and I value his tools. I had him sign for them and without telling me, he's been very salty ever since.",
        "url": "/r/AmItheAsshole/comments/1rb32kp/aita_i_lent_my_cousin_my_dead_dads_tools_my_dad/",
        "body_summary": "My dad died over two decades ago.  He was a mechanic and had all nice tools, even by today's standards.  My narcissistic mom tried to sell them while I was away.  You can use pliers, screwdrivers, wrenches, and other tools around the house.  Every time I use them, I fondly remember my dad and all of the good times we had together, fixing our cars and things around the house.  \n\nMy cousin was working on an old car and didn't have many good tools.  I thought, \"Well, no one is using these tools and they could be put to good use, restoring that car.\"  His wife and I didn't get along well until a few years ago.  Something happened, I took the high road, and helped her out.  Now we get along.  But, I think if something happened to my cousin, she would sell off his tools and stuff, my dad's tools...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 14,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 15
        },
        "total_judged": 15,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-22T05:44:29.700313"
    },
    {
        "id": "1rb9v5b",
        "title": "AITA for not wanting to call my step niece and nephew my brother and sister",
        "url": "/r/AmItheAsshole/comments/1rb9v5b/aita_for_not_wanting_to_call_my_step_niece_and/",
        "body_summary": "Ok, this is going to be a bit to explain but here goes nothing.\n\nSo I (28F) have a niece (20F) and nephew (14M) who are related to me by marriage. My Dad married their grandma. My stepmom has 3 daughters of her own who are roughly 10 years older than me. The oldest being the mother of the grandkids.\n\nNow this is where it gets tough. My stepmom, we'll call her Stella, was never great. A little backstory, my parents got divorced when I was 16 and my dad met Stella less than 6 months later. They were married by the time I was 18. She spent most of her time making my dad choose between her and I and was always nasty to me, but very behind the scenes so my dad never fully saw it. \n\nAnyways... fast forward a couple years and her eldest is in deep shit. She has remarried, had some form of drug ab...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 21,
            "ESH": 1,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-22T05:44:37.417768"
    },
    {
        "id": "1raymkx",
        "title": "AITA for trying to protect my sister?",
        "url": "/r/AmItheAsshole/comments/1raymkx/aita_for_trying_to_protect_my_sister/",
        "body_summary": "This is going to be short, I just wanna know if I’m the asshole for trying to protect my sister. So my sister is very modest and gentle. The type that would never hurt a fly. She lives in another state but we talk everyday about literally everything, we’re that close.\n\nShe has a roommate who I’m sure is taking advantage of her kind heart because she pays for almost everything they use, her roommate only contributes to little things whenever she feels like. Now the problem is that she loves making reservations at extremely expensive restaurants to hangout with my sister and their ‘friends’ and they always let my sister take care of the bills alone, if it’s not forgetting purses it’s directly telling her to take care of it as she makes far more than them. One time her roommate even invited h...",
        "reddit_judgments": {
            "YTA": 34,
            "NTA": 6,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-22T05:44:45.315892"
    },
    {
        "id": "1rappgd",
        "title": "AITA for kicking my sister's bf out of my apartment",
        "url": "/r/AmItheAsshole/comments/1rappgd/aita_for_kicking_my_sisters_bf_out_of_my_apartment/",
        "body_summary": "my sister (19f) and me (21f) live in the same 2bedroom apartment for more than a year now. last year September my sister and her boyfriend (19m) got together and at first he came over for movies or dinners, sometimes she goes to his apartment and stays there. I didn't mind if she decides to stay at his place and him stay at our place sometimes.\n\nbut it starts to be annoying when he stayed at our apartment everyday. he did not once go back to his apartment for a whole month even. and on top of that he likes to slam doors and pees while the door is open, never throws the trash out or wash his own dishes. he has no manners and walks around our apartment half naked a lot. I told my sister so many times, he is not allowed to stay for too long because in the end of the day, this is mine and her ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 18,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 21
        },
        "total_judged": 21,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-22T05:44:52.985309"
    }
]