[
    {
        "id": "1rf3hg6",
        "title": "AITA for NOT acting wealthy",
        "url": "/r/AmItheAsshole/comments/1rf3hg6/aita_for_not_acting_wealthy/",
        "body_summary": "Hi, I’m 20f and come from a very wealthy new money family. I went to a public primary school, but by the age of 10 my family had become multimillionaires. My older brother went to a private secondary school but I cried to my parents that I didn’t want to leave my friends at the time so begged them to send me to the public one instead. At this high school I met my now best friends. It’s important to know my family doesn’t flex their wealth. We do live in a rather large house, and we do drive nice cars but other than that the only real sign of wealth would be the amount of gold I wear.\n\nI grew up knowing I was privileged. My friends would always bring up their financial struggles and I tried my best to help them by always paying whenever we went out and stuff but I obviously couldn’t solve t...",
        "reddit_judgments": {
            "YTA": 67,
            "NTA": 22,
            "ESH": 3,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 97
        },
        "total_judged": 97,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-27T05:44:00.139941"
    },
    {
        "id": "1rfnjqg",
        "title": "AITA for dyeing the sweater my sister in law knitted for me?",
        "url": "/r/AmItheAsshole/comments/1rfnjqg/aita_for_dyeing_the_sweater_my_sister_in_law/",
        "body_summary": "My sister in law (my brother’s wife) offered to make me a sweater. I am also a knitter and I understand the time and effort that goes into a project. I said yes, but asked if I could pick out the color and also said I would happily pay for the yarn. She declined and said she wanted it as an excuse to use up her stash. She is a big time “tee hee I have a stash beyond life expectancy!” type. \n\nShe finished the sweater for me, and it fit great but was in a beige color that I would never wear. I’m a soft autumn who favors plums, roses, terra cottas, olives, etc. I don’t like plain colors very much. But I loved the look of the sweater, so I ended up dyeing it to a pretty green. I reach for it all the time. \n\nI wore it when I was hanging out with family, and she was there. She said it looked lik...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 159,
            "ESH": 3,
            "NAH": 4,
            "INFO": 0,
            "TotalJudged": 167
        },
        "total_judged": 167,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-27T05:44:10.952470"
    },
    {
        "id": "1rfov0p",
        "title": "AITA for treating my daughters differently than my son when it comes to food?",
        "url": "/r/AmItheAsshole/comments/1rfov0p/aita_for_treating_my_daughters_differently_than/",
        "body_summary": "I have two daughters (18 and 17) and a son who is 15. We are not a wealthy family by any means. I don't want to go into too much detail, but I think it would be fair to say that we're basically working class. I have very little room to splurge and am still paying off a mortgage and some debts (incurred after a death in the family). As such things are very tight.\n\nMy son is currently going through a stage where he basically eats everything. He eats such large quantities that if I'm not careful, meals I've cooked that are supposed to last a week are only lasting a day or two. I can't afford to keep replenishing all the food he eats, while also feeding my daughters. \n\nSo I decided to put a restriction on him. He can eat what he's served, and he can have a certain amount of snacks. Anything el...",
        "reddit_judgments": {
            "YTA": 105,
            "NTA": 19,
            "ESH": 1,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 131
        },
        "total_judged": 131,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-27T05:44:32.414484"
    },
    {
        "id": "1rfh7kf",
        "title": "AITA for picking at my DIls food and not clearing my plate.",
        "url": "/r/AmItheAsshole/comments/1rfh7kf/aita_for_picking_at_my_dils_food_and_not_clearing/",
        "body_summary": "IM NOT WHITE, IM MIXED…  \n\n\nMy DIL is Indian ( this is relevant) and I have never liked Indian food. It is fine but I really don’t go out of my way to eat it.\n\nMy son and DIL host dinners sometimes and when I go I grab a plate and just eat a bit. Usually I will grab something on my way home if I am super hungry afterwards. \n\nThis has never been an issue before until yesterday. We went over for dinner and she made a green curry. I took some rice and some curry and ate a bit of it. I didn’t take too much. It was very herby and I just didn’t like it. \n\nI went to help clean up and DIL made a comment that I didn’t clear my plate. I just told her I wasn’t very hungry and I thought that was it.\n\nShe texted me yesterday about how it was disrespectful to not finish my plate and i am not welcome bac...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 100,
            "ESH": 8,
            "NAH": 2,
            "INFO": 8,
            "TotalJudged": 124
        },
        "total_judged": 124,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-27T05:44:47.247312"
    },
    {
        "id": "1rflc1f",
        "title": "AITA for reminding my friend that she slept with more than one person?",
        "url": "/r/AmItheAsshole/comments/1rflc1f/aita_for_reminding_my_friend_that_she_slept_with/",
        "body_summary": "A friend of mine recently met this new guy and he’s pretty conservative. Ever since then she’s adopted a lot of conservative talking points and has become obsessed with purity and innocence. She posted on her social media story the other day that anyone who sleeps with multiple people is a sl*t and should be ashamed of themselves. I replied telling her I’m surprised she’s saying this because she’s told me about having sex with a few other guys before. She’s even teased me for being a virgin. She got really upset and then said I remembered wrong and then went on a rant about how I’m trying to throw her past into her face. AITA for asking her this? \n\nEdit\nI didn’t call her out publicly. My reply was through a private message. ",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 125,
            "ESH": 3,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 139
        },
        "total_judged": 139,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-27T05:44:48.944914"
    },
    {
        "id": "1rf51f3",
        "title": "WIBTAH If Ivsaid no to cooking for a wfriends wedding?",
        "url": "/r/AmItheAsshole/comments/1rf51f3/wibtah_if_ivsaid_no_to_cooking_for_a_wfriends/",
        "body_summary": "So, I'm a professional chef, and I throw little dinner parties for friends to keep cooking fun, not just work. It's how I stay connected to the joy of it. A friend asked me to cater their wedding, assuming I'd do it for free and acting like it was an honor. I get that being part of a wedding is an honor, but cooking for 30+ people is way more work than an honor.\n\nHere's the kicker: we're in a social athletic group. He asked me in front of everyone, literally saying, \"no pressure, but would you be willing to do this?\" Bullshit, \"no pressure \" he should have asked me in private, don't you think?\n\nI took a moment to explain what it would take to produce something like this, he was not listening and kept saying \" all that matters is that we are getting married\".... hey that's great but you'll ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 122,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 123
        },
        "total_judged": 123,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-27T05:44:58.548429"
    },
    {
        "id": "1rfprzg",
        "title": "AITA for having and using emergency spices at dinner?",
        "url": "/r/AmItheAsshole/comments/1rfprzg/aita_for_having_and_using_emergency_spices_at/",
        "body_summary": "I (28M) was raised by my parents to always smile and stomach it when I’m a guest in someone’s house and they serve food that I didn’t enjoy. I’ve carried this into adulthood because I think it’s just eatpolite. If I really don’t like a meal I’m served, I’ll just eat a little bit of it and maybe grab food on the way home. But recently I was in a store and found little tiny bottles of the spice Tajin, which I love. They were 50 cents so I got like 12 of them and now when I have a bad meal I just wait for attention to be away from me and pop a dose of tajin in and that masks whatever flavor I don’t like. \n\nRecently I was at a family gathering and my aunt served this weird concoction of chicken sausage, peppers, and onions in a cream sauce on plain white rice. It tasted both bland and weird. S...",
        "reddit_judgments": {
            "YTA": 36,
            "NTA": 23,
            "ESH": 2,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-27T05:45:07.147482"
    },
    {
        "id": "1rfbvti",
        "title": "AITA - I'm apparently a terribly unsafe driver, but he still expects me to pick him up?",
        "url": "/r/AmItheAsshole/comments/1rfbvti/aita_im_apparently_a_terribly_unsafe_driver_but/",
        "body_summary": "My husband (43) and I (39) are in the midst of an argument and I need to know if I'm in the wrong.\n\nBack story, my husband grew up in a large city where he used his bike or public transportation to get everywhere, he never learned how to drive. I grew up in a small town, and got my drivers licence on my 16th birthday. 5 years ago during COVID we left the city, and bought a small townhouse about an hour way. We were both fully remote then, but now he has to go into the office 2 days a week. We're a 15 min drive from the commuter train, which takes 45 minutes. In the morning he takes an uber to the station. We have an 8 year old, so I get her up, lunch made, dropped off at school, etc. Kiddo is in aftercare, so I pick kiddo up around 5-5:30, and if husband is downtown we head to the train st...",
        "reddit_judgments": {
            "YTA": 85,
            "NTA": 20,
            "ESH": 65,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 170
        },
        "total_judged": 170,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-27T05:45:18.648131"
    },
    {
        "id": "1rfcjdy",
        "title": "AITA for making my brother wash his own uniforms after school?",
        "url": "/r/AmItheAsshole/comments/1rfcjdy/aita_for_making_my_brother_wash_his_own_uniforms/",
        "body_summary": "My (21F) brother (13M) is always babied by my mother. She does not want him to do anything on his own. My mum got into an accident a few years ago and is now suffering from a fractured spine that healed wrongly. So, she can't really do everything for him. She still tries, but most of the time she is in pain so she makes me do it, I refuse and then we all fight. Thats how it had always been in my house. I do adore my brother, but he also piss me off.\n\nIn my country, 13 is the age where you leave primary school and go to secondary school, which I would say is a crucial part in life. My mum talked to me and asked me to take care ph him. She said she can't take care of him properly since she is not as well as before. I agreed, but also said that I would put my own rules. \n\n1) Everything relate...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 43,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 43
        },
        "total_judged": 43,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-27T05:45:26.517249"
    },
    {
        "id": "1rf8j7a",
        "title": "AITA for telling my roommate her boyfriend needs to chip in for utilities if he's here most nights?",
        "url": "/r/AmItheAsshole/comments/1rf8j7a/aita_for_telling_my_roommate_her_boyfriend_needs/",
        "body_summary": "I'm 36M and I live with my roommate (30F). We split rent 50/50 and utilities 50/50.\n\nFor the last couple of months, her boyfriend has been over about 5-6 nights a week. He showers here, cooks here, and does laundry here. He's also started spending daytime here pretty often. It feels like we basically have a third person living here most of the week.\n\nOur electric and water bills have gone up. I brought it up calmly and asked if we could either limit overnights to a few nights a week or have him chip in for utilities since he's here so much. I suggested a simple split like making utilities closer to 1/3 each if he's here more than half the week.\n\nShe got upset and said I'm being controlling and \"counting nights\", and that she pays her share so she can have guests whenever she wants. I told ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 74,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 76
        },
        "total_judged": 76,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-27T05:45:34.714214"
    }
]