[
    {
        "id": "1kyzdyc",
        "title": "AITA for calling out my kid's teacher for talking down to me?",
        "url": "/r/AmItheAsshole/comments/1kyzdyc/aita_for_calling_out_my_kids_teacher_for_talking/",
        "body_summary": "OP, an electrician, attended a parent-teacher conference in work clothes. The teacher spoke to him condescendingly. OP confronted her about judging intelligence based on appearance. His wife thinks he overreacted. AITA?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 110,
            "ESH": 1,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 119
        },
        "total_judged": 119,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-31T05:10:47.185792"
    },
    {
        "id": "1kzbn3v",
        "title": "AITAH for telling my parents that they neglected me because of my brothers illness?",
        "url": "/r/AmItheAsshole/comments/1kzbn3v/aitah_for_telling_my_parents_that_they_neglected/",
        "body_summary": "OP (16F) was isolated due to her brother's misophonia, which her parents prioritized. Now that he's moved out, they're trying to connect with her. OP snapped at her mom, saying the past can't be fixed with a movie. Her mom yelled back. OP feels guilty and asks AITA.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 141,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 141
        },
        "total_judged": 141,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-31T05:10:49.611509"
    },
    {
        "id": "1kzd0np",
        "title": "AITA for telling my boyfriend I would have preferred lunch over groceries when his card declined at the store?",
        "url": "/r/AmItheAsshole/comments/1kzd0np/aita_for_telling_my_boyfriend_i_would_have/",
        "body_summary": "OP's BF offered lunch, but bought groceries instead due to card issues. OP said she'd preferred lunch. BF got angry, calling her ungrateful. OP laughed and left. AITA for preferring the promised lunch and expressing disappointment?\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 111,
            "ESH": 12,
            "NAH": 3,
            "INFO": 3,
            "TotalJudged": 138
        },
        "total_judged": 138,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-31T05:11:01.418085"
    },
    {
        "id": "1kyxqsd",
        "title": "AITA for not letting someone “work in” during sets at the gym?",
        "url": "/r/AmItheAsshole/comments/1kyxqsd/aita_for_not_letting_someone_work_in_during_sets/",
        "body_summary": "OP uses gym machines. \"Hopper\" asks to \"work in\" during OP's last set. OP refuses due to germs & Hopper's rudeness. Hopper gets angry. AITA for refusing?\n...",
        "reddit_judgments": {
            "YTA": 24,
            "NTA": 64,
            "ESH": 4,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 96
        },
        "total_judged": 96,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-31T05:11:03.665033"
    },
    {
        "id": "1kzkblk",
        "title": "AITAH For making my friend buy me a whole new bathing suit after it was returned with a shit stain?",
        "url": "/r/AmItheAsshole/comments/1kzkblk/aitah_for_making_my_friend_buy_me_a_whole_new/",
        "body_summary": "OP's friend Mia borrowed a swimsuit and returned it stained. OP wants Mia to replace the whole set since the bottoms are ruined. Mia refuses, offering only to replace the bottoms. OP argues she's entitled to a new matching set. AITA?\n...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 118,
            "ESH": 7,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 131
        },
        "total_judged": 131,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-31T05:11:05.736804"
    },
    {
        "id": "1kyztrt",
        "title": "AITA for muting my hearing aids during my sister`s wedding vows because i already knew what she was going to say?",
        "url": "/r/AmItheAsshole/comments/1kyztrt/aita_for_muting_my_hearing_aids_during_my_sisters/",
        "body_summary": "She practiced her vows with me for week on end. I was extremely emotional on the day of the wedding but wanted to keep it together, and so , during the ceremony, i discretely shut off my hearing aids. Somehow all of my family found out and cosideret it to be \"disrespectful\". I was just trying to not cry , i was still there , still supportive. Would i be the asshole?",
        "reddit_judgments": {
            "YTA": 41,
            "NTA": 47,
            "ESH": 1,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 96
        },
        "total_judged": 96,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-31T05:11:07.567953"
    },
    {
        "id": "1kz8s3u",
        "title": "AITA for telling my dad I want to text and call my mom from my own phone this summer instead of using his?",
        "url": "/r/AmItheAsshole/comments/1kz8s3u/aita_for_telling_my_dad_i_want_to_text_and_call/",
        "body_summary": "OP(17F) told her divorced dad she'll use her own phone to contact her mom during her visit, upsetting him. He feels disrespected, controlled by the mom, and that OP is choosing the mom over him. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 132,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-31T05:11:11.469100"
    },
    {
        "id": "1kz6jct",
        "title": "AITAH for fencing my land off from the rest of my family",
        "url": "/r/AmItheAsshole/comments/1kz6jct/aitah_for_fencing_my_land_off_from_the_rest_of_my/",
        "body_summary": "\nMy grandfather left me close to 30acres when he passed it’s currently part of about 150 fenced in acres that my cousins have cattle on, I have no interest in cattle and would prefer them not be on the property once I start building my house in about 3 months, would I be TAH if I fenced off my acreage from their cows using it? I don’t mind them having to go through mine to get to the rest of theirs I just have no interest in the cattle. Thanks in advance,\n\n\nEdit to add: me and my extended family have never really gotten along, they also argue over where the property line actually is but I also have right away over about 100 yards of their road so there is the worry that they try to take that away.",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 17,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 21
        },
        "total_judged": 21,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-31T05:11:12.115792"
    },
    {
        "id": "1kzaz32",
        "title": "WIBTA if I took back a console I “sold” to a friend",
        "url": "/r/AmItheAsshole/comments/1kzaz32/wibta_if_i_took_back_a_console_i_sold_to_a_friend/",
        "body_summary": "OP sold a PS5 to a friend, expecting installments, but hasn't been paid. Friend might be pregnant, further jeopardizing payment. OP considering taking back the PS5 to sell for profit, feeling guilty but needing the money. WIBTA?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 39,
            "ESH": 9,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 51
        },
        "total_judged": 51,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-31T05:11:13.840954"
    },
    {
        "id": "1kzignf",
        "title": "AITA for telling a clients boyfriend to leave?",
        "url": "/r/AmItheAsshole/comments/1kzignf/aita_for_telling_a_clients_boyfriend_to_leave/",
        "body_summary": "OP, a piercer, refused to pierce a woman after her boyfriend made inappropriate comments and insinuated OP would be sexually aroused. OP asked him to leave. Manager said OP should've ignored it. AITA for refusing service?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 48,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-31T05:11:15.019074"
    }
]