[
    {
        "id": "1qj4yqp",
        "title": "AITA for not eating the food after my gf eats out of the bowl with the same spoon while preparing",
        "url": "/r/AmItheAsshole/comments/1qj4yqp/aita_for_not_eating_the_food_after_my_gf_eats_out/",
        "body_summary": "I (25M) was having dinner with my GF(23F) last night and she was preparing a salad. As I was grilling the chicken, she was repeatedly eating out of the salad bowl with a spoon and putting it back in the bowl mixing around and such. This is a common thing that weve talked about before. I find it gross and bad manners to eat out serving dishes and put your used utensil back into the serving dish other people are expected to eat out of. Her family does it for almost every dish and if I see it, it grosses me out. I once again asked her to stop or to make herself a bowl and eat out of that rather than the community dish. She got bent out of shape, dismissed my concern, so I ignored it and carried on cooking the chicken.\n\n  \nWhen it came time to eat, she tried to serve me salad(With the same spo...",
        "reddit_judgments": {
            "YTA": 37,
            "NTA": 76,
            "ESH": 14,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 133
        },
        "total_judged": 133,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-22T05:21:33.030051"
    },
    {
        "id": "1qj62je",
        "title": "AITA for eating food my roommate can’t eat?",
        "url": "/r/AmItheAsshole/comments/1qj62je/aita_for_eating_food_my_roommate_cant_eat/",
        "body_summary": "My roommate (32, F) recently had surgery and they have been on an extremely strict diet that consist of bland foods. They have been bummed about not being able to eat things that they enjoy for the last few weeks or so. I (27, F) work an intense job that requires me to work semi-late, especially one night a week in particular, where I have to travel to our furthest office. This drive takes at least an hour each way, therefore I’m not home until after 8PM and I’ll be sooo hungry and exhausted. Usually on these nights I’ll treat myself by getting delicious take out and enjoying it while watching a show to wind down for the night. Last night I got a meal that I was craving, and it just so happens to be one of my roommate’s favorites. I ate it in the living room while we watched TV, then place...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 123,
            "ESH": 4,
            "NAH": 4,
            "INFO": 0,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-22T05:21:49.689916"
    },
    {
        "id": "1qjbpdu",
        "title": "AITA for not buying junk food for someone in need?",
        "url": "/r/AmItheAsshole/comments/1qjbpdu/aita_for_not_buying_junk_food_for_someone_in_need/",
        "body_summary": "A sibling's friend has a younger sister who recently gave birth to a baby. She has no support from her parents or other family members, nor is the father involved in the child's life. I purchased a large box of diapers, a large package of baby wipes, a couple of sleepers, a few long sleeved onesies, a package of baby socks, and a package of baby hats for this little baby. I was a single mom for many years and know how hard it can be when you're on your own. \n\nShe messaged me this morning and asked if I could send her some money to buy food. I don't believe anyone should go hungry, and I asked if instead I could have groceries delivered to her. I asked her to send me a list of essentials that she needs, and she returned the prompt with a request for junk food. I asked if I could instead ord...",
        "reddit_judgments": {
            "YTA": 23,
            "NTA": 57,
            "ESH": 0,
            "NAH": 16,
            "INFO": 3,
            "TotalJudged": 99
        },
        "total_judged": 99,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-22T05:22:06.716802"
    },
    {
        "id": "1qipgyf",
        "title": "AITA for telling my coworker to stop buying me gifts?",
        "url": "/r/AmItheAsshole/comments/1qipgyf/aita_for_telling_my_coworker_to_stop_buying_me/",
        "body_summary": "I (18f) started at a new job in october. My coworker (27m) immediately started talking to me my first day there. I would talk to him in group settings but he would always try to get me to go with him to his car to breaks, etc. after about a week of me working there he started bringing me starbucks in the morning and even packing me lunch. after 3 weeks he had planned an entire date to go get dinner and ice cream, I had told him I did not want to go and I would only like to be friends at work and he said he understood. He kept bringing me lunch and buying me food but I just kept it friendly and professional and never went anywhere with him alone.\n\nFlash forward to december and my battery had died at work. i had asked him to jump it, he had absolutely no idea what he was doing if im being ho...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 43,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-22T05:22:22.543652"
    },
    {
        "id": "1qj11ew",
        "title": "AITA if I don’t want to help pay my MIL’s cancer bills?",
        "url": "/r/AmItheAsshole/comments/1qj11ew/aita_if_i_dont_want_to_help_pay_my_mils_cancer/",
        "body_summary": "Hello, I’ve come here to ask for advice and opinions because I do not really have anyone in my life other than my kids and husband. I can obviously not ask my kids for advice because they’re very young.\n\nI (36F) am married (37M) and we have two children (12F/NB, 8F). My husband has his own electrical company and makes very decent money. I on the other hand am a teacher and my salary is not as big. It’s about enough to help get through times right now though. My husband’s very busy, but he’s great! He does laundry and some house cleaning when he can. He takes our daughters on daddy daughter dates and admittedly spoils them rotten on holidays and birthdays. It’s really important to him that he’s active in the girls’ lives because he never had that. His mother was the only one who raised him....",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 25,
            "ESH": 7,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 43
        },
        "total_judged": 43,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-22T05:22:38.223978"
    },
    {
        "id": "1qjgvut",
        "title": "AITA for refusing to share my lottery winnings with my family, even though I used the family numbers?",
        "url": "/r/AmItheAsshole/comments/1qjgvut/aita_for_refusing_to_share_my_lottery_winnings/",
        "body_summary": "I (22M) recently won a decent amount of money in the lottery. Not a massive jackpot, but enough to be life changing for me: pay off debts, buy a small apartment, and invest a bit.\n\nNow for the context. In my family, there’s been an informal tradition for years. On my grandma birthday, someone usually plays lottery numbers based on important family dates (birthdays, anniversaries, etc). Sometimes we play together, sometimes everyone plays on their own. There has never been an explicit agreement that if someone wins, the money gets shared. It was always treated as a fun tradition.\n\nThis time, I played alone, with my own money, but I used those dates (to be specific, grandma’s birthday day, month and year, my dad’s birthday day, and the day and month i graduated). I won. When I told my family...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 62,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-22T05:22:54.344508"
    },
    {
        "id": "1qjkgl8",
        "title": "AITA for making my whole family go on a diet because my daughter is dieting?",
        "url": "/r/AmItheAsshole/comments/1qjkgl8/aita_for_making_my_whole_family_go_on_a_diet/",
        "body_summary": "I (F52) live with my husband (M55) and our two kids: daughter (F15) and son (M17).\n\nMy daughter has always been on the chubbier side, and honestly, our whole family is overweight. However, since she started high school, her weight gain became extreme. In the span of just a few months, she went from being somewhat chubby to weighing over 300 pounds at only 15 years old.\n\nObviously, this worried us a lot. We later realized the weight gain was a symptom of deeper issues. High school has been very hard for her, and she was being bullied. She started stress eating, and since we all gain weight easily, things escalated quickly. We are addressing the emotional side of this with a therapist and working with the school, but we also can’t ignore the physical weight gain.\n\nI took her to a nutritionis...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 93,
            "ESH": 2,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-22T05:23:11.032096"
    },
    {
        "id": "1qj20ya",
        "title": "AITA For Not Calling the Attention of Laptop User inside the Cinema",
        "url": "/r/AmItheAsshole/comments/1qj20ya/aita_for_not_calling_the_attention_of_laptop_user/",
        "body_summary": "So at a movie showing with only a few people watching, I sat down first in my seat. A college-age couple sat in front when it was already dark and all the trailers were being shown.\n\nWhen the movie was about to show the company credits, the woman in the couple took out her laptop, looked at a few things, and closed it again. However, when the movie started, the woman opened the laptop again, looked at various programs, most of which were not yet in dark mode and intended to work. The laptop was on the lowest brightness. The couple reclined their chair so the light on the screen was even more visible.\n\nWhen I realized that the woman was not going to stop because the movie had already started and she was still on her laptop, I angrily quipped \"Jesus, what is that? Working with a laptop in a ...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 50,
            "ESH": 32,
            "NAH": 0,
            "INFO": 15,
            "TotalJudged": 104
        },
        "total_judged": 104,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-22T05:23:27.113590"
    },
    {
        "id": "1qj7v2m",
        "title": "AITA for refusing to share my gaming setup with my roommate after finals week",
        "url": "/r/AmItheAsshole/comments/1qj7v2m/aita_for_refusing_to_share_my_gaming_setup_with/",
        "body_summary": "I’m 19F, in college, and I game a lot in my free time. I built my PC myself over two years and it’s basically my one expensive thing. My roommate knows this.\n\nDuring finals week she barely studied and kept asking to “borrow” my setup because her laptop “stressed her out.” I said no at first because it helps me unwind after exams. She kept insisting it would only be for an hour.\n\nI caved once. She logged into her accounts, downloaded stuff, changed settings, and left crumbs everywhere. When I came back later my mouse DPI was different and my desk felt gross.\n\nAfter that I said no more. She’s been passive about it since, saying I’m dramatic over a computer and that sharing is normal in college housing.\n\nI don’t think it’s about sharing. It’s about respecting something I worked for. AITA?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 30,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-22T05:23:27.594822"
    },
    {
        "id": "1qjdqge",
        "title": "AITA for Refusing to Help My Mom with Her Expenses Because She Wasted Her Savings?",
        "url": "/r/AmItheAsshole/comments/1qjdqge/aita_for_refusing_to_help_my_mom_with_her/",
        "body_summary": "I (29M) have always been close to my mom. Growing up, she was a single parent and worked hard to provide for me. I appreciate everything she did, but I’ve recently found myself frustrated with her financial decisions.\n\nRecently my Mother has spent the majority of money saved throughout her lifetime on luxury's (such as vacations!), items she did not need (ie - kitchen appliances), and other unnecessary items (gold jewelry!).\n\nI attempted to speak with her regarding saving for retirement, but my Mother said she had put in her fair share of work during her life and is now entitled to enjoy her leisure time. When I had this discussion with my mother a few years ago, she stated that she wanted to travel all over the world (and) just take a break after spending so many years working hard.\n\nAt t...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 36,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-22T05:23:43.370289"
    }
]