[
    {
        "id": "1nq52hz",
        "title": "AITA for suggesting my in-laws stay at an Airbnb instead of us leaving our home with our kitten?",
        "url": "/r/AmItheAsshole/comments/1nq52hz/aita_for_suggesting_my_inlaws_stay_at_an_airbnb/",
        "body_summary": "My parents in law are visiting us for a week. Because our space is small (50m2) , they would have to sleep on the couch which they wouldn’t like, so I suggested booking an Airbnb for them. That way they could spend the day with us, enjoy homemade meals (my husband insists on that, they will get mad if it isn’t the case), then go out and return for dinner at our place before spending the night at their Airbnb comfortably. \n\nMy husband hated this idea and was furious. He wants us to leave our apartment for them and stay at an Airbnb ourselves, taking our 3 month old kitten with us (because they hate cats) and then come back every morning to prepare meals, do house chores for them and spend the day with them.\n\nAm I crazy for thinking this sounds unreasonable?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 115,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 118
        },
        "total_judged": 118,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-26T05:11:18.088103"
    },
    {
        "id": "1nqetwc",
        "title": "AITA for refusing to have my SIL service dog at my wedding",
        "url": "/r/AmItheAsshole/comments/1nqetwc/aita_for_refusing_to_have_my_sil_service_dog_at/",
        "body_summary": "OP's sister is severely allergic to dogs. SIL needs her service dog due to seizures. Wedding is indoors in a small space. OP asked SIL to consider attending without her dog, offering a +1 for support, as sister's allergies are severe. SIL is furious, calling OP ableist. MIL threatens to not attend. AITA?\n...",
        "reddit_judgments": {
            "YTA": 55,
            "NTA": 65,
            "ESH": 3,
            "NAH": 9,
            "INFO": 3,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-26T05:11:31.183922"
    },
    {
        "id": "1nqd3j4",
        "title": "AITA for telling my chronically-late friend the wrong time so they would show up on time...and then they actually got there early?",
        "url": "/r/AmItheAsshole/comments/1nqd3j4/aita_for_telling_my_chronicallylate_friend_the/",
        "body_summary": "OP's chronically late friend is now texting when she leaves her house. OP hosted a party, telling the friend to arrive at 7pm while telling others 8pm to counteract her lateness. Friend arrived at 7pm, was upset at being told the wrong time, and called OP passive-aggressive. AITA?\n...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 102,
            "ESH": 15,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 129
        },
        "total_judged": 129,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-26T05:11:34.203298"
    },
    {
        "id": "1nq1ufj",
        "title": "AITA for \"humiliating\" my friend for hitting on my cousin?",
        "url": "/r/AmItheAsshole/comments/1nq1ufj/aita_for_humiliating_my_friend_for_hitting_on_my/",
        "body_summary": "OP's friend, Matt, made a creepy comment towards OP's 18-year-old cousin, Alina. OP told Matt to leave and that he's no longer welcome. Matt now claims OP overreacted and humiliated him. AITA for kicking Matt out?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 131,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-26T05:11:40.037591"
    },
    {
        "id": "1nq83gc",
        "title": "AITA for taking my sister's side?",
        "url": "/r/AmItheAsshole/comments/1nq83gc/aita_for_taking_my_sisters_side/",
        "body_summary": "OP's sister spoils his daughter, creating jealousy with his wife/stepdaughter. For their birthdays, the sister gave OP's daughter many gifts, but a gym membership to the stepdaughter. Wife/stepdaughter want OP to limit contact with sister unless she treats both girls equally. OP refused; AITA?\n...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 48,
            "ESH": 6,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-26T05:11:42.264445"
    },
    {
        "id": "1nqnne7",
        "title": "AITA for paying off my daughter’s student loans but not giving the same amount to her brother, who didn’t go to university?",
        "url": "/r/AmItheAsshole/comments/1nqnne7/aita_for_paying_off_my_daughters_student_loans/",
        "body_summary": "OP used life insurance money to pay off daughter's $60K student loans due to guilt. Son demanded the same amount in cash. OP refused, citing loans being an educational expense & daughter's past. AITA?\n...",
        "reddit_judgments": {
            "YTA": 33,
            "NTA": 81,
            "ESH": 4,
            "NAH": 6,
            "INFO": 7,
            "TotalJudged": 131
        },
        "total_judged": 131,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-26T05:11:47.268605"
    },
    {
        "id": "1nq1301",
        "title": "AITA for telling my friend to end their 10 day trip and come get their dog after I found out their dog had fleas?",
        "url": "/r/AmItheAsshole/comments/1nq1301/aita_for_telling_my_friend_to_end_their_10_day/",
        "body_summary": "OP agreed to dogsit for J, ensuring flea prevention. Discovering J's dog is heavily infested and recently off medication, jeopardizing OP's cat and health. OP demanded J retrieve the dog or find an alternative within 24 hours. AITA?\n...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 38,
            "ESH": 6,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-26T05:11:49.211516"
    },
    {
        "id": "1nqdm6o",
        "title": "AITA for cutting our lunch short when my friend showed up late?",
        "url": "/r/AmItheAsshole/comments/1nqdm6o/aita_for_cutting_our_lunch_short_when_my_friend/",
        "body_summary": "OP's friend is habitually late. OP, seeking to set boundaries, left a lunch date early to enforce planned departure time despite friend's lateness. Friend arrived 35 mins late, unaware of OP's post-lunch plans and feeling rushed. OP asks if they were the asshole for not communicating the time constraint.\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 49,
            "ESH": 3,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-26T05:11:51.513052"
    },
    {
        "id": "1nqhhuf",
        "title": "AITA for assigning the chore of dishes to my wife?",
        "url": "/r/AmItheAsshole/comments/1nqhhuf/aita_for_assigning_the_chore_of_dishes_to_my_wife/",
        "body_summary": "Wife's Stanley cup & leftover container habit creates stinky dishes. OP, now WFH, does most chores, asked wife to rinse/unload her messes or do all dishes. Wife refuses, citing OP's free time. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 90,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 91
        },
        "total_judged": 91,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-26T05:11:55.742274"
    },
    {
        "id": "1nqfbp9",
        "title": "AITA for calling out a mom whose child was destroying our building’s flowers?",
        "url": "/r/AmItheAsshole/comments/1nqfbp9/aita_for_calling_out_a_mom_whose_child_was/",
        "body_summary": "OP saw a child destroying flowers in front of their building. OP asked the mother to stop her daughter. The mother dismissed it, saying the child had a bad day. OP thinks the mom's reaction is entitled and wonders if they're the AH for intervening.\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 39,
            "ESH": 2,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-26T05:11:57.357139"
    }
]