[
    {
        "id": "1qq6otg",
        "title": "AITA for telling a woman at the gym to stop filming because I kept ending up in her videos?",
        "url": "/r/AmItheAsshole/comments/1qq6otg/aita_for_telling_a_woman_at_the_gym_to_stop/",
        "body_summary": "I (31M) go to the same gym most mornings before work. Its a normal chain gym like no one of those influencer gyms but people still record sets sometimes. There are signs about not filming other members without consent but its not like it never happens. \n\nA few weeks ago this woman (I'll call her Jenna) started setting up a tripod near the cable machines, I didnt care like i'm not trying to police anyone I just did my workout and stayed out of the way. \n\nBut then I kept noticing I was showing up in her videos anyway in the background. One day I was doing lateral raises and her phone was pointed straight through the mirror so you could see a big chunk of the floor behind her. I only noticed because I could literally see myself in the mirror on her screen when I walked past. I'm not saying sh...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 136,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-30T05:39:21.854772"
    },
    {
        "id": "1qq7way",
        "title": "AITAH: My in laws demand us to travel 18 hour round trip for grandpas birthday party at a hotel and all the other kids and spouses get their own room but want to share with us since we don’t have kids.",
        "url": "/r/AmItheAsshole/comments/1qq7way/aitah_my_in_laws_demand_us_to_travel_18_hour/",
        "body_summary": "I’m really frustrated. My in laws pretty much guilt tripped all of us to travel out of state to go to a grandpa’s birthday party and I as a daughter in law have already shared a hotel room with them several times and I’m so uncomfortable. They are paying for us to come because otherwise we can’t afford a hotel and trip at this time as we’re already dealing with infertility. Well I finally spoke up and I said me and my husband need our own room and then they said we would have to help pay then if we didn’t want to share a room. I got pretty upset at them and told them we won’t come then because having our own room is not a luxury it’s a need. Am I the asshole?! EDIT TO ADD: They are paying for everyone to come not just us we are the only ones expected to share a room since we don’t have kid...",
        "reddit_judgments": {
            "YTA": 72,
            "NTA": 29,
            "ESH": 3,
            "NAH": 9,
            "INFO": 8,
            "TotalJudged": 121
        },
        "total_judged": 121,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-30T05:39:34.218288"
    },
    {
        "id": "1qqc67n",
        "title": "AITA for ruining a funeral",
        "url": "/r/AmItheAsshole/comments/1qqc67n/aita_for_ruining_a_funeral/",
        "body_summary": "My aunt (dad's sister) passed away and I am back in town so I decided to go to the funeral.  She had two children.  Her son who lived with her and a daughter I will call Sue. They lived in a small town about 2 hours away. It was going to be a family viewing at the funeral home and then grave side service.  As I was signing the guest book, a cousin I hadn't seen in years came over and we started talking. This was in the hallway before you get to the viewing room. Sue came out and shushed us.  I was embarrassed thinking we were talking too loud (even though I didn't think so). So we went into the viewing room. There everyone was sitting and looking at a monitor with videos of the deceased. They had sad music playing but no one was talking, just sitting quietly looking at the monitor.  After ...",
        "reddit_judgments": {
            "YTA": 24,
            "NTA": 59,
            "ESH": 1,
            "NAH": 11,
            "INFO": 4,
            "TotalJudged": 99
        },
        "total_judged": 99,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-30T05:39:43.112367"
    },
    {
        "id": "1qqetet",
        "title": "AITA for wanting to bring meat to my vegetarian SIL and not going when I was not allowed too",
        "url": "/r/AmItheAsshole/comments/1qqetet/aita_for_wanting_to_bring_meat_to_my_vegetarian/",
        "body_summary": "Update I am going to talk to my SIL. i will go if it includes an apology if it doesn’t I am not going\n\nI am not going… I talked to her and she apologized and told me I can bring my food (that was fin) and then told me she would still like me to try her food. I told her I can’t again and she said I was just need to try more food . She’s acting like I am being picky. I can’t fucking eat it without throwing up\n\nim not fucking going.\n\n——————\n\nI don’t want to be in the company of someone that thinks I made some shit up and be called picky for a medical issue\n\nI don’t, I have lived my whole life dealing with people thinking I am just being a pain in the ass\n\nSo yeah I don’t want to go to dinner with someone that called my medical issue me being picky \n\neveryone asking, I eat different types of b...",
        "reddit_judgments": {
            "YTA": 56,
            "NTA": 51,
            "ESH": 25,
            "NAH": 5,
            "INFO": 6,
            "TotalJudged": 143
        },
        "total_judged": 143,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2026-01-30T05:39:58.037879"
    },
    {
        "id": "1qq3wo8",
        "title": "AITA for telling my best friends step brother that he isn't a short king?",
        "url": "/r/AmItheAsshole/comments/1qq3wo8/aita_for_telling_my_best_friends_step_brother/",
        "body_summary": "My(25m) best friend \"Oliver\"(21m) and I have been friends for 12 years. Honestly, we're more like brothers. I think it's funny, my girlfriend \"Naomi\"(25f) and I are, I think, pretty average for height. She's 5'7 and I'm 5'11 but Oliver and his girlfriend \"Angela\"(24f) are on a whole other scale. Oliver is 6'7 and Angela is 6'2. We rarely talk about our heights but I bring this up because it's important. \n\nOliver and his step brother \"Jim\"(22m) don't have a great relationship. They didn't really have the chance to interact. Oliver used to live with his mom while Jim lives with Oliver's dad and step mom. Oliver would invite Jim to do stuff but Jim never accepted. \n\nAnyway, Oliver's dad was having a little get together yesterday and he invited the kids that moved out and their partners (Olive...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 32,
            "ESH": 11,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-30T05:40:06.299160"
    },
    {
        "id": "1qqcswt",
        "title": "AITA for refusing to cover my coworker’s shift after they caused the problem?",
        "url": "/r/AmItheAsshole/comments/1qqcswt/aita_for_refusing_to_cover_my_coworkers_shift/",
        "body_summary": "I (24F) work in a small office where we’re constantly short-staffed. One of my coworkers (29M) is notorious for blasting the AC year-round, even in winter, despite multiple people asking him to stop because it makes them sick. Management hasn’t really enforced any rules about it.\n\nLast week, he turned the AC on full blast during a cold snap. I ended up getting really sick, fever, sore throat.\n\nNow here’s the issue: while I was out sick, he asked me if I could cover his shift this weekend because he “really needs a break” and has plans he doesn’t want to cancel. I said no and pointed out that I wouldn’t even be sick if he hadn’t cranked the AC after everyone asked him not to. He got defensive and said I was being petty and that getting sick “isn’t his fault.”\n\nSo AITA For Saying No?",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 66,
            "ESH": 6,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 90
        },
        "total_judged": 90,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-30T05:40:07.537177"
    },
    {
        "id": "1qqh44h",
        "title": "AITA for not wanting my 15 year old sister in law to join my fiancé and I for our birthday dinner?",
        "url": "/r/AmItheAsshole/comments/1qqh44h/aita_for_not_wanting_my_15_year_old_sister_in_law/",
        "body_summary": "So I've been with my fiancé for a year and a half now (romantic relationship wise), and our birthdays are a day apart. We love together and his little sister lives with us as she schools here. I wanted to go to this one restaurant for dinner and drinks on the weekend of our birthday, but he wants to bring his sister along. Now I'm not a big fan of that, because she just ruins the mood and we've had an up and down relationship in the past as she always complained to her family and elder sister that she doesn't like me and we don't ever take her out on dates (she's a big attention seeker). On my fiance and I's first anniversary I made it clear to him that I would like it to be just the 2 of us going out as our 1 year being together was a very special to me, in which he agreed but a day later...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 93,
            "ESH": 2,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 104
        },
        "total_judged": 104,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-30T05:40:16.254573"
    },
    {
        "id": "1qqei26",
        "title": "AITA for not inviting one person from the office to the holiday party",
        "url": "/r/AmItheAsshole/comments/1qqei26/aita_for_not_inviting_one_person_from_the_office/",
        "body_summary": "I own a small business of 6 people including myself. When I rented out my space someone(Sara) already had an office in the space, I just rented out everything around her to build my business.  Over the last 2 years since moving in, we've gotten to know this person and we've become friendly. We've invite her out to dinner a few times, she's invite us to a birthday party, we know each others's families. It's been very kind and cordial and we enjoy her company despite her not working for me. We work in the same field, so we have a lot of overlap and often we all find ourselves hanging out in an office just to vent, catch up, stuff like that. She'll help celebrate birthdays by bringing in cakes and cookies for people, or sometimes she just does it for no reason, which is also very sweet.\n\nA fe...",
        "reddit_judgments": {
            "YTA": 38,
            "NTA": 12,
            "ESH": 0,
            "NAH": 9,
            "INFO": 5,
            "TotalJudged": 64
        },
        "total_judged": 64,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-30T05:40:24.290819"
    },
    {
        "id": "1qq2tof",
        "title": "AITA for not letting a friend throw her birthday party at my house?",
        "url": "/r/AmItheAsshole/comments/1qq2tof/aita_for_not_letting_a_friend_throw_her_birthday/",
        "body_summary": "My husband and I are in our 20s and we own our house. For the last couple years, our place has kind of become the party house for our friend group. We host birthdays, Halloween, New Year’s, etc. The parties started small but now they’re usually like 25–30 people.\n\nWe enjoy it, but it’s honestly a lot of work. We have to lock our cats away, send our dogs to my grandma’s, buy food and drinks, decorate, and clean everything up after. Most of that falls on me and my husband.\n\nThis year has been really stressful because we both run our own businesses and I’m also in school. We decided we weren’t going to host any parties until summer.\n\nMy best friend recently asked if she could do a small Galentine’s party at my house because her parents wouldn’t let her host. She promised she’d handle food, de...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 51,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-30T05:40:32.289604"
    },
    {
        "id": "1qqhtke",
        "title": "AITA for suggesting he check our country's laws?",
        "url": "/r/AmItheAsshole/comments/1qqhtke/aita_for_suggesting_he_check_our_countrys_laws/",
        "body_summary": "I (39 f) have a roommate (36 m) who is big into a few social media influencers and vloggers. \n\nLast night he announced that due to the first amendment (we're not American) he could walk into a government building, start recording and say, \"You want me to stop recording, move me to the front of the line.\" \n\nNow I know that our laws are similar to the US, but there are distinct differences that can be very subtle. As an example if you own a firearm here you need to keep them unloaded and locked in a safe, keep the ammunition in a separate safe, also locked and not with a key with a numeric code. That's one example of the differences between us and the US, so with that in mind I suggested \"you might want to double check that's legal here.\" \n\nHe started going off calling me a stupid liberal K ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 65,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-30T05:40:40.560420"
    }
]