[
    {
        "id": "1q4mi6i",
        "title": "WIBTA for not making my daughter go to a girls birthday even though I know no one is going",
        "url": "/r/AmItheAsshole/comments/1q4mi6i/wibta_for_not_making_my_daughter_go_to_a_girls/",
        "body_summary": "So I am really torn on this and I don’t know what I should do… so Reddit\n\nThis year a girl ( I will call him Emilia) joined my daughter’s school. We go to private school and the classrooms are very small.\n\nEmilia has been an issue this school year. She is very disruptive in classes and we had an issue around  Halloween of her stealing peoples food at lunch. My daughter was involved and she received an apology for that.  Soon after we got a school email to remind the kids about personal boundaries and not touching people. I asked my daughter and it was due to Emilia kept hugging  people…\n\nThis is 5th grade.  My daughter is overall no the biggest fan on her. \n\nI have interacted with Emilia before and I believe she is on the autistic spectrum ( no confirmation on that). \n\nThis leads to the ma...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 73,
            "ESH": 0,
            "NAH": 22,
            "INFO": 3,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-06T05:17:20.987322"
    },
    {
        "id": "1q4dff8",
        "title": "AITA for not being excited for my SIL pregnancy announcement?",
        "url": "/r/AmItheAsshole/comments/1q4dff8/aita_for_not_being_excited_for_my_sil_pregnancy/",
        "body_summary": "Last week, my family had a joint birthday celebration for me (33F) and my brother-in-law (25M). This is typical for all family birthdays. It was hosted at my house, where my in-laws have been living with my husband and me for the past 2.5 years while they look for a home.\n\n5 minutes after everyone arrived, my MIL said, “Okay, let’s eat,” so I went into the kitchen to make my plate. At the same time, my sister stepped into the laundry room to sign a birthday card.\n\nWhile I was still in the kitchen, I heard my SIL say, “Mom and Dad need to open this together.” I didn’t know what she was referring to, so I stayed in the kitchen. Then I heard my MIL say, “Oh my God, is this real?” My sister came back and asked what was going on, and I said I thought my SIL had just announced she’s pregnant.\n\nB...",
        "reddit_judgments": {
            "YTA": 64,
            "NTA": 81,
            "ESH": 14,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 159
        },
        "total_judged": 159,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-06T05:17:40.618813"
    },
    {
        "id": "1q4ibzk",
        "title": "AITA for dancing for my date on New Year’s and keeping the money?",
        "url": "/r/AmItheAsshole/comments/1q4ibzk/aita_for_dancing_for_my_date_on_new_years_and/",
        "body_summary": "So this is really dumb but I need outside opinions. For New Year’s my friend group rented a party bus. Everyone was drunk, laughing, having a good time and the bus had a stripper pole. I’m 25 and brought my date (mid 40s). My close friend is 28 and brought her boyfriend (30 something).\n\nAt some point my date asked me to dance for him and I did. It was playful drunk New Year’s energy. He started throwing money at me as a joke. Then my friend’s boyfriend also started throwing money. I did not acknowledge him, dance on him, touch him, or interact with him at all. I was focused on my date and honestly just having fun in the moment.\n\nLater my friend said I disrespected her relationship. I told her I understood how she felt but I didn’t think I crossed a line. The next day she called me and said...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 45,
            "ESH": 11,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-06T05:17:57.443145"
    },
    {
        "id": "1q4nhtk",
        "title": "AITAH for telling someone to put their dog on a leash?",
        "url": "/r/AmItheAsshole/comments/1q4nhtk/aitah_for_telling_someone_to_put_their_dog_on_a/",
        "body_summary": "AITAH?  I went to stop at a stop sign. As I'm slowing down, I noticed that a dog was relieving himself in the park next to the stop sign. The owner was standing there with the dog. As I come to a stop, the dog runs in front of my car and I nearly hit it. I rolled down my window and told the owner he needs to put a leash on his dog and he proceeded to show me a leash that he was wearing around his neck like a piece of jewelry.\n\nI told him that the lease should be on the dog not around the owner's neck. He told me that I don't need to tell him what to do with his dog. I said that that's fine. The next time I'll just run your dog over. Am I the asshole?\n\nETA- The dog was not in a dog park.  It was a park for humans in our subdivision.  We do have leash laws.",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 20,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-06T05:17:57.947420"
    },
    {
        "id": "1q4gasu",
        "title": "AITA - my dad bought me a bag & is asking me to pay for it",
        "url": "/r/AmItheAsshole/comments/1q4gasu/aita_my_dad_bought_me_a_bag_is_asking_me_to_pay/",
        "body_summary": "backstory - my mom recently passed on last year may. my dad has always had this habit/practice of buying her and i luxury bags whenever he travels for his business trips.\n\nabout a year before my mom passed on, we (my brother and i) found out my dad has been cheating on her (not the first time) and she found out 6months later. during the infidelity, we found receipts of him buying and spending money on his mistress. he knows we know about his infidelity on the day of my mom's passing but has been avoiding and acting like he hadn't been unfaithful.\n\nhe has been going on leisure trips \"on his own\" recently, but we found receipts and proof that he was with his mistress.\n\nhe \\[58M working adult\\] recently went on a trip and asked me to choose a bag i \\[26F working adult\\] wanted over video call...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 12,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 14
        },
        "total_judged": 14,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-06T05:18:13.682996"
    },
    {
        "id": "1q4fh3b",
        "title": "AITA for finishing and delivering a shared project without everyone?",
        "url": "/r/AmItheAsshole/comments/1q4fh3b/aita_for_finishing_and_delivering_a_shared/",
        "body_summary": "I joined a makerspace to help build a shared bookshelf for a local library. About six people signed up, but after the first couple weeks, it was basically just me. I put in around 25–30 hours, fixed mistakes, bought extra supplies, and finished everything except paint.\n\nThe library asked if it could be delivered for an event. I posted in the group chat saying I’d take it Saturday unless anyone objected. No one did, so I delivered it and included everyone’s name on a tag.\n\nLater, one of the original helpers messaged me angry, saying I “stole” the project and moved it without a group decision. A few others agreed, saying shared projects shouldn’t be moved by one person.\n\nI feel like it would’ve just sat there otherwise, and the library needed it. I didn’t take personal credit.\nAITA?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 6,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 6
        },
        "total_judged": 6,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-06T05:18:13.933925"
    },
    {
        "id": "1q4eret",
        "title": "AITA for putting my foot down with my mom and comparing my family to theirs?",
        "url": "/r/AmItheAsshole/comments/1q4eret/aita_for_putting_my_foot_down_with_my_mom_and/",
        "body_summary": "21M.\n\n“Theirs” = my friend’s family\n\nI’m  living at home with my mom.\n\nLast week was my 21st birthday. We couldn’t celebrate on the day because everyone was busy with work (myself included). A gift card, which I genuinely appreciated and planned to use for school. I asked if we could go out to eat later, since that’s our family tradition for birthdays, and was told we’d celebrate soon on another day.\n\nThat day ended up being Sunday. My celebration day unfortunately overlapped with an argument between my mom and me.\n\nMy mom wanted me to go to church with her. I didn’t want to go because a close friend, who has a very tight work schedule had spent the entire week planning and organizing a birthday gift for me with her mom. She needed to hand‑deliver it at a very specific time before work, wh...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 7,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 7
        },
        "total_judged": 7,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-06T05:18:29.508995"
    },
    {
        "id": "1q4kfx9",
        "title": "AITA for disappointing my cousin with my words",
        "url": "/r/AmItheAsshole/comments/1q4kfx9/aita_for_disappointing_my_cousin_with_my_words/",
        "body_summary": "Some disclaimers: I am the black sheep of the family & already almost all family members have a problem with me. If not on face, then definitely behind my back. \n\nLong story short, I caught my husband 'almost' cheating on me a few months ago, and the whole family got involved (my biggest regret now). \n\n  \nRecently, I disappointed one of my aunts without knowing (typical of me) & she started badmouthing me at a family gathering. She mainly brought up the topic of my cheating husband and how I must have done something to be in this situation. Anyway, I was not present at this gathering & heard all about it from a few family members who still like me (shocking, I know).\n\n  \nSo this aunt's daughter and I are good friends. I decided to take this topic to her and ask her about what happened and ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 7,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 11
        },
        "total_judged": 11,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-06T05:18:45.107167"
    },
    {
        "id": "1q4ec9w",
        "title": "AITA for arguing with my mom over 4 dollars?",
        "url": "/r/AmItheAsshole/comments/1q4ec9w/aita_for_arguing_with_my_mom_over_4_dollars/",
        "body_summary": "I (19F) live with my mom (46F). This all happened in one day.\n\nThat morning she asked me for $20. I’d already given her $50 + $19 days earlier. She had been paid ~$500 the week before. If I say no, she yells, so I sent it.Minutes later she got a surprise $200 bonus. Hours later she called and said:\n“Send me $4, I’m doing my eyebrows.”\n\nI questioned why she needed $4 after $200. She said it was for groceries “for all of us,” but I barely eat and most of what she bought was food only she eats. She told me not to “start” because people could hear her arguing. How?! You received 200$ why do you need 4$ from me?\n\nShe talked abt how she did groceries for all of us…mind u im a picky eater. I only eat chicken, pasta and spicy noodles\n\nSo idk how my groceries and hers added up to 200$ even when I b...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 8,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 9
        },
        "total_judged": 9,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-06T05:19:00.704493"
    },
    {
        "id": "1q4gwqr",
        "title": "AITA for telling my (19M) friend (19F) to stop being so pessimistic?",
        "url": "/r/AmItheAsshole/comments/1q4gwqr/aita_for_telling_my_19m_friend_19f_to_stop_being/",
        "body_summary": "Sorry for any mistakes.\nAs forward as the title says.\nWe are currently on our exam session of Law and I have this friend doing the same study as me. We've both aced our first year and she had grades better than me and I think overall, she's the better student.\n\nHer big issue is that she stresses A LOT, whereas I am more relaxed. I try to reassure her and tell her that's fine (as I genuinely believe it). The issue here is that she keeps complaining ALL THE TIME. In november, she was already complaining that she had too much to study and so on. No positivity, nothing. When I tried to tell her that everything'll be fine, she told me that I couldn't understand since I had 4 exams and her 6, or something along the lines (we have different options. With mine, I have a huge seminar with an essay ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 4,
            "ESH": 2,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 7
        },
        "total_judged": 7,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-06T05:19:16.368422"
    }
]