[
    {
        "id": "1q7zpxl",
        "title": "AITA for thinking it’s unreasonable to buy a single use suit to be a groomsman?",
        "url": "/r/AmItheAsshole/comments/1q7zpxl/aita_for_thinking_its_unreasonable_to_buy_a/",
        "body_summary": "I’m a groomsman in my brother’s wedding, and he’s now talking about having all the groomsmen wear matching custom-made suits, not rentals, with each of us expected to pay for our own. I pushed back and said I’m happy to follow a general dress code or coordinate accessories, but I’m not willing to buy a custom suit chosen by the couple for their wedding.\n\nIn my view, if the groom and bride want the wedding party to fully match, then they should pay for it. If they don’t want to pay, then the normal alternative is a simple dress code like “dark suit, white shirt,” not forcing people to buy a single-use outfit. That’s exactly how I handled it at my own wedding. We paid for the bridesmaids’ matching dresses, and the groomsmen just wore suits they already owned while I bought bow ties for every...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 42,
            "ESH": 0,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-10T05:13:57.336616"
    },
    {
        "id": "1q7zwyr",
        "title": "AITA For telling my cousin that she has a month to find o new babysitter?",
        "url": "/r/AmItheAsshole/comments/1q7zwyr/aita_for_telling_my_cousin_that_she_has_a_month/",
        "body_summary": "Hey. So I've posted on here before. Im the girl who's cousin wanted to pay me only 200 a month and sometimes food and smokes for babysitting her kids 12 plus hours a day. \nThings have not improved. She told me that she would start buying my cat food to but she was gonna take that cost away from my phone bill money. Im still babysitting her children for about 12 hours a day almost everyday because she \"keeps getting called in to work\".\n     I have been keeping my mouth shut. She no longer pays even half my phone bill she buys me 24 packs of ramen that are 30 cents each, one bag of pizza rolls, and one bag of chips a month. She gives me about six monsters and the occasional soda a month.  She buys me about two packs of smokes a month (wich is plenty as I am actively trying to quit). She also...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 11,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 11
        },
        "total_judged": 11,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-10T05:14:12.856120"
    },
    {
        "id": "1q84u4e",
        "title": "AITA for taking the camino de santiago alone?",
        "url": "/r/AmItheAsshole/comments/1q84u4e/aita_for_taking_the_camino_de_santiago_alone/",
        "body_summary": "Sorry for my bad english in advance. I (22f) am a uni student, and I'll finish my studies in july. My twin brother (22m) is still studying. I've always wanted to do the camino de santiago, and I know it would be so special to do it with my brother, because it has always been a dream for both of us. For this reason, I brought up the topic of the camino with him and our family, but they all said \"you guys have time, you can do it later on\". The thing is, they always say \"later on\" about everything, and we never end up doing anything. I know that doing the camino this summer would be the perfect time for me, because I have time and money that i've earned myself while working part time during my studies. I've thought about it for a long time and I decided to do the camino by myself, cause I kn...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 19,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-10T05:14:28.375841"
    },
    {
        "id": "1q82dl2",
        "title": "AITA for confronting my addicted father about money and respect instead of staying quiet?",
        "url": "/r/AmItheAsshole/comments/1q82dl2/aita_for_confronting_my_addicted_father_about/",
        "body_summary": "I’m 20F and live with my parents while my brother and I recently started college. My father has long-term issues with alcohol and risky financial behavior like day trading and gambling. Because of this, our family has been financially unstable for years.\n\nGrowing up, my father controlled all the money. I gave him every cent I earned from working, keeping almost nothing for myself. Despite that, there was no savings put aside for my education or my brother’s, and important bills are often ignored while he continues risky habits.\n\nTonight, I brought home food using my own money and sat down to eat. My father immediately accused me of being disrespectful, wasting his money, and having a bad attitude. He said eating food I bought for myself was selfish and inappropriate.\n\nI finally confronted ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 8,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 8
        },
        "total_judged": 8,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-10T05:14:43.816533"
    },
    {
        "id": "1q87j2t",
        "title": "AITA, Am I wrong for asking my sister-in-law not to hum or interrupt all the time? (Indian household context)",
        "url": "/r/AmItheAsshole/comments/1q87j2t/aita_am_i_wrong_for_asking_my_sisterinlaw_not_to/",
        "body_summary": "I’m from an Indian family and we all live together, so adjusting and compromising is kind of expected. I’m genuinely confused if I’m being unreasonable here or if my boundaries are just not being respected.\n\nWhenever I put music on the TV, my brother’s wife starts humming loudly along with it. I find it annoying because I can’t properly hear the song. I do understand that people enjoy music differently and humming might be her way of relaxing. Keeping that in mind, I once asked her very politely if she could please not hum while the song is playing.\n\nI wasn’t rude or aggressive at all, but she immediately got defensive. Her reaction really hurt me and left me feeling frustrated and guilty.\n\nThe part that makes this harder is that whenever I put on a movie, she keeps talking and interruptin...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 6,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 11
        },
        "total_judged": 11,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-10T05:14:59.273300"
    },
    {
        "id": "1q836hx",
        "title": "AITA, receiving a gift from my girlfriend and wanting to upgrade to another machine.",
        "url": "/r/AmItheAsshole/comments/1q836hx/aita_receiving_a_gift_from_my_girlfriend_and/",
        "body_summary": "Here’s the context: I, 25 (M) and 24 (F) have been in a relationship for almost 2 years. Recently she bought me a gift as a surprise for the holidays, she got me a machine which was decent and under 50$. Also, not to sound materialistic or anything, I also bought her gifts which would total to the amount of 100$. \n\nI was really excited and happy for the gift and have been testing it out since I’m really into coffee but not making my own. Since getting the machine, I’ve been looking for an upgrade because what she got doesn’t really give the freedom to practice and learn more and underperforms. I’ve been talking to her about the machines I have seen and told her that I’m considering to buy one myself in a few months time. She got upset and told me I don’t appreciate the gift however, it was...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 2,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 11
        },
        "total_judged": 11,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-10T05:15:14.754395"
    },
    {
        "id": "1q83wfb",
        "title": "AITA for not telling everyone about bestfriend:s sisters death?",
        "url": "/r/AmItheAsshole/comments/1q83wfb/aita_for_not_telling_everyone_about_bestfriends/",
        "body_summary": "Ok so for context I have a best friend, lets call her Jess for privacy reasons. She had a sister whose name we'll call Jane. \n\nNow we were on call playing roblox then she suddenly left the call game and texted a few minutes later she texted me that her sister was dead. \n\nFor more context, her sister was brain dead and required medical attention and so her mom and her sister AKA Jane would always drive to a city that was hours away because we live in a small town with a hospital who can't help with her condition. \n\nBack to the story so as I was saying yes, Jess told me Jane was dead because she was extremely sick and called me a couple of days later telling me to tell our friends about it because it hurts her emotionally and physically when she has to keep saying that her sister is dead. I ...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 0,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-10T05:15:30.279099"
    },
    {
        "id": "1q7zp4x",
        "title": "AITA for telling my boyfriend that his band sucks?",
        "url": "/r/AmItheAsshole/comments/1q7zp4x/aita_for_telling_my_boyfriend_that_his_band_sucks/",
        "body_summary": "I (19m) have been in a relationship with my boyfriend (21m) for almost a year now. He plays bass in a band. To be completely honest, the culture around the genre is a lot for me to handle, and I’m not particularly fond of the music itself. Absolutely nothing against him and his bandmates, it’s just not my thing.\n\nWe got into a playful argument about who’s more likely to succeed/be more successful. He said it wouldn’t be me, and I argued that his band sucks.  Honestly, it’s the truth. It’s not a great look for him, especially for someone who wants to succeed in the music industry. In no way am I saying that he is not talented, because he is. \n\nHe was genuinely upset with me after the fact, and I tried to apologize and rephrase what I said in the heat of the moment, but he was hurt nonethele...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 2,
            "ESH": 8,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-10T05:15:45.757292"
    },
    {
        "id": "1q88xty",
        "title": "WIBTA for putting a broken appliance back on someone’s curb after taking it for free?",
        "url": "/r/AmItheAsshole/comments/1q88xty/wibta_for_putting_a_broken_appliance_back_on/",
        "body_summary": "I saw an appliance on someone’s curb with a “free” vibe. It didn't have a sign, but my city doesn't have curbside pickup for appliances so there was no mistaking that it was on offer for anyone who wanted it. No sign saying it was broken or for parts, so I loaded it up and took it home.\n\nOnce I got it there, I realized it’s fully broken and now it’s my problem. I wasted time and gas hauling it, and now I’m stuck either paying to dump it or fooling somebody else into taking it. It had only been out for a couple hours in good weather, so there's no chance it was a working fridge that was ruined by the weather.\n\nPart of me wants to put it back on their curb, since they’re the ones who put broken junk out for strangers without saying anything. It feels fair in a karmic sense, since making peop...",
        "reddit_judgments": {
            "YTA": 38,
            "NTA": 0,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-10T05:16:01.501270"
    }
]