[
    {
        "id": "1qfi6aj",
        "title": "AITA for telling my teacher she’s not allowed to give my group member a better grade?",
        "url": "/r/AmItheAsshole/comments/1qfi6aj/aita_for_telling_my_teacher_shes_not_allowed_to/",
        "body_summary": "So I (16F) am in a group project class. we were in groups of 3, and I was paired with Lana (16F) and Ian (16M). we had a week to make a presentation. I did the research, wrote most of the scripts, and put together the slides. lana showed up once and gave me few printed pictures for a presentation, that's the only time she \"helped\" then she spent the rest of the week not doing anything, ian helped a bit, but not much. we all presented and the teacher said we all did a good job, then she graded us. (We use different grade system) lana got 10/10 ian got 9/10 and I got a 7/10\nI got upset and asked the teacher the reason she gave me the lowest grade, all she said was that lana was “more confident” during the presentation and ian “helped with the visuals” I said that I did 90% of the work and th...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 88,
            "ESH": 0,
            "NAH": 3,
            "INFO": 18,
            "TotalJudged": 116
        },
        "total_judged": 116,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-18T05:16:53.603130"
    },
    {
        "id": "1qfdxgr",
        "title": "AITA for insisting that guests in my home take off their shoes",
        "url": "/r/AmItheAsshole/comments/1qfdxgr/aita_for_insisting_that_guests_in_my_home_take/",
        "body_summary": "I (28, F) am British but ethnically Korean and I was brought up always to take your shoes off indoors (its a big part of korean culture not to wear shoes indoors). I know not everyone does that in their own homes, but in my home I dont wear shoes and I don't want others wearing shoes either, so I politely ask guests to take their shoes.\n\nRecently I had a hosted a dinner party for about 8 friends. Nobody had a problem except one who said her shoes were part of her outfit and she didn't want to take them off. I told her I'm sorry but I insist and she got angry. She refused and ended up storming off.\n\nAm I the asshole?",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 128,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 139
        },
        "total_judged": 139,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-18T05:17:00.582550"
    },
    {
        "id": "1qf6jef",
        "title": "AITA for not inviting my FIL to our wedding?",
        "url": "/r/AmItheAsshole/comments/1qf6jef/aita_for_not_inviting_my_fil_to_our_wedding/",
        "body_summary": "When people heard about the proposal everything was good, everyone was happy. Congratulations rolled in. Everything was looking great. That was eighteen months ago. Planning the wedding has mostly been okay, stressful but nothing we can’t handle.\n\n\n\nWhen it came to invites the topic of my (call her L) fiance’s dad came up. L’s dad wasn’t in the picture when she was growing up. When he was (very early on) apparently he was pretty awful to L and her mom. It’s one of those family secrets that everyone knows but doesn’t talk about.\n\n\n\nI’m 35 she’s 32, she hasn’t seen him since she turned 18.\n\n\n\nSo the question was, does he get invited? L didn’t have much to say. Her mom on the other hand said we should. A couple of cousins that were helping with everything were split. I didn’t feel like I had ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 21,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-18T05:17:16.327061"
    },
    {
        "id": "1qfer45",
        "title": "AITAH for not letting my friend use our address for school?",
        "url": "/r/AmItheAsshole/comments/1qfer45/aitah_for_not_letting_my_friend_use_our_address/",
        "body_summary": "I (28F) and my husband (28M) have been friends with Kaiden (35M) and Lisa (32F) for about 7 years. We met when we all lived in the same apartment complex.\n\nRecently, both of our families moved out around the same time. My husband and I moved into a house that is still within the school district our son (9) attends. Kaiden and Lisa moved outside of that district, and the school their daughter Cassie would attend now requires tuition, which they can’t afford.\n\nThey asked my husband if they could use our address so their daughter could stay in the district. My husband talked to me about it when he got home from work, and I said no. The school requires proof of address, and even if it didn’t, I’m pretty sure using someone else’s address is illegal and could get us into serious trouble if the s...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 36,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-18T05:17:32.276723"
    },
    {
        "id": "1qf94ba",
        "title": "AITA (25M) for wanting to stop paying rent for my ex (25F)?",
        "url": "/r/AmItheAsshole/comments/1qf94ba/aita_25m_for_wanting_to_stop_paying_rent_for_my/",
        "body_summary": "Hey Reddit\n\nI (25M) broke up with my ex (25F) after 2 years am moving out within the first month. We agreed I’d help her with the rent for 2 extra months (the lease requires 3 months after terminating the contract), but **I’m not on the lease**. Legally, I’m not obligated to pay, but I’ve been helping her out in good faith in an attempt to keep things peaceful and respectful.\n\nNow, things are starting to feel out of hand:\n\n* She’s made some unfair financial demands. For example, she got $500+ worth of furniture, and I had to fight hard to get my fair share. \n* While living together she also made me pay an extra $50/month (tied to me being better at handling my finances, also she is a student still). She still demands me to pay this...\n* She’s demanding 80% of the value of some dining furni...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 13,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 17
        },
        "total_judged": 17,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-18T05:17:48.094423"
    },
    {
        "id": "1qf89yr",
        "title": "AITA 38M for calling out my mom's 64F hurtful behavior towards my wife 34F?",
        "url": "/r/AmItheAsshole/comments/1qf89yr/aita_38m_for_calling_out_my_moms_64f_hurtful/",
        "body_summary": "I'm a 38M, married to my amazing wife (34F) for 6 years (dated 9 years prior). She's been part of the family for 15 years. My mom's behavior towards my wife has been hurtful and exclusionary. Examples:\n\n\\- Sympathy card for grandma's passing addressed \\_just\\_ to me 🤕. My wife and I had talked about grandma's passing together, and she was hurt my mom didn't include her bc my mom knows my wife was also very close to my grandma (my late father’s mother) who my mom has been divorced from for years before his passing\n\n\\- Gift for first-time fatherhood \\_just\\_ for me, diminishing my wife's role 🤷‍♂️. My wife was recovering from a C-section and felt hurt by the oversight.\n\n\\- Souvenirs: mom asks what \\_I\\_ want, I include my wife, but she's oblivious otherwise 😒. It's like she doesn't realize m...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 15,
            "ESH": 0,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-18T05:18:04.014963"
    },
    {
        "id": "1qf785e",
        "title": "AITAH for wanting to do a maternity photoshoot and baby shower even though my spouse and mother doesn’t believe in the idea",
        "url": "/r/AmItheAsshole/comments/1qf785e/aitah_for_wanting_to_do_a_maternity_photoshoot/",
        "body_summary": "I 28F and my husband 30M are having our first baby this year. I am over the moon and have dreamt of being a mum for a long time. My partner is introverted and doesn’t really like social media at all, I’m extroverted and don’t mind social media. I used to post heaps to private socials but in the past few years I haven’t posted as much besides the occasional photo dump or meme. My partner hates it when I post him and I’ve avoided posting him as much as I can without making it seem like he doesn’t exist in my life. For context we live far from family and have moved several times because of his career as doctor - social media is one way I keep in touch with people I’m close to. With our baby on the way my mother who is very superstitious expressed warnings about having a baby shower and my hus...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 45,
            "ESH": 1,
            "NAH": 4,
            "INFO": 5,
            "TotalJudged": 57
        },
        "total_judged": 57,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-18T05:18:20.650430"
    },
    {
        "id": "1qf6mtc",
        "title": "AITA I (24M) \"I'm not mad just disappointed\" my own father",
        "url": "/r/AmItheAsshole/comments/1qf6mtc/aita_i_24m_im_not_mad_just_disappointed_my_own/",
        "body_summary": "I'll start with this, I love my Dad, always have, always will. \n\nWhen I was around 10 my father remarried a woman (Jen). She was 45 and he was 50 when they married.\n\nJen has always had issues since I've known her. Very controlling and verbally abusive to myself, my father, and my siblings. Over the years I've watched time and time again, my Dad being a massive pushover/punching bag.\n\nJen is an alcoholic. She drinks everyday and would pass out on the living room floor in the middle of the night quite regularly. There were nights I couldn't sleep because she'd be sobbing till 4AM 15ft outside my bedroom door. \n\nThere was a few instances in which a drunk Jen was \"weird\" with me as a child. Such as coming in my room in the middle of the night, being VERY touchy, asking to do a \"wrap-around\", w...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 15,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-18T05:18:36.322643"
    },
    {
        "id": "1qf6vn0",
        "title": "AITA for fixing the broken printer in the office?",
        "url": "/r/AmItheAsshole/comments/1qf6vn0/aita_for_fixing_the_broken_printer_in_the_office/",
        "body_summary": "Our office printer's been down for days, and everyone's going crazy. People are having to print stuff at 7-Eleven just to get work done. I know a bit about fixing printers (I used to tinker with gadgets back in high school), so I took a look, fixed the jammed paper tray, and voilà. Thing is, the IT guy's now mad because I \"went behind his back\" and didn't let him handle it. He was gonna charge ₱5k to fix it, btw. Now everyone's saying I did a solid, but he's giving me the stares. AITA for fixing the printer? ",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 15,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-18T05:18:36.604976"
    },
    {
        "id": "1qfec0d",
        "title": "AITA for not helping with the groceries?",
        "url": "/r/AmItheAsshole/comments/1qfec0d/aita_for_not_helping_with_the_groceries/",
        "body_summary": "I work overnight, usually about 5-7pm to about 4-5am\n\nNeedless to say, I sleep all day.\n\nThe other morning around noon one of my roommates knocked on my door and excitedly said he got groceries for the whole house and it was a lot so could I help.\n\nI said no. he said please. I said f off. he said are you serious? I threw a shirt or something at the door and shouted to go away.\n\nHarsh, right? But here’s the thing.. I wasn’t in control of myself, istg. I didn’t even remember that happened until he brought it up later and I was legit like 😲 oh yeah.. sorry. because that really isnt me *at all*. I don’t raise my voice and im typically pretty accommodating, which is again, why I think my roommate was so offended and surprised. it was 100% some type of angry auto-pilot coma patient response.\n\nI ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 17,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 19
        },
        "total_judged": 19,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-18T05:18:52.311399"
    }
]