[
    {
        "id": "1qnbinh",
        "title": "WIBTAH if I asked my daughter’s preschool teacher not to put the extra clothes that I sent for her on other students?",
        "url": "/r/AmItheAsshole/comments/1qnbinh/wibtah_if_i_asked_my_daughters_preschool_teacher/",
        "body_summary": "So my daughter started school last Wednesday, and the teacher asked us to send pull-ups, wipes, and a change of clothes for her. I sent quite a few pull-ups, and a brand new pack of wipes, and an outfit as requested. Only the bottoms for her outfit came back, and I saw another student from her class, wearing her shirt when I went to pick her up. Now, I don’t mind if the teacher needs to use some of my daughter’s pull-ups for the other kids, or even some of her wipes. I’ll send extra of those things if needed because I understand what it’s like to be the parent that can’t provide that.  However, when it comes to her clothes, I’m not OK with sharing. For starters, if they get sent home on a kid (like the shirt did) then there’s a chance that the school won’t get it back, and clothes are real...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 134,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 137
        },
        "total_judged": 137,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-27T05:20:11.518352"
    },
    {
        "id": "1qnm84y",
        "title": "AITA for blocking my neighbors car?",
        "url": "/r/AmItheAsshole/comments/1qnm84y/aita_for_blocking_my_neighbors_car/",
        "body_summary": "in all the time ive lived here (6yrs) snow removal has been a non-issue but the building was sold last spring and this new guy apparently loves accumulation.\n\nbecause of that i didnt own a shovel, never needed one. but we got like 15” of snow and the landlord still hasnt plowed or cleared any snow. i am not looking forward to it freezing over so i walk to the store, buy a shovel, and dig my car out. i also dig a fatty path across the parking lot so i can pull out.\n\ni take care of a couple errands, gone maybe an hour, and this lady parks in my spot.. the only spot available yes but it’s there because of my labor. we don’t have assigned parking but we do always park in the same spots so it’s not like she doesn’t know who carved a path.\n\nim not digging myself another parking spot. im not very...",
        "reddit_judgments": {
            "YTA": 26,
            "NTA": 85,
            "ESH": 17,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-27T05:20:28.979189"
    },
    {
        "id": "1qnna42",
        "title": "AITA for snapping at a woman for assuming I must have it easier with my son cause hes gay?",
        "url": "/r/AmItheAsshole/comments/1qnna42/aita_for_snapping_at_a_woman_for_assuming_i_must/",
        "body_summary": "So for the record I have 3 kids 2 daughters and a son.. my son \" Griffin\" my oh so precious middle child is recently 15.  I grew up with 3 younger brothers and babysat male cousins so trust I know boys. He's at that boys age  where I can't get him to wear anything outside of ratty t shirts, jeans or sweats and all he wants to do  is hang out with his \" bros\" ,football,  his hidden old crusty tshirt under his bed ,or getting into trouble with that delinquent boyfriend of his.. He's of course practically a mini me of his dad  and picked up all the same frustrating  habits and attitudes. \n\nSo I have plenty to complain about it which  I did last weekend and I went on a bit of a girls trip with my friend Abigail and two of her coworkers while my ex had the kids. We got to talking rather more co...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 34,
            "ESH": 16,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 58
        },
        "total_judged": 58,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-27T05:20:44.900825"
    },
    {
        "id": "1qngxw7",
        "title": "WIBTA if I tell my husband to stop cooking me breakfast?",
        "url": "/r/AmItheAsshole/comments/1qngxw7/wibta_if_i_tell_my_husband_to_stop_cooking_me/",
        "body_summary": "I am a stay at home mom to a 1 year old child. I often end up having protein coffee and a protein bar for breakfast because I need something fast before my Velcro baby becomes little miss clingy. \n\nOccasionally when my husband has a remote day he will make us breakfast. But multiple times when he's make me eggs the eggs aren't fully cooked. I don't have an issue with a sunny side up egg with a running yolk but I'm talking omelet or scrambled eggs not fully cooked. I can't stomach it. I told him last time he made breakfast because I don't like wasting food but I can't manage to eat it. \n\nHe did it again this morning and I'm staring down at a runny omelet. Would I be the asshole to tell my husband that though I appreciate him trying to make sure I get food in my stomach, if he doesn't cook m...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 51,
            "ESH": 3,
            "NAH": 6,
            "INFO": 3,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-27T05:21:02.817671"
    },
    {
        "id": "1qnsg62",
        "title": "AITA for not giving up my uni plans for my cousin?",
        "url": "/r/AmItheAsshole/comments/1qnsg62/aita_for_not_giving_up_my_uni_plans_for_my_cousin/",
        "body_summary": "I (17F) am an only child and I’m from a country where private universities are more reputable than public schools and a lot more expensive but my parents make enough to fund my education there so I applied for and got accepted. I have a cousin (11F) who I’m not close with and she has had her dad walk out on her and her mom (my aunt). Again, this isn’t a country where they can file for child support accessibly although they are trying to. Now my dad (her uncle) wants to pay for her tuition (she goes to a private school as well) until they get back on their feet. However my dad has said it will be a struggle to fund for both of us simultaneously and is insinuating that I  defer my offer and take a gap year. AITA for refusing this and going ahead with my uni plans even if it means my cousin m...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 35,
            "ESH": 0,
            "NAH": 4,
            "INFO": 0,
            "TotalJudged": 39
        },
        "total_judged": 39,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-27T05:21:18.722827"
    },
    {
        "id": "1qntpy9",
        "title": "AITA for telling my husband to book his own flight on our family holiday?",
        "url": "/r/AmItheAsshole/comments/1qntpy9/aita_for_telling_my_husband_to_book_his_own/",
        "body_summary": "So for context my husband and I have been planning a family holiday for the past couple of years. Our eldest is sixteen and our youngest is now at the age where she'll remember the vacation. I've been saving and putting money aside for my flights and half for the kids flights.\n\n  \nI've been telling my husband for the past few months that I want to book the flights in January. We recently sold our house and I even put some of his money aside so he wouldn't spend it. He's now had to use some of his saved money to pay parking fines.\n\n  \nI've basically told him that I'm going to book mine and the kids flights and he can book his flight when he has the money. He's then said 'Well it doesn't feel like a family holiday, doesn't even feel like you want me there' and I can't help but feel this is e...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 20,
            "ESH": 13,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 43
        },
        "total_judged": 43,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-27T05:21:34.613655"
    },
    {
        "id": "1qn8waw",
        "title": "AITA for yelling at my friend during a kitchen fire?",
        "url": "/r/AmItheAsshole/comments/1qn8waw/aita_for_yelling_at_my_friend_during_a_kitchen/",
        "body_summary": "This happened this past Friday when I (31F) was FaceTiming my friend “Alex” (28F) while we were cooking dinner. For some context: I love Alex, like if I needed to hide a body she is 100% the person I would call. She’s also just a really bad cook, the main reason being she’s terrified of fire/hot oil because of an accidental burn she got as a kid. But she said she’s tired of living off takeout so I said why don’t we FaceTime while cooking the same meal so it’s less scary (we don’t live in the same city).\n\nFriday comes, I don’t remember what we’re talking about but the camera’s angled so I could see she was standing in front of the stove when the contents of one of the pans caught on fire. Alex freaks out, looks around and doesn’t seem to know what to do, so I stop what I’m doing and tell he...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 41,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 43
        },
        "total_judged": 43,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-27T05:21:50.243140"
    },
    {
        "id": "1qnvwx9",
        "title": "AITA for filing a police report after the guy who rear-ended me backed out of our cash agreement?",
        "url": "/r/AmItheAsshole/comments/1qnvwx9/aita_for_filing_a_police_report_after_the_guy_who/",
        "body_summary": "I was rear-ended at a red light a few weeks ago. The damage to my car wasn’t huge, mostly cosmetic, and it was clearly his fault. We pulled over, exchanged info, and talked it out.\n\nHe asked if we could avoid insurance and said he’d pay me cash. I agreed, since it didn’t seem worth the hassle. We agreed on 200 euros, and he said he’d pay me the next day.\n\nThe next day, I called him about it and he suddenly changed his tone. He said we “should’ve handled it yesterday” and that since we didn’t, he didn’t want to pay anymore. He basically acted like the deal was off and told me to move on.\n\nAt that point, I filed a police report and provided all the details of the accident. Because of that, his license ended up being suspended.\n\nNow he’s furious and says I completely screwed him over and made...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 48,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-27T05:22:05.880914"
    },
    {
        "id": "1qnprjt",
        "title": "AITA for not allowing my estranged aunt to have access to shared photo album",
        "url": "/r/AmItheAsshole/comments/1qnprjt/aita_for_not_allowing_my_estranged_aunt_to_have/",
        "body_summary": "My (F29) grandmother reached out to me and asked if I could add her daughter (my aunt) to the shared photo album of my 1 year old son. One might think this is not a big deal; however I have no real relationship with my aunt. She lives across the country and I have maybe seen her 5 times in my whole life. She has never really made an effort with me or my brother and only sends the occasional “Happy Birthday” text. If my grandmother did not talk to my aunt every day and report my life to her and if my aunt did not follow me on social media, my aunt would know nothing about me. Essentially, I would classify us as strangers.\n\nEver since I had my son, my aunt has been commenting on my instagram posts of him and even sent him a present (which is very strange to me). Today my grandmother asked if...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 22,
            "ESH": 2,
            "NAH": 8,
            "INFO": 0,
            "TotalJudged": 35
        },
        "total_judged": 35,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-27T05:22:21.533490"
    },
    {
        "id": "1qnvb1g",
        "title": "AITA for not telling my girlfriend that I sometimes wake up when she talks to me in my sleep?",
        "url": "/r/AmItheAsshole/comments/1qnvb1g/aita_for_not_telling_my_girlfriend_that_i/",
        "body_summary": "I (32M) have been dating my girlfriend (27F) for about 6 months.\n\nI talk in my sleep. I’ve had previous partners tell me they could have full “conversations” with me while I was asleep. I don’t think I say anything very coherent or meaningful.\n\nAbout 2 months into our relationship, one night I woke up and realized my girlfriend was talking to me while I was asleep. She said, “I love you.” Half awake and slurring, without her realizing I was awake, I replied, “I love you too,” and then pretended to still be asleep. She started giggling and seemed really happy.\n\nSince then, this has happened multiple times. She sometimes talks to me while I’m sleeping, and occasionally I wake up briefly and mumble responses before drifting back to sleep. Most of the time it’s harmless stuff, but once she ask...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 11,
            "ESH": 0,
            "NAH": 9,
            "INFO": 0,
            "TotalJudged": 21
        },
        "total_judged": 21,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-27T05:22:37.087556"
    }
]