[
    {
        "id": "1mkyw4k",
        "title": "AITA for telling my youngest daughter she may not post a video of me having a hot flash ?",
        "url": "/r/AmItheAsshole/comments/1mkyw4k/aita_for_telling_my_youngest_daughter_she_may_not/",
        "body_summary": "My youngest daughter (19f) lives at home. I (51f) was having a hot flash and I knew my daughter was filming me. My tank top stayed on, so nothing inappropriate was filmed. \n        Later in the day, my daughter asked me if she can post the video on TikTok. She talked about how a lot of people will get something out of watching it. I told my daughter no and I stood firm during her begging. \n             She told her father (53m), who is my husband, and he asked me to reconsider. He told the video is hot (pun intended) and not embarrassing at all. I told him no. My daughter confronted me when her father said he couldn't change my mind. My daughter told me I was being mean to her. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 150,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 151
        },
        "total_judged": 151,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-09T05:12:15.557518"
    },
    {
        "id": "1ml6a9q",
        "title": "AITA - Tore down a road memorial on my property",
        "url": "/r/AmItheAsshole/comments/1ml6a9q/aita_tore_down_a_road_memorial_on_my_property/",
        "body_summary": "There has been a road side memorial on the corner of my property for sometime, someone died while driving drunk and hit a tree there in 2002. Nobody had been back to maintain the memorial site for at least 5 years. It was overgrown, the cross was rotting and falling apart, most of sign  they left was faded and unreadable. \n\nSo I was planning on putting a privacy fence around my property and it goes right through the memorial site.  Because of the state of it I ended up just clearing it all out and built the fence last year. \n\nThis past week I got a knock on my door from a very angry person claiming I destroyed their property and theyre claiming they will sue me. So am I the asshole, should I have just left it? This was fully on my property",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 110,
            "ESH": 0,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-09T05:12:17.490656"
    },
    {
        "id": "1ml4xn2",
        "title": "AITA for not letting my roommates parents sleep in my room while I was gone?",
        "url": "/r/AmItheAsshole/comments/1ml4xn2/aita_for_not_letting_my_roommates_parents_sleep/",
        "body_summary": "OP (26F) went out of town. Roommate Lily (27F) wanted her parents to stay in OP's room. OP refused, citing privacy concerns. Lily booked a hotel for them. Now Lily's passive-aggressive. AITA for not letting her parents stay in my room?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 131,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-09T05:12:19.205910"
    },
    {
        "id": "1mkrhqo",
        "title": "AITA for not giving an older co worker a ride home?",
        "url": "/r/AmItheAsshole/comments/1mkrhqo/aita_for_not_giving_an_older_co_worker_a_ride_home/",
        "body_summary": "OP, new to the job and with a learning disability, was mocked by her trainer. The trainer made ableist comments and complained to management. OP confronted her, but the trainer was dismissive. At shift end, the trainer asked OP for a ride. OP refused, citing discomfort. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 143,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-09T05:12:23.390688"
    },
    {
        "id": "1mkvhow",
        "title": "AITA for not telling my sister the real reason I didn’t want to help her on a trip and causing a fight with my mom?",
        "url": "/r/AmItheAsshole/comments/1mkvhow/aita_for_not_telling_my_sister_the_real_reason_i/",
        "body_summary": "OP (19F) babysits Becky's 4 kids often. Becky wanted OP to go to New Jersey to help with the kids, but OP refused & offered to babysit instead. Mom intervened, forbidding OP to help. Becky called OP an AH. AITA for refusing & telling Mom?\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 98,
            "ESH": 4,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 113
        },
        "total_judged": 113,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-09T05:12:26.201766"
    },
    {
        "id": "1ml7se1",
        "title": "WIBTA for reporting a coworker for asking me if I was pregnant?",
        "url": "/r/AmItheAsshole/comments/1ml7se1/wibta_for_reporting_a_coworker_for_asking_me_if_i/",
        "body_summary": "OP's coworker asked if she was pregnant, the second time in over a year. OP had a hysterectomy and finds the question inappropriate. WIBTA if OP reported the coworker to their boss?\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 61,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 71
        },
        "total_judged": 71,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-09T05:12:28.177592"
    },
    {
        "id": "1ml8v3x",
        "title": "AITA for telling my coworker her baby looks like Danny DeVito?",
        "url": "/r/AmItheAsshole/comments/1ml8v3x/aita_for_telling_my_coworker_her_baby_looks_like/",
        "body_summary": "My coworker came in last week to show off her newborn. Everyone was teller her how cute he was, and when it was my turn, I said, “Wow, he’s adorable… kinda like a baby Danny DeVito.”\n\nI genuinely meant it as a compliment because I love Danny DeVito. The room went dead silent, she grabbed the baby, and now she’s barely talking to me.\n\nApparently she told HR I was “mocking her child” and now I’m wondering if I really crossed a line.\n",
        "reddit_judgments": {
            "YTA": 77,
            "NTA": 24,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 103
        },
        "total_judged": 103,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-09T05:12:30.581671"
    },
    {
        "id": "1ml6kf7",
        "title": "AITA for telling my daughter she can't get a new hairstyle to impress some boy ?",
        "url": "/r/AmItheAsshole/comments/1ml6kf7/aita_for_telling_my_daughter_she_cant_get_a_new/",
        "body_summary": "I (34f) have a daughter (13f) who wants to cut her waist-length blonde hair. Cut it to less than an inche. All this to impress her crush (14m). I said no and she called me an overbearing mom. My husband (35m) says he understands why I did it but my tactics were bad. He said that maybe our daughter wouldn't tell us when has dramatic plans. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 113,
            "NTA": 15,
            "ESH": 0,
            "NAH": 16,
            "INFO": 8,
            "TotalJudged": 152
        },
        "total_judged": 152,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-09T05:12:35.509747"
    },
    {
        "id": "1ml40cp",
        "title": "AITA for declining to help taking care of my sister's mother in law",
        "url": "/r/AmItheAsshole/comments/1ml40cp/aita_for_declining_to_help_taking_care_of_my/",
        "body_summary": "OP's sister, who lives abroad, wants OP to help care for her MIL for 3 months/year. OP resents this, feeling it's unfair to him, his mom, and GF. OP asks: AITA for not wanting to help and feeling sister is taking advantage?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 45,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-09T05:12:36.709390"
    },
    {
        "id": "1mkzf7l",
        "title": "AITA taking my brother to a crowded place, now my mum isn't talking to my step dad?",
        "url": "/r/AmItheAsshole/comments/1mkzf7l/aita_taking_my_brother_to_a_crowded_place_now_my/",
        "body_summary": "OP took his ASD brother to a planetarium, which he enjoyed. Mom freaked out about the crowds. Stepdad defended OP, causing marital conflict. AITA for taking brother out?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 16,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 18
        },
        "total_judged": 18,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-09T05:12:37.630583"
    }
]