[
    {
        "id": "1qrwluw",
        "title": "WIBTA If I told my neighbor that I can see everything?",
        "url": "/r/AmItheAsshole/comments/1qrwluw/wibta_if_i_told_my_neighbor_that_i_can_see/",
        "body_summary": "Not *totally* sure this fits here but I would like some advice about how to broach this subject with my neighbor. \n\nI live in an apartment complex and we all have floor to ceiling windows. I have a neighbor who lives a few doors down, we have spoken maybe 5 words to each other.  \n\nThe thing I dont know how to bring up is her window faces my windows at a pretty weird angle, so any time I look out my own window its like a perfect view of her apartment.  \n\nRecently, she's been walking around a lot less clothed, going to the bathroom with the door open, things like that. So any time I look out my window its just right there.  \n\nI'm literally not trying to be a creep. I'll be checking to see if a friend is pulling up, or watching the birds with my cats, whatever it is but its the first thing I ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 53,
            "ESH": 0,
            "NAH": 7,
            "INFO": 2,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-01T05:53:53.591242"
    },
    {
        "id": "1qrx4rf",
        "title": "AITA for cancelling my wedding but still getting married in private?",
        "url": "/r/AmItheAsshole/comments/1qrx4rf/aita_for_cancelling_my_wedding_but_still_getting/",
        "body_summary": "My fiancé (38M) and I (34F) are supposed to get married this summer. We have a son who will be around 1 at the time.\n\nWe don’t want a traditional wedding. We’re both autistic and all the wedding expectations (attention, speeches, parties, family stuff) are just too much.\n\nMy parents paid a deposit for a venue, but my family, especially my mom, doesn’t respect boundaries well and would push no matter what.\n\nSo we’re cancelling the venue, paying my parents back, and saying the wedding is postponed. On the original date, we’ll get married quietly in a church with just us and our kid, then go bowling or something. No guests, no announcement beforehand.\n\nWe’re not telling our families because my family will try to interfere or show up anyway.\n\nI feel bad knowing they’ll be disappointed when the...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 105,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 107
        },
        "total_judged": 107,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-01T05:54:01.909453"
    },
    {
        "id": "1qsfqt7",
        "title": "WIBTA for keeping photos of my late sister + her separated mom and dad if the new wife of dad asks for those photos not to be included?",
        "url": "/r/AmItheAsshole/comments/1qsfqt7/wibta_for_keeping_photos_of_my_late_sister_her/",
        "body_summary": "I am currently composing a slideshow of my late sister’s life for her funeral. The photos span from birth until now. My mom and I have 3-4 photos that include my sister, my mom, and her dad around ages 0/3\n\n\\- For instance, a photo of them holding her at her baptism, a family photo at 1 years old, and her first birthday (them holding her).\n\nFor context, the new wife of the dad has asked to not include photos of the mom and dad with my sister and to simply omit them (going as far as telling me I shouldn’t be dwelling on it). My mom and my sister’s dad have been split since she was little, and she was in her 30s when she passed. The new wife has been in the picture since late 2010s and both parties (mom and her dad, have had little contact since). \n\nWIBTA to keep the photos (3-4) in that inc...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 125,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 126
        },
        "total_judged": 126,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-01T05:54:10.380156"
    },
    {
        "id": "1qs0835",
        "title": "AITA for keeping the money from a ticket sale after the buyer backed out and abandoned it?",
        "url": "/r/AmItheAsshole/comments/1qs0835/aita_for_keeping_the_money_from_a_ticket_sale/",
        "body_summary": "My wife, her friend, and I planned to go to a concert this past weekend. I’ll call the friend “Julie.”\n\nA few months ago, I bought three tickets all together. Julie paid us back in cash for her ticket.\n\nThe day before the concert, Julie suddenly backed out. By that point, I had already picked up the physical tickets.\n\nAt first, we told Julie she could still come pick up her ticket if she wanted to sell it or do something else with it. She didn’t. She made no effort to retrieve it. We even tried to find a buyer for her ourselves, but nothing worked out right away.\n\nAfter that, Julie told us to just keep the ticket or throw it away.\n\nI thought tossing it was a complete waste, so I decided to find a buyer myself and sell it. I ended up doing the coordination, messaging, and logistics to make ...",
        "reddit_judgments": {
            "YTA": 48,
            "NTA": 63,
            "ESH": 0,
            "NAH": 4,
            "INFO": 2,
            "TotalJudged": 117
        },
        "total_judged": 117,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-01T05:54:18.995140"
    },
    {
        "id": "1qsiosd",
        "title": "AITA for interrupting my autistic brothers routine for my own physical pain?",
        "url": "/r/AmItheAsshole/comments/1qsiosd/aita_for_interrupting_my_autistic_brothers/",
        "body_summary": "Throw away because I think my friends know my account\n\nI, 17F, have a brother, 15M, who is autistic. He has a routine where he comes downstairs at night, watches TV when no one else is down, and falls asleep on the couch.\n\n Lately, my bed has become uncomfortable to the point of pain. For context, I have hyper flexibility/a connective tissue disorder and scoliosis, and as a result of my scoliosis, my shoulders are wonky and my left shoulder blade grinds against my ribs, but also causes generic pain and means that too much pressure on my back for an extended period of time causes quite severe pain, such as laying on my mattress.\n\n My mattress is very old, it came from my older sister who had it for 10+ years in somewhat mild-moderate use and I've now had it for 5+ years. The foam on top of ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 54,
            "ESH": 1,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 60
        },
        "total_judged": 60,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-01T05:54:27.573360"
    },
    {
        "id": "1qsemgw",
        "title": "AITA for telling my family owing me money they should not go on vacation?",
        "url": "/r/AmItheAsshole/comments/1qsemgw/aita_for_telling_my_family_owing_me_money_they/",
        "body_summary": "Two years ago I got a big income.\n\nMy aunt and uncle have a restaurant and it’s going pretty bad. They asked me if I could give them 8000 euros and will pay me back when they manage to sell the restaurant.\n\nTwo years later the restaurant is still there. Everytime I hear from them it’s about how they are in a terrible situation.\n\nA week ago I scrolled on Facebook and saw them on holiday in Ibiza. For people owing me 8000 euros and apparently in big trouble I found it quite curious they could go to Ibiza. So I message them asking how it’s going. They tell me it’s great, so nice to be holiday after struggling for years.\n\nThat’s great and all but I’m like… you owe me money. And I tell them things don’t seem that bad if they can go to Ibiza. They tell me they saved money for a year to get a vac...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 71,
            "ESH": 10,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 86
        },
        "total_judged": 86,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-01T05:54:35.724529"
    },
    {
        "id": "1qshom5",
        "title": "AITAH? Neighbor using tree lawn to back in.",
        "url": "/r/AmItheAsshole/comments/1qshom5/aitah_neighbor_using_tree_lawn_to_back_in/",
        "body_summary": "Hey yall! Recently I’ve had to fix my mailbox twice - once it was hanging in by a thread and the second time it was leaning pretty bad. My neighbor got a new truck which I’m assuming is what is hitting my mailbox - I haven’t accused him of it because I’m not sure. However today I noticed that he uses my tree lawn, side walk, and grass to back into his driveway. Since we’ve had snow and ice it’s beginning to become a muddied up mess. I watched him three different times today back in using my yard. He literally pulls into my yard to then back in instead of going past his driveway to back in like you typically would to back into a driveway.\n\nMe being me, I know I reactive I am so I had my boyfriend simply ask him to not use my yard. His response was “it’s just hard to back in that’s why I do ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 52,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-01T05:54:44.012816"
    },
    {
        "id": "1qsg0ej",
        "title": "AITA for telling my brother to let go of the dog?",
        "url": "/r/AmItheAsshole/comments/1qsg0ej/aita_for_telling_my_brother_to_let_go_of_the_dog/",
        "body_summary": "I (18) have a chiweenie as a family pet. She is 1 year old and likes to snuggle. I am the one in my family that takes care of her the most because I get home before everyone else (I walk home after school most days). My chiweenie likes to be with me most of the time because of this.\n\nMy brother (6 1/2) likes to play with the dog. The problem is that he likes to try and pick her up/carry her around, usually when she’s already sitting/lying down. Once she’s settled, my chiweenie will prefer not to be bothered and go to sleep. My brother will try to, regardless of how much the dog squirms, hold onto her and refuse to let her go.\n\nHe will not listen if you try to tell him nicely. He will start crying on purpose if you insist. This has been a problem ever since we got the dog.\n\nNot too long ago...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 55,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-01T05:54:52.003210"
    },
    {
        "id": "1qs50xz",
        "title": "AITA for asking my friend's new SO what they do for work in our first meeting?",
        "url": "/r/AmItheAsshole/comments/1qs50xz/aita_for_asking_my_friends_new_so_what_they_do/",
        "body_summary": "Hi, I (in my 20s, F) and a friend just met our mutual friend (let's call them A)'s new SO in person for the first time today. All four of us went to see Avatar before we had late lunch at a nearby restaurant. Tbf from the stories A has told us, I did not have the best impression of them; regardless, the SO did not sound like a totally horrible person, and A really seemed to like them, so our friend group did not try to stop them from getting into this relationship. \n\nFor context, our friend group is all from an East Asian country, while the SO is from North America, but now living in our country. A and SO had been dating for almost 2 weeks before we met them. \n\nSo, the movie thing was fine since we did not get to speak much, but I was kinda bored (so sorry to Avatar fans) and tired from si...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 118,
            "ESH": 0,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 127
        },
        "total_judged": 127,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-01T05:55:00.670189"
    },
    {
        "id": "1qs9cy6",
        "title": "AITAH for scolding my boyfriend about bossing my cousin around?",
        "url": "/r/AmItheAsshole/comments/1qs9cy6/aitah_for_scolding_my_boyfriend_about_bossing_my/",
        "body_summary": "I (East Asian 34f) introduced my boyfriend (south asian 32m) to my extended family for the first time. It was a family gathering at my cousin’s home. In my family it’s not really normal for someone to command someone to do something, as opposed to asking if they can tell you where something is, so you can do it. Unless you’re an elder talking to a kid, and even then they still don’t instruct you, unless you were their own kid.\n\nThat said, not too long after being there, my boyfriend said to my cousin (31f), whose home we were in as guests, “hey, can you make me coffee”. This particular cousin is a very agreeable compliant person compared to my other cousins (you can just tell which cousins are more of a pushover and approachable than others), so she said sure okay. But I was just in shock....",
        "reddit_judgments": {
            "YTA": 19,
            "NTA": 41,
            "ESH": 1,
            "NAH": 7,
            "INFO": 4,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-01T05:55:09.546845"
    }
]