[
    {
        "id": "1q2pmcr",
        "title": "AITA for asking that my sister signs a contract on a small loan",
        "url": "/r/AmItheAsshole/comments/1q2pmcr/aita_for_asking_that_my_sister_signs_a_contract/",
        "body_summary": "For Context, I’m 23F and my sister is 25F. We grew up very poor and finances were always tough. We also have had bad experiences with loaning our parents money, I decided 2 years ago that I would not loan any money to them, She on the other hand still does so to this day. To make matters worse we have never truly seen eye to eye. In my opinion she has poor conflict resolution skills so I try to avoid getting in to conflicts with her.\n\nAround 2 years ago, I decided to make changes to my life and paying off debts and living sustainably. I have a decent amount of savings and investments. So yes, even though I have some savings. I still live at home and live within my means. And I am actively saving up for a house which she is fully aware of. \n\nAround 5 months ago, she asked to borrow £1000 fo...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 43,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-04T05:18:50.644163"
    },
    {
        "id": "1q2ucko",
        "title": "AITA for telling my mom to stop trying to fix the relationship I have with my dad",
        "url": "/r/AmItheAsshole/comments/1q2ucko/aita_for_telling_my_mom_to_stop_trying_to_fix_the/",
        "body_summary": "I (20F) never had a good relationship with my father. He was never there for me, he would complain when he had to spend money on me. He loved other people kids instead of his own.\n\nMy mom always trying to be the middle man would always say. “Come on he your only dad” or “ he old he doesn’t know what he saying”. Mind you this man would compare his daughter to other people daughters. For example when I was 17 to 18 he asked me why I don’t wear make up or go outside much. He told ME “ would aren’t you like Amy (fake name) she does her make and always go out”. Mind you Amy was 16 to 17 doing drugs, sleeping with older man. But recently she changed her life good for her.\n\nBut recently he just been calling me for money. When I picked up his call not a hi or a how are you just can I borrow money....",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 11,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 13
        },
        "total_judged": 13,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-04T05:19:06.109686"
    },
    {
        "id": "1q2thas",
        "title": "AITA for not wanting this last name again?",
        "url": "/r/AmItheAsshole/comments/1q2thas/aita_for_not_wanting_this_last_name_again/",
        "body_summary": "\nHey everyone, hope all is well.\n\n\nMy parents divorced when I was 2, due to my Dad cheating. He played a big role in my life when i was younger. I was even introduced to his \"new girlfriend,\" the woman he cheated with. I could tell right off the bat she didn't like me, and i didn't like her. She took my dad away, she took my family life away etc etc.\n\n \n\nThen, around when i was 6 years old, I overheard my grandfather(dad's dad) tell someone, \"my son is getting married on so by so date\". I begged and cried constantly to attend the wedding. The wedding day passed, not an invite nor a call, all the family was in attendance except me.\n\n \n\nWhen I was around 8, my dad called me one night and said, \"you have a brother now\". I was in shock. I didn't even know my step-mother was pregnant because th...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 17,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 19
        },
        "total_judged": 19,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-04T05:19:21.699438"
    },
    {
        "id": "1q2r14f",
        "title": "AITA for screaming at my aunt at a family gathering",
        "url": "/r/AmItheAsshole/comments/1q2r14f/aita_for_screaming_at_my_aunt_at_a_family/",
        "body_summary": "AITA for screaming at my aunt at a family gathering\n\nI’m an 18-year-old male, half Filipino and half American, currently in my first year of college in the Philippines. I’ve lived here since grade 6 (about 8 years), and the adjustment has been difficult both socially and academically. I’ve always planned to return to the U.S. for college because it’s extremely hard to be a working student here, courses don’t transfer well, and Philippine universities generally don’t offer associate degrees, which affects FAFSA Pell Grant eligibility.\n\nI discussed this plan with my parents, and they initially seemed supportive. The only issue was that my U.S. passport had expired. However, a week later my dad suddenly told me he wouldn’t help me go anymore, which confused me because he had been supportive b...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 10,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 17
        },
        "total_judged": 17,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-04T05:19:37.465521"
    },
    {
        "id": "1q2m8vq",
        "title": "AITA for the Christmas Gift I gave my friend?",
        "url": "/r/AmItheAsshole/comments/1q2m8vq/aita_for_the_christmas_gift_i_gave_my_friend/",
        "body_summary": "I had a friend and his wife around for a Christmas lunch. We exchanged small Christmas gifts, nothing expensive but my wife reckons I chose poorly and need to make amends.\n\nMy friend got me a Batman comic compilation (he knows I like Batman), it's clearly used but still its a nice sub $20 gift. \n\nI gave him a free book I got with a subscription. It's one of those that the organisation I subscribe to produces just for its members. It's about the countryside which my friend visits ocassionally. \n\nBut my wife says the lack of a price on the item and the fact its not tailored to my friend's likes shows a lack of effort/interest. It's only a small gift. AITA and if so how should I make amends?",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 5,
            "ESH": 0,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 15
        },
        "total_judged": 15,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-04T05:19:37.635167"
    },
    {
        "id": "1q2nql4",
        "title": "AITA for preferring my friends over my family",
        "url": "/r/AmItheAsshole/comments/1q2nql4/aita_for_preferring_my_friends_over_my_family/",
        "body_summary": "For context my family is visiting after I hung out with them in a different state for a while and now I'm back in my home state and they're staying for a while to hangout with family here. They wanted to tag me along so I went with them for a day to hangout and I also brought along my friends so we could all hangout. Then I had planned previously for the day after that I could hangout with my friends and they would come over but my family wanted to hangout and I told them like last minute I wanted to hangout with my friends instead of them but I said it in a really apologetic manner cause I had felt really bad but now I feel like I'm an asshole for telling them I don't want to hangout even though I much prefer my friends purely cause they have done more for me in the past than my family th...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 4,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 7
        },
        "total_judged": 7,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-04T05:19:53.041688"
    },
    {
        "id": "1q2t2sl",
        "title": "AITA for yelling at my dad?",
        "url": "/r/AmItheAsshole/comments/1q2t2sl/aita_for_yelling_at_my_dad/",
        "body_summary": "I'm 16 years old. I have 2 weeks vacation with absolutely nothing planned. No family trips, nothing. So I like spending my time gaming with friends online.\nI have an American friend who gets home from work really late in my timezone, so I end up staying up until around 6 AM to play some games with them. And then the plan is to wake up at around 4 PM, because I like my 10 hours of sleep.\nMy family knows about this. Not because I'm loud or anything, but because my dad always wakes up at around 6 AM, so he found out and told everyone.\nThe only problem is, no one can leave me alone. Today I was woken up at 11:30 AM because my dad came in my room and asked: \"are you still sleeping??\" And left. Then at 12:00 PM my mom basically did the same thing. Then at 12:15 PM my brother came in my room to s...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 8,
            "ESH": 4,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 17
        },
        "total_judged": 17,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-04T05:20:08.503265"
    },
    {
        "id": "1q2mrtg",
        "title": "AITA for calling out my friends for not wanting to have lunch with us?",
        "url": "/r/AmItheAsshole/comments/1q2mrtg/aita_for_calling_out_my_friends_for_not_wanting/",
        "body_summary": "Me and my friend group (all 20M) hadn't really hung out together since almost 4 weeks ago so we agreed to all go eat at a local restaurant and from there go to the bowling alley and basically spend the afternoon/night bowling, however we didn't really decide at what hour we'd all go to the restaurant.\n\nSo yesterday one of my friend's (we'll call him R) did a poll on our Whattsapp group at 12 PM the day before asking if we were all still going to the bowling alley, out of the 5 of us, 4 of us voted yes, the only one who didn't vote was P (another friend). At 4 PM R did another poll asking what day we were going, Friday or Saturday, and 3/5 voted Saturday, with P and A (another friend) not voting anything. And finally at 6 PM the final poll was done asking if we were going for lunch or for d...",
        "reddit_judgments": {
            "YTA": 18,
            "NTA": 0,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-04T05:20:24.124712"
    }
]