[
    {
        "id": "1pn7xlh",
        "title": "AITA for testifying against my brother in a custody case after he abandoned his child?",
        "url": "/r/AmItheAsshole/comments/1pn7xlh/aita_for_testifying_against_my_brother_in_a/",
        "body_summary": "I 25F have an older brother 28M. Growing up my mom spoiled him a lot and still has a habit of excusing his behavior because that’s her son. This situation has completely fractured my family, and now I’m being told I’m a terrible sister.\nMy brother was in a long-term relationship with his ex-girlfriend Lena 27F. They have a son together who is now 5. Lena and I became very close during their relationship, and even after they broke up, I stayed involved in my nephew’s life. I babysit, help with school stuff, and I’m basically one of his safe adults. When my nephew was around 2, my brother left. Not just emotionally he abandoned them. He moved out, stopped helping financially, barely called, and eventually cut contact entirely after getting involved with another woman. Lena struggled a LOT du...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 159,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 160
        },
        "total_judged": 160,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-16T05:15:17.287255"
    },
    {
        "id": "1pn2kzk",
        "title": "AITA For asking my stepdaughters to allow me to stay on the first floor?",
        "url": "/r/AmItheAsshole/comments/1pn2kzk/aita_for_asking_my_stepdaughters_to_allow_me_to/",
        "body_summary": "My husband and I have been married for three years, his daughters are 16 and 17. I've always tried to get along with the girls, they're polite and their mother is really kind. \n\nMy husband's house has two floors; The girls have their rooms on the first floor and my husband slept on the second floor, when I moved in we still lived that way as it was honestly not a nuisance to me. \n\nThe problem is that I am pregnant now, it is a risky pregnancy and I have to be at rest all the time so climbing the stairs scares me and the doctor said that it would be good if I tried not to climb them for now. My plan was to offer one of the girls to sleep on the second floor and me and my husband would sleep in one of their bedrooms for now, They come four days a week lately so I didn't think it would be too...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 81,
            "ESH": 1,
            "NAH": 8,
            "INFO": 4,
            "TotalJudged": 98
        },
        "total_judged": 98,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-16T05:15:37.321319"
    },
    {
        "id": "1pnfgfe",
        "title": "AITA for wanting to keep my engagement ring from my late fiancé?",
        "url": "/r/AmItheAsshole/comments/1pnfgfe/aita_for_wanting_to_keep_my_engagement_ring_from/",
        "body_summary": "I'm using a throwaway as I don't want the drama of this on my main reddit I hope you all understand.\n\nI (36F) lost my fiancé nearly eleven years ago in car crash. We were both in the car but I got out with only minor injuries while he died instantly. This messed me up quite a bit and I was in and out of therapy and support groups for years over this. The support group is where I met my current partner (45M), he is a widower who lost his wife to cancer and we understood each others pain a lot and bonded over it. Three years ago we started dating and we moved in with each other last month.\n\nI've remained close with the family of my late fiancé since I lost him and they were a great support to me in the first few years. However, his Mother (61F) asked me last week for the ring he gave me back...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 163,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 164
        },
        "total_judged": 164,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-16T05:15:56.934819"
    },
    {
        "id": "1pneyqn",
        "title": "AITA for not making my cookie table allergin free",
        "url": "/r/AmItheAsshole/comments/1pneyqn/aita_for_not_making_my_cookie_table_allergin_free/",
        "body_summary": "I am hosting the family for Christmas Eve and I have always done a cookie table instead of a dessert. Overall I love to bake and there are usually around 15 different types of cookies.\n\n\n\nMy son recently got married and I have a two step grandkids now. They are 8 and 10.  They are allergic to peanuts, if it gets on their skin they fine but if they eat it they get a bad rash and swell up.\n\n\n\nThey don’t really listen to anyone  and it has caused issue before. My plan for this year was to keep the cookies with peanut butter on one table and the other cookies on another. Evertthign was going to be labeled also. I wasn’t going to cook them at the same time either to avoid cross contamination. \n\n\n\nI told my son the plan and he didn’t have an issue with it, he said he would talk to the kids. My d...",
        "reddit_judgments": {
            "YTA": 29,
            "NTA": 97,
            "ESH": 9,
            "NAH": 6,
            "INFO": 4,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-16T05:16:19.451261"
    },
    {
        "id": "1pn92k3",
        "title": "AITA for refusing to give my daughter up while homeless?",
        "url": "/r/AmItheAsshole/comments/1pn92k3/aita_for_refusing_to_give_my_daughter_up_while/",
        "body_summary": "[UPDATE]: I started a Gofund me if anyone is interested. I don't really know what I'm doing as I've never done this before, but if you'd like to donate, this is a safe way for you to do it. Thank you to everyone for all the great advice and for letting me know I wasn't TA. I will update again if anything happens, but for now, I'm just trying to make sure everyone is aware of the situation,  including the school and the pastor of the church. \n\nhttps://gofund.me/719731ff7\n\nI (27F) became homeless after my fiance was arrested and the family member I was living with died. We've been living in hotels and occasionally in a car since then, although I try to avoid that at all costs. \n\nI have a job and have been applying for low income apartments. I've done everything I can to keep my kids fed, wit...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 75,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-16T05:16:35.558929"
    },
    {
        "id": "1pnmxuy",
        "title": "AITA for refusing to attend my friend’s bachelor trip after finding out I was only invited to split costs?",
        "url": "/r/AmItheAsshole/comments/1pnmxuy/aita_for_refusing_to_attend_my_friends_bachelor/",
        "body_summary": "I (32M) have been friends with “Mark” (33M) for over a decade. We are not inseparable, but we’ve been solid friends since college. When he got engaged, I was happy for him and congratulated him right away.\n\nA few months ago, Mark told me he was planning a bachelor trip with “the guys” and asked if I was in. I said yes and assumed it would be a typical weekend away. No details yet, just that it would be “a good time.”\n\nRecently, the group chat got active with actual plans. That’s when things started to feel off. Everyone else in the group had clearly already discussed the itinerary in a separate chat. The location, activities, and even room assignments were already decided before I was added.\n\nThen the costs were posted. I noticed I was being asked to split the total evenly, including activ...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 102,
            "ESH": 2,
            "NAH": 7,
            "INFO": 1,
            "TotalJudged": 118
        },
        "total_judged": 118,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-16T05:16:51.976250"
    },
    {
        "id": "1pn4tru",
        "title": "AITA for not wanting to take care of my granddaughter for free?",
        "url": "/r/AmItheAsshole/comments/1pn4tru/aita_for_not_wanting_to_take_care_of_my/",
        "body_summary": "I'm an older woman and my hobby is learning languages so I'm sorry if I make a mistake in something, I'm a beginner. 😮‍💨\n\nMy daughter decided to get married a year after finishing high school. My husband and I didn't understand that decision but she was totally convinced and so was her husband. \n\nMy daughter became a housewife (By her own decision) and got pregnant soon after, since her husband works she spent a lot of the pregnancy at my house which did not seem a problem to me. Then my granddaughter was born and she kept coming often, which didn't seem like a problem to me either.\n\nBut then she started leaving me her baby longer and getting upset when I told her I can't take care of her. I understand that being a mother is difficult, I raised four children, but that does not mean that ev...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 143,
            "ESH": 2,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 151
        },
        "total_judged": 151,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-16T05:17:08.613542"
    },
    {
        "id": "1pnpiv8",
        "title": "AITA for telling a friend she had an STI when she asked?",
        "url": "/r/AmItheAsshole/comments/1pnpiv8/aita_for_telling_a_friend_she_had_an_sti_when_she/",
        "body_summary": "Over the past year or so I've gotten friendly with my barber and we started hanging out outside of my haircuts. A few months ago we went out for dinner/drinks and because I am a (female) physician she asked me to weigh in on what she might have been diagnosed with at an urgent care some years ago. She described a period of pelvic pain, was told at the urgent care that she had a \"pelvic infection,\" and was subsequently treated with a \"shot in the butt.\"\n\nPelvic infection in a woman in her 20s who is sexually active treated with a single intramuscular injection of an antibiotic is slam dunk an STI–it's like she was writing a med school test question honestly. So I told her I thought she likely had pelvic inflammatory disease from an STI like gonorrhea, chlamydia, or syphilis.\n\nShe was slight...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 54,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 64
        },
        "total_judged": 64,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-16T05:17:24.981311"
    },
    {
        "id": "1pn1eqp",
        "title": "AITA For Lying To My Late Fiancé Mom About Dating Again",
        "url": "/r/AmItheAsshole/comments/1pn1eqp/aita_for_lying_to_my_late_fiancé_mom_about_dating/",
        "body_summary": "So back in 2021 my fiancé passed away very unexpectedly. We had been together for almost 3 years and our relationship was toxic to say the least. When we were good we were great, but when we would fight it was terrible… I did love him though that’s why I stayed, anyways so after he passed his mom who never really liked me no matter how much I kissed her ass would one minute like me and lean on me. Unfortunately then the next she’d send me long messages accusing me of all sorts of stuff and kinda threatening me. This went on for about a year maybe over after his passing. She eventually stopped. One thing she kept accusing me of was dating/already seeing new people BECAUSE my fiancé best friend and me would text about how we missed him and reminisce on old times together! I was 21 at the tim...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 39,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-16T05:17:40.751332"
    },
    {
        "id": "1pnd1l4",
        "title": "AITA: Years later and stuff is now wanted back. Need outsiders opinions.",
        "url": "/r/AmItheAsshole/comments/1pnd1l4/aita_years_later_and_stuff_is_now_wanted_back/",
        "body_summary": "Hi, so my husband and I need your opinions since he wants to go the petty route and I am a non conflict person.\n\nTo start this off 5+ years ago my friend and I used to be really close, and she gave me a few things that she no longer wanted and she would probably throw away. At the time I was like yeah I’ll take it, even though I knew I wouldn’t use half the stuff. (Slight hoarder tendencies). She asked awhile back for a necklace she had given me and I couldn’t remember where it was and still don’t know. But I looked and told her I didn’t know where it was.\n\nAny ways Over the years I had moved. Stuff was placed in storage. I’m not entirely sure I have half the things she’s asking about. Like I said it’s been over five years and I have bad memory.\n\nSo this morning I get a message and she lis...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 100,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 103
        },
        "total_judged": 103,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-16T05:17:56.789475"
    }
]