[
    {
        "id": "1r2uv29",
        "title": "WIBTA for suing my friend when she didn’t come to my wedding?",
        "url": "/r/AmItheAsshole/comments/1r2uv29/wibta_for_suing_my_friend_when_she_didnt_come_to/",
        "body_summary": "I (25F) recently got married to my (25M) husband in Bali, Indonesia in January. It was a destination wedding, but my  parents and his parents paid for their own plane tickets and hotel, but we paid for our friends plane tickets and hotel stays. Each plane ticket was about $2000 USD and hotel was maybe about $150-300 for a week. My friend “Gemma” brought along her newly wed husband “John” along but paid for his plane ticket. The problem is that Gemma and John did not show up to my wedding. Gemma took the free plane ticket to Bali and the hotel room and when I asked her why she didn’t show up she said that since they couldn’t afford their own honeymoon that this was a perfect opportunity and that Jim decided that he didn’t feel like going. I was really hurt by this since Gemma and I have bee...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 91,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 95
        },
        "total_judged": 95,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-13T05:53:03.911746"
    },
    {
        "id": "1r2wldq",
        "title": "AITA for only talking to my DIL in a group chat that my son is a part of",
        "url": "/r/AmItheAsshole/comments/1r2wldq/aita_for_only_talking_to_my_dil_in_a_group_chat/",
        "body_summary": "edit: I have sent screenshots befor, he claims they are not on her phone so I am making it up.… I think she just deleted them or soemthing   \n\n\nI will call my DIL, Ashley.  Ashley is horrible at responding to text and invites. It is very frustrating and it has caused many many issues\n\nI don’t know if she is just forgetting to respond or just doenst care overall. The main issue is I will text her to invite her somewhere and then she doesn’t respond. We go do the event and then I get shit for not inviting her. I do invite her she just doesn’t respond. \n\nAt the beginning I thought I had the wrong number but that is not the case.  The big issue happened at Christmas. The girls in the family were all invited to go a ski resort. It was a single night trip. She was in the group chat and I persona...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 122,
            "ESH": 2,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 129
        },
        "total_judged": 129,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-13T05:53:13.303051"
    },
    {
        "id": "1r38vcc",
        "title": "AITA for refusing to let a woman \"cut\" me in line at the grocery store even though she only had two items?",
        "url": "/r/AmItheAsshole/comments/1r38vcc/aita_for_refusing_to_let_a_woman_cut_me_in_line/",
        "body_summary": "The grocery store was packed today and only two registers were open. I had a full cart and had been waiting in line for about 15 minutes.\n\nJust as I reached the conveyor belt, a woman approached me holding only a carton of eggs and milk. She asked if she could jump ahead of me because she was \"in a huge rush\" and only had two items.\n\nI was exhausted and my back was hurting, so I said, \"Sorry, but I’ve been waiting here for 15 minutes and I just want to get home.\"\n\nShe got offended and started complaining loudly to the people behind me about how \"some people are just miserable\" and that it would have only taken her 30 seconds. To my surprise, the guy behind me actually agreed with her and called me a jerk for not being \"neighborly.\"\n\nI feel like the point of a line is to wait your turn, reg...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 138,
            "ESH": 0,
            "NAH": 4,
            "INFO": 3,
            "TotalJudged": 151
        },
        "total_judged": 151,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-13T05:53:25.410081"
    },
    {
        "id": "1r2x2gb",
        "title": "AITA for calling out my brother-in-law after he scrutinised a high chair we returned?",
        "url": "/r/AmItheAsshole/comments/1r2x2gb/aita_for_calling_out_my_brotherinlaw_after_he/",
        "body_summary": "A few years ago, my brother-in-law showed up at our house with a used high chair his son was finished with. It wasn’t described as a loan. He just gave it to us. Our daughter is now almost 3 and has used it daily since she was about 5 months old.\n\nHe’s now expecting another baby and asked for the high chair back. Our daughter still uses a high chair, but we agreed to return it.\n\nAs it had been used daily for over two years, I didn’t want to hand it back without making sure it was in good condition. At one point I mentioned buying a new replacement to avoid awkwardness, and he immediately told us which shop had it on sale. He later referenced again that buying new would have made sense given the daily use.\n\nI decided to try thoroughly cleaned the original chair before committing to buying a...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 30,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-13T05:53:33.312883"
    },
    {
        "id": "1r2wqhm",
        "title": "AITA for asking HR to send a generalized email to the whole building asking people to be mindful of perfume / aerosol spray use?",
        "url": "/r/AmItheAsshole/comments/1r2wqhm/aita_for_asking_hr_to_send_a_generalized_email_to/",
        "body_summary": "Recently two women moved into the two open cubicles in front of my desk at work. They seem polite but we’re not in the same department so I haven’t talked to them very much (everyone’s busy all day not a lot of opportunities for chatting outside of your team, etc.) Lately when they come in now though they’ve been absolutely COVERED in perfume. For weeks it’s been giving me a migraine all day but I didn’t want to cause an issue / potentially offend / embarrass anyone so I haven’t said anything. Unfortunately last week they both turned it up several notches and have been spraying perfumes and hairsprays while at their desks. My migraines got a lot worse and I actually had a reaction and couldn’t breathe for a few hours and needed my inhaler. I didn’t say anything to my coworkers but I quietl...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 94,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-13T05:53:41.915346"
    },
    {
        "id": "1r39bx9",
        "title": "AITA for lying about stealing my passport?",
        "url": "/r/AmItheAsshole/comments/1r39bx9/aita_for_lying_about_stealing_my_passport/",
        "body_summary": "I (22F) have a very strict dad (44M), that has a very strong aversion to women travelling alone. Because of this he’s always kept my passport but one day I decided I had enough and sneakily stole his keys to open up his safe where he has lots of different important documents. I took my passport and closed the safe again as if nobody was there. Fast forward he calls me today to calmly ask me about whether I took my passport, I played dumb and said no-he kept pressing about but since I’ve already lied I decided to dig my grave. He doesn’t believe me and stressed that he needed to know if I took it so he won’t need to worry about other possibilites. I still lied and said no and he told me that what I’ve done with my passport is between me and god (yeah he’s religious) and that all my lies wil...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 116,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-13T05:53:50.607786"
    },
    {
        "id": "1r2s6sx",
        "title": "AITA for not wanting my partner to go fishing when I get out of hospital",
        "url": "/r/AmItheAsshole/comments/1r2s6sx/aita_for_not_wanting_my_partner_to_go_fishing/",
        "body_summary": "I (26F) have just had my 4th baby 5weeks ago. I became severely unwell with mastitis and became septic and ended up in hospital on IV fluids and antibiotics for 48hrs. My partner (26m) asked if he could go fishing when I get home, the 48hrs would be up in the evening and he would go when I got home. He said he would take the 3 older kids and I would just have the baby at home. I’ve been away from my partner and 3 kids for days and have missed them and still do not feel 100%. He said he’s worked hard all week and needs some downtime, time to do something he enjoys. It’s also our daughter’s birthday party the next day that I have to organise. So AITA for not wanting him to go fishing, and instead help me and spend time with me after being in hospital for 3 days? ",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 86,
            "ESH": 1,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 92
        },
        "total_judged": 92,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-13T05:53:51.837411"
    },
    {
        "id": "1r2zi2x",
        "title": "AITA For telling him no",
        "url": "/r/AmItheAsshole/comments/1r2zi2x/aita_for_telling_him_no/",
        "body_summary": "Hi, I a 25F, I work in a pharmacy where we also do deliveries of medication to patient households. One of the guys I was tasked to deliver to on a weekly bases happened to be a guy I dated once, and I never followed through with a second date because the man made advances toward me which I wasn’t willing to do on a first date.  I tried to just focus on my job for the first while during deliveries, but he kept pushing me on my deliveries to him. I told my boss I’m no longer comfortable going alone to this man’s house and he’s pushing me to continue with another delivery to this man today. I don’t know how to respond because I already made it abundantly clear I’m not comfortable with this. If I reaffirm that I’m not doing the delivery, am I at fault here?\n\nEdit: my boss has the option to sen...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 22,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-13T05:53:59.474113"
    },
    {
        "id": "1r2y6xy",
        "title": "AITA for refusing to wake up early to drive my friend to her classes?",
        "url": "/r/AmItheAsshole/comments/1r2y6xy/aita_for_refusing_to_wake_up_early_to_drive_my/",
        "body_summary": "I (21M) have a friend (21F) whose car recently broke down and is in the shop for a couple of weeks. We live about 15 minutes apart, and I’m currently the only one in our friend group with a car.\n\nShe asked if I could drive her to her 8 AM classes every weekday until she gets her car back. The issue is that my classes don’t start until 11 AM. If I agree, I’d have to wake up around 6:30, get ready, drive to her place, drop her off, and then either drive back home or sit around campus for a few hours waiting for my own classes.\n\nI told her I could help sometimes, but not every day, because it completely throws off my sleep schedule and routine. She didn’t take it well and said that if the roles were reversed, she would do it for me. A couple of our mutual friends are also saying it’s not that...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 59,
            "ESH": 0,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-13T05:54:07.373077"
    },
    {
        "id": "1r34g8p",
        "title": "WIBTAH for asking my sisters boyfriend for my car back after he’s been using it to get to work for about four months?",
        "url": "/r/AmItheAsshole/comments/1r34g8p/wibtah_for_asking_my_sisters_boyfriend_for_my_car/",
        "body_summary": "   So I(18F) have a twin sister. We are both not living at home, and we live about 35 minutes apart in different cities. My sister, I will call her Mandy, is living with her boyfriend(18M). \n\n   Before me and Mandy graduated we bought a car from our Nana that we share, but I think it’s important to know the car is in my name on the insurance and ownership. Our agreement was working fine until we both left for college & university. Since I was living closer to my college, I agreed that she could keep the car at her house. \n\n   The problem arose when I dropped out of college after the first semester. Mandy takes the bus every single day to university. Her boyfriend, I will call him Ben, works an hour and a half from his work. Me and Ben haven’t always gotten along due to past arguments, but ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 31,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-13T05:54:15.137245"
    }
]