[
    {
        "id": "1npbdm6",
        "title": "AITA for telling the bride that her armpits smell on her wedding day since I was the maid-of-honor ?",
        "url": "/r/AmItheAsshole/comments/1npbdm6/aita_for_telling_the_bride_that_her_armpits_smell/",
        "body_summary": "I (27f) have a bestfriend (27f) who got married recently. It was an outdoors wedding in the middle of the day on the westcoast. During the reception portion, she was sweaty and her armpits smelled. I discreetly tell her, since that's what we usually do for each other. Before she married her husband (28m), she had got mad at him one time because he didn't warn her that she smelled when they went to a fancy event.\n\nShe excused herself. I had smelled my own pits so I excused myself as well to freshen up. When I returned she was back, and she smelled great again. I thought I did good. When she got back from her honeymoon, she told me I made her self-conscious for the rest of the wedding. She said I made her feel bad, and she said she's mad at me for ruining her big day. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 146,
            "ESH": 0,
            "NAH": 4,
            "INFO": 3,
            "TotalJudged": 155
        },
        "total_judged": 155,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-25T05:11:24.122613"
    },
    {
        "id": "1np7evy",
        "title": "AITA for leaving to stay at a friend’s after my parents grounded me at 21, while my younger brother does whatever he wants?",
        "url": "/r/AmItheAsshole/comments/1np7evy/aita_for_leaving_to_stay_at_a_friends_after_my/",
        "body_summary": "OP (21F) feels unfairly controlled by her parents compared to her brother. She sneaked out to a party, returned late, and was grounded. OP argued about the double standard, left to stay with a friend, and now her parents demand an apology. AITA for leaving?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 99,
            "ESH": 5,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 109
        },
        "total_judged": 109,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-25T05:11:26.477887"
    },
    {
        "id": "1npby0r",
        "title": "AITA for calling a thief a thief?",
        "url": "/r/AmItheAsshole/comments/1npby0r/aita_for_calling_a_thief_a_thief/",
        "body_summary": "OP, 28M, joked about thief-themed decorations for his wife's brother's welcome-home party after his prison release for robbery. Wife, 27F, got angry & silent, denying he's a thief. OP insists brother is indeed a thief. AITA?\n...",
        "reddit_judgments": {
            "YTA": 76,
            "NTA": 55,
            "ESH": 8,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-09-25T05:11:28.609411"
    },
    {
        "id": "1npgdqo",
        "title": "AITA | Bonus day off work ≠ contributing nothing at home?",
        "url": "/r/AmItheAsshole/comments/1npgdqo/aita_bonus_day_off_work_contributing_nothing_at/",
        "body_summary": "OP's husband takes random sick days to game. OP, working from home, wants him to help with chores/dinner during the last hour of his \"day off\" instead of relaxing. Husband refuses, saying he wants a true chill day. AITA for wanting him to help?\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 110,
            "ESH": 9,
            "NAH": 12,
            "INFO": 14,
            "TotalJudged": 154
        },
        "total_judged": 154,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-25T05:11:32.641608"
    },
    {
        "id": "1npmfcy",
        "title": "AITA for missing my girlfriend's minor surgery for an important business trip?",
        "url": "/r/AmItheAsshole/comments/1npmfcy/aita_for_missing_my_girlfriends_minor_surgery_for/",
        "body_summary": "GF broke her arm biking drunk. OP rescheduled a vital business trip for her surgery, but it's moved *to* the trip date. GF wants OP to stay; OP wants to go, citing work importance & GF's preventable injury. AITA for prioritizing work over GF's surgery, given the circumstances?\n...",
        "reddit_judgments": {
            "YTA": 34,
            "NTA": 73,
            "ESH": 11,
            "NAH": 13,
            "INFO": 14,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-25T05:11:36.684568"
    },
    {
        "id": "1npkl6s",
        "title": "AITA for refusing to swap my piano lesson time with another girl?",
        "url": "/r/AmItheAsshole/comments/1npkl6s/aita_for_refusing_to_swap_my_piano_lesson_time/",
        "body_summary": "OP (18M) refuses to switch his long-standing piano lesson time with Emma (17F) because it's more convenient for him. Emma's mother pressured OP to switch, involving the teacher. OP refuses and asks AITA.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 26,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-25T05:11:37.822284"
    },
    {
        "id": "1nppqa4",
        "title": "AITA for wanting to be a princess too?",
        "url": "/r/AmItheAsshole/comments/1nppqa4/aita_for_wanting_to_be_a_princess_too/",
        "body_summary": "OP (18F) wants to wear a princess costume to a Renaissance fair. Her friend, part of a couple also dressing as a princess and knight, objects, saying it will confuse people. OP offered alternatives, but wants to wear a dress. AITA if she wears a princess costume anyway?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 76,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 77
        },
        "total_judged": 77,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-25T05:11:39.407138"
    },
    {
        "id": "1np9gwy",
        "title": "AITA for not letting my brother in law to use my truck",
        "url": "/r/AmItheAsshole/comments/1np9gwy/aita_for_not_letting_my_brother_in_law_to_use_my/",
        "body_summary": "I (42M) have a brother in law who is getting married and has his Stag and Doe this weekend, through the whole process he has discussed details about the event with my wife but never with me even tho apparently I'm to do things at the event which has all been told to me by my wife. Now yesterday when I came home I over heard them talking about using my truck to move things to and from the event, when I brought this up to my wife she said that she told her brother it was ok which I said no it's not cause they didn't come and ask me and that it's rude to assume id be ok with that.This lead to a huge fight where I was told I'm an asshole and not to come to the event if I'm not willing to help, so am I the asshole",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 47,
            "ESH": 2,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-25T05:11:39.816032"
    },
    {
        "id": "1npetj1",
        "title": "AITA for not inviting my old best friend to my wedding?",
        "url": "/r/AmItheAsshole/comments/1npetj1/aita_for_not_inviting_my_old_best_friend_to_my/",
        "body_summary": "OP isn't inviting former friend Patrick to her wedding due to his past cheating. Mutual friends noticed and questioned it, suggesting inviting him to avoid looking bitter. OP doesn't want cheaters present, but worries about appearances. AITA for excluding Patrick?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 55,
            "ESH": 1,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-25T05:11:41.446782"
    },
    {
        "id": "1npfjw1",
        "title": "AITA For not wanting my GF's friend stay with us any longer?",
        "url": "/r/AmItheAsshole/comments/1npfjw1/aita_for_not_wanting_my_gfs_friend_stay_with_us/",
        "body_summary": "OP's GF's friend needed housing, so OP reluctantly agreed she could stay in their one-bedroom apt. A month later, the friend is still there, jobless, and pays no rent. OP is frustrated, feels excluded, and wants her out, but GF is against it. AITA for wanting her gone?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 29,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 35
        },
        "total_judged": 35,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-25T05:11:42.758032"
    }
]