[
    {
        "id": "1po9ewn",
        "title": "AITA for refusing to do free work for my kids' stepfather?",
        "url": "/r/AmItheAsshole/comments/1po9ewn/aita_for_refusing_to_do_free_work_for_my_kids/",
        "body_summary": "I’m an electrician and a union member. \nMy ex and I share custody of our three kids. Things are ok now, but the divorce last year was rough. She got remarried in August to a guy after dating for six months let’s call him “Brad\"\n\nHere where the issue kinda starts; a few weeks ago Brad was at my daughter’s volleyball game saying stuff about how “Real tradesmen don’t need to be in a union.” He said this right in front of me, and I was wearing a shirt with my union logo on it, he works in the trades also but just does small non union IT/ data network jobs. I stayed calm and didn’t bite. He is self employed and I know barely makes a profit. My license also allows me to do all of his kind of work at my pay rate.\n\nThis morning, my ex called me out of the blue. She said a panel at one of Brad's jo...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 141,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 141
        },
        "total_judged": 141,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-17T05:14:36.218650"
    },
    {
        "id": "1pnvle3",
        "title": "AITA for telling my wife that the birthday gift she gave me wasn’t actually meant for me?",
        "url": "/r/AmItheAsshole/comments/1pnvle3/aita_for_telling_my_wife_that_the_birthday_gift/",
        "body_summary": "We're a couple in our mid 30s. A typical middle class household in UK, committed to a frugal lifestyle since beginning.\n\nSpending wholeheartedly on food (reasonably priced ones) and travel once a year. No kids, our ultimate goal is early retirement. We gift each other on birthdays from our separate bank accounts. Till now, the gifts have always been meant for the receiver, as it should be.\n\nGenerally, we're against luxury products but my wife has been wishing for a Dyson hair dryer since around 3 months. Two months ago, she hesitantly told me about it for the first time. I was mildly against it. I didn't say \"no\" but advised her to wait and think 7-15 days before making the purchase. Whenever we have the urge of buying something unnecessary, we just wait 7-15 days and the wish is gone! It ...",
        "reddit_judgments": {
            "YTA": 27,
            "NTA": 71,
            "ESH": 21,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 125
        },
        "total_judged": 125,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-17T05:14:56.084117"
    },
    {
        "id": "1po65nh",
        "title": "AITA for saying my cousin's intellectual disability is probably because of the incest",
        "url": "/r/AmItheAsshole/comments/1po65nh/aita_for_saying_my_cousins_intellectual/",
        "body_summary": "Throw away account cause im mortified. \n\nMy(21F) parents had a get together lunch among close family members last sunday. Me and my cousins were adding wedding dates from the piling invites to the calenders to make sure we don't miss any. \n\nI was joking about never understanding the familial ties in our native language (as in how you call cousins, or aunts or just the word in our language) as I was used to learning those words in English. My grandma, through my mother, was joking about how I am being too western and was helping me connect how I was related to the people in the invites.\n\nFour invites in, me on a roll with being too loose mouthed from all the food I was eating asked my dad how the father of the bride in the invite was related to him. He said cousin, and I should have stopped...",
        "reddit_judgments": {
            "YTA": 57,
            "NTA": 55,
            "ESH": 5,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 120
        },
        "total_judged": 120,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-17T05:15:14.450088"
    },
    {
        "id": "1pocuki",
        "title": "AITA for getting my niece to move in with me, then charging her rent",
        "url": "/r/AmItheAsshole/comments/1pocuki/aita_for_getting_my_niece_to_move_in_with_me_then/",
        "body_summary": "A few months ago my niece, Charlotte (20) called me saying she was kicked out after an argument with her mom. She was saying that she was already paying $500 per month and they were asking her to pay another $300, while not charging her siblings anything. I called her parents to get their side of the story. My brother immediately said to send her back because his wife didn’t mean it when she told Charlotte to get out. After a while he did confirm what Charlotte said about having to pay but tried to justify it by saying she could afford it because she was working and that their car insurance went up because she was in a car accident (so minor that there was no damage to her car and you had to zoom in to see the scratch on the other car), ignoring the fact that all of their kids had been in ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 40,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-17T05:15:30.088410"
    },
    {
        "id": "1po34zb",
        "title": "AITA for refusing to comply with my friend's NYE tradition",
        "url": "/r/AmItheAsshole/comments/1po34zb/aita_for_refusing_to_comply_with_my_friends_nye/",
        "body_summary": "My (23F) best friend has a friend group from high school. Most of them live abroad and only come back a few times a year. I(24F) like them a lot. They, as a group, have only one issue - they tend to be unreliable with plans (back out last minute, often disregard scheduling responsibilities). They have a tradition of celebrating New year's eve together every year. Last year my friend hosted it,since the group failed to book a spot, and she was very upset that it was just me and her doing all the work of hosting, cooking, and cleaning. \n\nThis year, after a plethora of plans fell through & my friend said she was sick of trying to schedule everything, I offered that the two of us, together with my mom, go to a small villa in the mountains (booked via my mom's job so it's a bit of an ordeal).Th...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 28,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-17T05:15:46.179566"
    },
    {
        "id": "1poc9ry",
        "title": "AITA for refusing to contribute to a farewell gift for a coworker who constantly minimized our team's work?",
        "url": "/r/AmItheAsshole/comments/1poc9ry/aita_for_refusing_to_contribute_to_a_farewell/",
        "body_summary": "I (31F) am a senior manager on a small, five person product development team. Our coworker, Brenda (55F), is retiring next week after 20 years at the company. Brenda is technically competent, but she has a notoriously negative attitude toward our team's administrative workload. Throughout her entire tenure, she treated essential tasks like documentation, data entry, and procedural compliance as beneath her, calling them grunt work and often openly mocking them. Consequently, the remaining four of us had to absorb 100% of these critical but less glamorous responsibilities. This imbalance meant the rest of us routinely worked late and weekends just to keep up with the mundane tasks Brenda shirked. Our boss knows this happens but has always been hesitant to discipline Brenda due to her long s...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 102,
            "ESH": 2,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 111
        },
        "total_judged": 111,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-17T05:16:02.403521"
    },
    {
        "id": "1pobh0x",
        "title": "AITA for not allowing a coworker to come in and use my bathroom",
        "url": "/r/AmItheAsshole/comments/1pobh0x/aita_for_not_allowing_a_coworker_to_come_in_and/",
        "body_summary": "I was giving a coworker some furniture and a few people from work can to pick it up. I put everything out it the driveway prior to them getting there and helped them load it up.\n\nOne of my coworkers asked the use my bathroom and I said “no”.\n\nThat specific coworker is especially judgmental and talks about everyone. My house is somewhat of a fixer and there are things that I want to change that I do not like about the house. I did not feel comfortable with her going in my house in fear of what she may say behind my back to anyone who would listen. AITA",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 21,
            "ESH": 4,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-17T05:16:02.833584"
    },
    {
        "id": "1podetr",
        "title": "AITA for buying my nephew piano lessons for his birthday?",
        "url": "/r/AmItheAsshole/comments/1podetr/aita_for_buying_my_nephew_piano_lessons_for_his/",
        "body_summary": "I recently decided that I wanted to shift in buying experience presents instead of material gifts as kids have so many toys it seems.\n\nOver the last couple years, every time my nephew (6 years old) is at my house he always wants to play on my piano or requests that I play for him. \n\nI thought it might be nice for his birthday to buy him piano lessons for the year at our local conservatory. I asked his parents if they were ok with this and I offered to drive him to and from lessons as well as gave my extra keyboard for him to practice on. I made it clear to his parents that I didn’t care if he wasn’t interested past the year, but if he wanted to continue that I would continue to pay the tuition. It was more to provide that opportunity to him, he is the perfect age to start, and he genuinely...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 111,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 117
        },
        "total_judged": 117,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-17T05:16:19.660703"
    },
    {
        "id": "1poj0mp",
        "title": "AITA for keeping a jar of peanut butter specifically for setting mouse traps?",
        "url": "/r/AmItheAsshole/comments/1poj0mp/aita_for_keeping_a_jar_of_peanut_butter/",
        "body_summary": "I live in an old house and it’s filled with mice in the winter. Every winter I have an intricate set up of mouse traps stashed throughout the house that I maintain. I check them at least twice daily and empty and reload them as needed. I use peanut butter as bait. The mice LOVE it.\n\nI have 6 traps hidden in the mouse hot spots. When I catch a mouse, I throw away the dead mouse and reload the trap with peanut butter. We used to have just one jar of peanut butter that my husband used for sandwiches. So if I had to fill 3 traps, I would use three different butter knives to fill them. I would take a clean knife, put peanut butter on it, put it on the trap, toss the knife in the sink. Then repeat with a new clean butter knife.\n\nBut one day I found a jar of PB in the pantry that he hasn’t used m...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 110,
            "ESH": 2,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 119
        },
        "total_judged": 119,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-17T05:16:36.254914"
    },
    {
        "id": "1po57b4",
        "title": "AITA for having an afro at The Nutcracker",
        "url": "/r/AmItheAsshole/comments/1po57b4/aita_for_having_an_afro_at_the_nutcracker/",
        "body_summary": "On mobile and first time posting to this sub! I will try and be as objective with my description as possible and please let me know aitbh?\n\nI went to a community production (tickets were 30 USD and most of the cast were kids) of The Nutcracker in my small town on Sunday midday. I have very kinky, curly, dense hair which is naturally and afro. It takes a minimum of an hour for me to braid, which I didn't have time to do prior to the production. I am 5'2\" and my afro is about 3\" (I just took a tape measure to it).\n\nI was a little concerned about the people behind as we arrived at the ballet, but my SO assured me that my hair was fine. We took our seats with a family of three behind us.\n\nWe were at the end of the row. There was a small child behind us in the aisle (the seating was staggered),...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 148,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 153
        },
        "total_judged": 153,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-17T05:16:52.478459"
    }
]