[
    {
        "id": "1ngph1r",
        "title": "AITA for leaving the kitchen in a “disrespectful state”?",
        "url": "/r/AmItheAsshole/comments/1ngph1r/aita_for_leaving_the_kitchen_in_a_disrespectful/",
        "body_summary": "OP cooked dinner while caring for their child. Husband did yardwork. He then complained about the messy kitchen and cleaned it without being asked. OP feels unappreciated and asks AITA for not cleaning sooner and husband cleaning unprompted.\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 61,
            "ESH": 0,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-15T05:11:46.597269"
    },
    {
        "id": "1ngpg5q",
        "title": "AITA Visiting Krakow, did not allow person with no fob to enter fob protected hotel behind me",
        "url": "/r/AmItheAsshole/comments/1ngpg5q/aita_visiting_krakow_did_not_allow_person_with_no/",
        "body_summary": "OP, a tourist in Poland, refused to let a woman into their hotel lobby (with unattended luggage) using their key fob. The woman asked for entry and tried to push the door. OP declined, citing security concerns. The woman swore, and OP refused further help. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 59,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-15T05:11:48.562336"
    },
    {
        "id": "1ngrshs",
        "title": "AITA for taking off my shorts to dry them under a hand dryer?",
        "url": "/r/AmItheAsshole/comments/1ngrshs/aita_for_taking_off_my_shorts_to_dry_them_under_a/",
        "body_summary": "OP (27m) spilled water, removed wet shorts (with underwear) in a public restroom to dry them. An older man told him to cover up. OP continued drying shorts briefly. AITA for drying shorts despite the man's disapproval?\n...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 111,
            "ESH": 1,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-15T05:11:52.388119"
    },
    {
        "id": "1nh33xh",
        "title": "AITA - Laughing out loud when my wife said the song Golden from Kpop Demonhunters was demonic",
        "url": "/r/AmItheAsshole/comments/1nh33xh/aita_laughing_out_loud_when_my_wife_said_the_song/",
        "body_summary": "So, my wife just got home from church and her church group and immediately said our kids should no longer be singing this song or watching Kpop Demonhunters saying someone in the group said it is demonic... I just laughed because that is outrageous. Wouldn't the song be more inline with Rumi facing her demons and seeing the light? Heck, if I wanted to turn it into belief, \"golden\" or the light could signify God. I'm still eyerolling as I type this... I'm not religious and I encourage my kids to make their own choice, but come on...\n\nNow she's upset and mad I laughed at her comment and said it was ridiculous.  AITA?",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 89,
            "ESH": 3,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 97
        },
        "total_judged": 97,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-15T05:11:54.037014"
    },
    {
        "id": "1ngqdto",
        "title": "AITA for holding a grudge that I was uninvited to my boyfriend's mother's funeral?",
        "url": "/r/AmItheAsshole/comments/1ngqdto/aita_for_holding_a_grudge_that_i_was_uninvited_to/",
        "body_summary": "OP(F35) wasn't invited to BF(M42)'s mum's funeral after years of him delaying her meeting her. He said it'd be too stressful & others agreed. OP feels excluded & devalued. AITA for feeling hurt instead of accepting his grief?\n...",
        "reddit_judgments": {
            "YTA": 27,
            "NTA": 49,
            "ESH": 3,
            "NAH": 16,
            "INFO": 2,
            "TotalJudged": 97
        },
        "total_judged": 97,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-15T05:11:56.872379"
    },
    {
        "id": "1ngtti7",
        "title": "AITA for getting my MIL a room but not my mom",
        "url": "/r/AmItheAsshole/comments/1ngtti7/aita_for_getting_my_mil_a_room_but_not_my_mom/",
        "body_summary": "OP arranged a trip for her family and MIL, assuming her mom couldn't attend. Mom changed her mind last minute, then complained about sleeping arrangements and perceived favoritism towards MIL. OP defends her actions, citing mom's initial unavailability and MIL's babysitting role. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 31,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-15T05:11:58.317576"
    },
    {
        "id": "1ngu389",
        "title": "AITA for calling my husband an F’n Ahole",
        "url": "/r/AmItheAsshole/comments/1ngu389/aita_for_calling_my_husband_an_fn_ahole/",
        "body_summary": "OP's husband kept interrupting her workout. She called him an \"f*cking a**hole\" for being mad she didn't respond immediately. He left, and OP asks if she was wrong for the name-calling.\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 61,
            "ESH": 35,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 110
        },
        "total_judged": 110,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-15T05:12:00.873312"
    },
    {
        "id": "1ngileq",
        "title": "AITA for kicking my friend out of my wedding?",
        "url": "/r/AmItheAsshole/comments/1ngileq/aita_for_kicking_my_friend_out_of_my_wedding/",
        "body_summary": "OP, Emily, kicked Lila out of her wedding after Lila complained about not being maid of honor, talked behind OP's back, and tried on OP's engagement ring, sending pictures to others. Lila claims she was \"just having fun.\" OP asks if kicking Lila out was justified.\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 34,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-15T05:12:02.094432"
    },
    {
        "id": "1ngqqig",
        "title": "AITA For not returning my sisters vital documents to our mother.",
        "url": "/r/AmItheAsshole/comments/1ngqqig/aita_for_not_returning_my_sisters_vital_documents/",
        "body_summary": "OP (26M) refuses to return sister's (17F) vital documents to their aunt (39F), who promised their mother (42F) to return them. Mother harasses aunt nightly for the documents. OP believes the sister needs them and mother is being petty. AITA for keeping them?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 50,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-15T05:12:03.533939"
    },
    {
        "id": "1nh6ric",
        "title": "WIBTA if I told my parents I don't want to take care of my sibling my whole life?",
        "url": "/r/AmItheAsshole/comments/1nh6ric/wibta_if_i_told_my_parents_i_dont_want_to_take/",
        "body_summary": "Honestly I wouldn't have a choice anyways but my brother has down syndrome and ever since he was born it was basically expected that I would take care of him forever. I love him I really do but I'm not sure if I'll be stable enough to take care of him. Or if Ill be able to take care of myself as well.  And I just wonder how that would affect my relationships in the future although I doubt I'll be interested in dating. I feel guilty whenever I see videos of people with their disabled siblings and taking care of them without complaints while here I'm complaining but my perspective on this will likely change in the future. ",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 45,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 46
        },
        "total_judged": 46,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-15T05:12:04.170262"
    }
]