[
    {
        "id": "1l9mrzk",
        "title": "AITA for ordering alcohol?",
        "url": "/r/AmItheAsshole/comments/1l9mrzk/aita_for_ordering_alcohol/",
        "body_summary": "OP, on a solo trip in Tenerife, was seated with a family who disapproved of her wine. They claimed she was underage, causing a waiter to check her wristband. As revenge, OP ordered a bottle of wine & shots. AITA for escalating the situation?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 133,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-13T05:11:42.197863"
    },
    {
        "id": "1l9l9dq",
        "title": "AITA for leaving dinner early after my boyfriend’s friend introduced me as “the current one”?",
        "url": "/r/AmItheAsshole/comments/1l9l9dq/aita_for_leaving_dinner_early_after_my_boyfriends/",
        "body_summary": "So my boyfriend (31M) invited me to dinner with his old college group. One of his female friends (30F), who I’ve never met before, came late, looked me up and down, then said, “Ohhh so *you’re* the current one. Cute.”\n\nI was stunned. No one laughed, no one corrected her. My boyfriend just kind of chuckled awkwardly and changed the subject. I sat there in silence for another 20 minutes before excusing myself and leaving. I took an Uber home.\n\nHe called me later and said I embarrassed him by “making it a thing” and that I should’ve just “been chill” because “she didn’t mean anything by it.” He wants me to apologize to her for walking out “like a child.”\n\nAITA for not tolerating that kind of blatant disrespect?",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 119,
            "ESH": 1,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-13T05:11:45.024503"
    },
    {
        "id": "1l9khrj",
        "title": "AITA- I (20m) went to sleep before my girl (23f) could make dinner",
        "url": "/r/AmItheAsshole/comments/1l9khrj/aita_i_20m_went_to_sleep_before_my_girl_23f_could/",
        "body_summary": "OP works long hours. His GF offered to make pizza at midnight. Knowing it'd take hours & cut into his short sleep, OP made a sandwich instead. GF is upset. AITA for prioritizing sleep?\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 69,
            "ESH": 3,
            "NAH": 5,
            "INFO": 6,
            "TotalJudged": 90
        },
        "total_judged": 90,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-13T05:11:48.117123"
    },
    {
        "id": "1l9wz6c",
        "title": "AITA for getting a belly piercing without discussing it with my boyfriend beforehand?",
        "url": "/r/AmItheAsshole/comments/1l9wz6c/aita_for_getting_a_belly_piercing_without/",
        "body_summary": "OP got a belly piercing on a girls trip without telling her boyfriend. He's upset she didn't consult him and accuses her of secrecy. OP thinks he's overreacting. AITA for not informing him beforehand?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 136,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 138
        },
        "total_judged": 138,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-13T05:11:55.371137"
    },
    {
        "id": "1l9fva1",
        "title": "AITA for not sharing my leftovers with my bf?",
        "url": "/r/AmItheAsshole/comments/1l9fva1/aita_for_not_sharing_my_leftovers_with_my_bf/",
        "body_summary": "OP doesn't share leftovers with her BF, who always finishes his food. He calls it selfish; she wants it for lunch. He wants a \"split leftovers\" rule for fancy meals. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 127,
            "ESH": 0,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 133
        },
        "total_judged": 133,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-13T05:12:01.243805"
    },
    {
        "id": "1l9t7zt",
        "title": "AITA for not letting my brother stay at my house",
        "url": "/r/AmItheAsshole/comments/1l9t7zt/aita_for_not_letting_my_brother_stay_at_my_house/",
        "body_summary": "I (38f) rent a house that is currently empty during the week. My brother (37m) and his wife are having issues (again) and asked if he could stay there while I was gone and leave before I got back. I told him I wasn't comfortable with that and now he and my parents are mad.\n\nBackstory:\n-I've let him stay there a number of times before while I was there to supervise him due to issues with alcohol and his wife\n-He has 2 daughters \n-My other brother and my parents live close by as well\n-I believe he wanted to stay at my house because it is empty and he would have to hear any advice/judgement from anyone and just be free to do what he wants\n-He drinks a LOT of caffeine and has been acting very erratic ",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 43,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-13T05:12:01.780530"
    },
    {
        "id": "1l9v084",
        "title": "AITAH for slamming the brakes on my parents as a new driver?",
        "url": "/r/AmItheAsshole/comments/1l9v084/aitah_for_slamming_the_brakes_on_my_parents_as_a/",
        "body_summary": "So i'm 19 and i just started practicing driving a few weeks ago. today i was with my parents driving us to my grandmothers, my dad was getting frustrated i kept braking too hard. my brain got too focused on him talking that i wasn't in full attention and accidentally ran a stop sign. my parents FREAKED OUT SCREAMING at me, there were no cars around at the sign nor when i hit the breaks. both were yelling at me and i panicked and couldn't handle it so i slammed to the brakes so my dad could drive. they thought i was just being an asshole pulling a stunt, but i was panicking.",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 63,
            "ESH": 23,
            "NAH": 9,
            "INFO": 2,
            "TotalJudged": 114
        },
        "total_judged": 114,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-13T05:12:04.002596"
    },
    {
        "id": "1l9ss6l",
        "title": "AITA for refusing to allow my wife to commute her brother to work every morning?",
        "url": "/r/AmItheAsshole/comments/1l9ss6l/aita_for_refusing_to_allow_my_wife_to_commute_her/",
        "body_summary": "BIL moved nearby, wife drives him to job apps. OP is concerned BIL's distant job prospects mean he'll expect daily rides from wife, impacting OP's car use. OP told wife BIL is on his own for commutes if he takes a distant job & suggested nearby jobs. Wife upset. AITA?\n...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 45,
            "ESH": 9,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-13T05:12:06.439455"
    },
    {
        "id": "1l9r5mn",
        "title": "AITA for taking my mom side over my husbands?",
        "url": "/r/AmItheAsshole/comments/1l9r5mn/aita_for_taking_my_mom_side_over_my_husbands/",
        "body_summary": "OP (22F) & husband (27M) fought over her mom co-signing a car loan. He's worried about her mom's financial stability (but mom is not paying for the car) & wants more transparency. OP thinks her mom's finances are private and defends her mom. Husband said hurtful things. AITA?\n...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 33,
            "ESH": 1,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-13T05:12:08.972922"
    },
    {
        "id": "1la0lx4",
        "title": "AITA for refusing to help my roommate move out after they broke our lease early?",
        "url": "/r/AmItheAsshole/comments/1la0lx4/aita_for_refusing_to_help_my_roommate_move_out/",
        "body_summary": "OP's roommate moved to a new city with only 2 weeks notice, leaving OP to cover the full lease. Roommate asked OP to help move, but OP refused. Roommate complained to mutual friends. AITA for not helping after being left with the lease?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 26,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-13T05:12:10.265740"
    }
]