[
    {
        "id": "1oujqm2",
        "title": "AITA for letting my step daughter’s mom stay in our guest suite and not my sister?",
        "url": "/r/AmItheAsshole/comments/1oujqm2/aita_for_letting_my_step_daughters_mom_stay_in/",
        "body_summary": "Carrie (15f) is my step daughter from my marriage to Sam (41m). We’ve been together for 8 years. Her mom (Ann) is still in the picture but is constantly traveling and only gets to stop in town for short bits of time. Because of this Sam and I think it’s important to let them have as much time together as they can. She has stayed with us in the past in our guest suite (it’s not as big as it sounds) and it’s always worked out ok. \n\nMy sister Rachel wants to come for Christmas, and I said it will be a tight fit but if she can take a couch or air mattress she can. She is upset and said she should have the guest suite. I said Ann will be here. The last time Carrie and Ann were able to spend Christmas together was when Carrie was 10. Of course Rachel is upset because she can’t do a hotel or anyt...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 141,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 142
        },
        "total_judged": 142,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-12T05:12:30.723789"
    },
    {
        "id": "1oubxj2",
        "title": "AITA for not allowing my ex-maid of honor be a bridesmaid?",
        "url": "/r/AmItheAsshole/comments/1oubxj2/aita_for_not_allowing_my_exmaid_of_honor_be_a/",
        "body_summary": "Quick Backstory: My fiancé (m33) and I (f29) are getting married in Sept 26’. Our friends [fake names] Stan (m34) and Zoe (f33) just got married May 25’. We asked Stan and Zoe to be our BM and MOH, they both said yes.\n\nIn June my MOH calls and says she cant be my MOH anymore due to some health issues. Also she has to avoid stress, and isn't sure if she'd be able to handle the wedding planning and her own medical bills.\n\nI tell her that if she still wants to be included or be a bridesmaid to keep me posted\n\nAug. 7th I ask my sister to be my new MOH.\n\nThe end of Aug. I check in with Zoe. She responds with “--the procedure went well I am still waiting on the official results, but the nurse said things looked good, so I am optimistic.”\n\nI heard nothing after that and got my last brides maid in...",
        "reddit_judgments": {
            "YTA": 94,
            "NTA": 21,
            "ESH": 10,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-12T05:12:47.946950"
    },
    {
        "id": "1oube2d",
        "title": "AITA for telling my dad’s girlfriend to leave when my friends are over?",
        "url": "/r/AmItheAsshole/comments/1oube2d/aita_for_telling_my_dads_girlfriend_to_leave_when/",
        "body_summary": "I (16M) live with my dad and his girlfriend (32F) and normally things are fine but whenever I have my friends over she’s always around trying to join in on everything we’re doing and it makes me feel like I can’t just hang out and be myself. The other day I had a few friends over and she came into the room joking and talking with us like she was one of my friends and I just told her maybe she should leave the house when my friends are over. She looked hurt and left and I felt bad immediately but at the same time I also feel like it’s my house too and I should be able to have some privacy with my friends. My dad told me I could have said it nicer and that I shouldn’t make her feel unwelcome but I’m just not sure if I was wrong for saying what I said.",
        "reddit_judgments": {
            "YTA": 81,
            "NTA": 29,
            "ESH": 18,
            "NAH": 3,
            "INFO": 9,
            "TotalJudged": 140
        },
        "total_judged": 140,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-12T05:12:51.592406"
    },
    {
        "id": "1ou4mub",
        "title": "AITA for not acting excited enough when opening my birthday gifts?",
        "url": "/r/AmItheAsshole/comments/1ou4mub/aita_for_not_acting_excited_enough_when_opening/",
        "body_summary": "Today was my (16F) birthday, and I get stressed out opening gifts in front of my family because I’m not able to perform the level of excitement they expect, and it’s a huge problem every year. They want me to jump up and down and cry, and my reactions are not extreme enough for them.\n\nMy mom especially will always film the birthday videos to post on Facebook, and she gets mad when everyone doesn’t sing happy birthday perfectly in sync, which causing screaming arguments with my dad.\n\nSo that happened, and my dad was angry that she kept making everyone re-sing it over and over again, causing the candles to melt all over the cake. Then he stormed off before I opened my presents.\n\nI opened the gift from my mom, which was a waxing kit for waxing your legs, but I don’t even shave my legs so I wa...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 73,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-12T05:13:07.925381"
    },
    {
        "id": "1ouj37c",
        "title": "AITA for not letting my fiance's family crash over at my house",
        "url": "/r/AmItheAsshole/comments/1ouj37c/aita_for_not_letting_my_fiances_family_crash_over/",
        "body_summary": "\n\nI (m27 ) have been with my fiance (f32) for 7 years . I am a resident in training but come from a financially comfortable background, my parents brought me a nice house like a year back. My fiance works in retail, comes from a Modest family and  had a very struggling childhood. I try my best to give her the best life possible but lately what's bothering me is the fact . \n\nThat the new house has extra bedrooms like 3 extra and since we have moved in somehow all her family members are having problems of somesort  or have troubles with their own places and she lets them stay in .\n\nI don't mind a overnight stay but they stay for weeks and her mother hasn't left in 4 months . Now I come home to her brother or sister chilling on the couch and watching TV or using my ps4 . Sometimes some aunt  ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 57,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-12T05:13:24.218613"
    },
    {
        "id": "1oumes2",
        "title": "AITA For not wanting to take my wife's ex's kids on a family vacation",
        "url": "/r/AmItheAsshole/comments/1oumes2/aita_for_not_wanting_to_take_my_wifes_exs_kids_on/",
        "body_summary": "Apologies in advance for the mess that this all is. My wife (43F) and I (45M) have been married for 8 years and have 2 kids (8 & 6).  My wife also has a 10-year-old daughter with her ex.  My wife and her ex were never married, but her ex also has 2 kids (12 & 13) that my wife was basically a stepmom to.  We live in a smallish town (9-10 thousand population) so all the kids go to the same school district and see each other regularly.  My wife obviously is still in contact with her ex regarding their daughter and we routinely get all the kids together, including ex's, for birthdays and stuff like that. \n\nMy wife and I have been wanting to take a family vacation for a couple years now but have waited until our youngest is a bit older. This would be our first family vacation. We decided to sta...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 98,
            "ESH": 3,
            "NAH": 8,
            "INFO": 3,
            "TotalJudged": 117
        },
        "total_judged": 117,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-12T05:13:41.877686"
    },
    {
        "id": "1oujwqc",
        "title": "AITA for testing how prepared my husband is for our baby?",
        "url": "/r/AmItheAsshole/comments/1oujwqc/aita_for_testing_how_prepared_my_husband_is_for/",
        "body_summary": "Hello, I am pregnant with my first child and I tend to go overboard with hypotheticals. I’ve been trying to curb that behavior as we are stressed enough without adding my irrational “what ifs” to the mix.\n\nOne worry that I have is leaving our baby in the back seat of the car, I may be a more anxious about it due to my co worker’s daughter nearly dying from being left in the car in the summer heat a few years ago. One of the first things I asked my husband was to check the back seat every time he gets out of the car just so we can make a habit of it. He understood why I was asking and agreed immediately.\n\nA month ago we were looking for a mobile we brought home from my mom's house. We tore the house apart for days looking it and figured we left it behind on accident. While using my husband’...",
        "reddit_judgments": {
            "YTA": 123,
            "NTA": 11,
            "ESH": 22,
            "NAH": 6,
            "INFO": 0,
            "TotalJudged": 162
        },
        "total_judged": 162,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-12T05:14:01.798080"
    },
    {
        "id": "1oucr3h",
        "title": "AITA for wanting my house and peace back after letting my MIL stay ‘temporarily’?",
        "url": "/r/AmItheAsshole/comments/1oucr3h/aita_for_wanting_my_house_and_peace_back_after/",
        "body_summary": "I honestly can’t tell if my feelings are completely valid or if it’s just the postpartum hormones, but I need to vent and get this off my chest.😩\nI had my baby on September 9th, and a few weeks before that, my husband’s mom’s lease was up. She didn’t have the money to renew it, so we told her she could stay with us temporarily. In my mind I figured she’d stay maybe a month just enough time to save up for a down payment on a new place.\nWell… two days after we told her she could move in, she “lost” her job. So instead of just being here occasionally, she’s been here 24/7 ever since. It took her over a month to finally get a new job, which she’s supposed to start Monday.\nIn the time she’s been here, she’s done the dishes maybe three times. She leaves her dishes in the sink for me, helps herse...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 47,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-12T05:14:17.735728"
    },
    {
        "id": "1ouel8p",
        "title": "AITA for moving into a house my bf owns if it means his disabled aunt has to move out?",
        "url": "/r/AmItheAsshole/comments/1ouel8p/aita_for_moving_into_a_house_my_bf_owns_if_it/",
        "body_summary": "I feel guilty about this so I would like so outside opinions, my (29f) bf (30m) owns a house in a nice neighborhood. It was recently put in his name by his grandma who has owned the house and before her her mother owned the house so it has been in the family a long time. His grandma lives in the same neighborhood on a different street. In the past the house was a started home for kids in the family to get on their feet and save up to buy a house of their own as the rent charged is just enough to pay property taxes, $200 each month. About 15 years ago, my bf’s aunt told her son he needed to move out so she could move in as she was struggling with arthritis. She has lived there ever since and currently has a bf with a good job who lives with her. When my bf and I came home from college we di...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 37,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-12T05:14:33.542497"
    },
    {
        "id": "1oue8fk",
        "title": "AITA for ignoring my friend's relationship problems?",
        "url": "/r/AmItheAsshole/comments/1oue8fk/aita_for_ignoring_my_friends_relationship_problems/",
        "body_summary": "(I won't specify ages for protection of both parties)\n\nI (M) have this friend (M) that I know for 4 months or more, and in august-september he started complaining about a \"friend\" (F) of his, that used to be too dramatic and wanted his attention all the time (which isn't something he usually does, he doesn't stay much on the phone). Life goes on, he stopped talking to her for a while\n\nin october, he told me that friend was actually his girlfriend, and that time he used to complain was because they just broke up and now were back together. I said I understood, principally after he said she was acting better now and all. I became friends with her too, and we started talking everyday\n\nafter some days, she started complaining a lot about her boyfriend to me (which in case, is the friend I ment...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 3,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 3
        },
        "total_judged": 3,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2025-11-12T05:14:49.022984"
    }
]