[
    {
        "id": "1qejq8z",
        "title": "AITA for not telling my family that I joined the military?",
        "url": "/r/AmItheAsshole/comments/1qejq8z/aita_for_not_telling_my_family_that_i_joined_the/",
        "body_summary": "Growing up I (18f) had to do everything with my twin sister Sophie. Well mostly do everything Sophie wanted. If things didn’t go her way she’d throw a huge fit until she got her way. Our whole lives we had to share a brightly colored bedroom. Once in 4th grade I got in trouble because I put a picture of a poorly drawn dragon on the wall because it was “to dark for Sophie” which I thought was ridiculous. Throughout elementary and middle school our mom dressed us up in the exact same or nearly identical clothes because she thought it was cute. In 5th grade our mom had us join ballet because it was something Sophie always wanted to do. When I would ask to join boxing my dad would yell at me for only thinking of myself. My mom would always say that boxing was too rough for Sophie. It got worse...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 133,
            "ESH": 0,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 140
        },
        "total_judged": 140,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-17T05:13:24.502191"
    },
    {
        "id": "1qelbpf",
        "title": "AITA for sleeping through most of a long luxury bus ride while my girlfriend was upset?",
        "url": "/r/AmItheAsshole/comments/1qelbpf/aita_for_sleeping_through_most_of_a_long_luxury/",
        "body_summary": "I’ve been traveling in Chile and had been sick for a couple of days before this. Vomiting, GI issues, and generally feeling awful.\n\nBecause of that, I barely slept for two nights beforehand. I kept waking up in our hotel bed to run to the bathroom, and my girlfriend knew this since she saw it happen.\n\nWe had a long travel day planned and ended up taking a 20-hour overnight bus instead of flying. The flights available were expensive, poorly timed, and uncomfortable. Many would have had us arriving around 2:30 a.m., and being stuck upright in a plane seat while sick sounded miserable compared to being able to lie flat and shift positions on a bus.\n\nI paid extra for a luxury overnight bus with fully reclining lay-down seats, blankets, and pillows so we could rest. On the day of travel, I was ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 108,
            "ESH": 5,
            "NAH": 4,
            "INFO": 3,
            "TotalJudged": 124
        },
        "total_judged": 124,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-17T05:13:41.198061"
    },
    {
        "id": "1qenz6n",
        "title": "AITA for keeping a collection of MTG cards that were wrongly gifted to me?",
        "url": "/r/AmItheAsshole/comments/1qenz6n/aita_for_keeping_a_collection_of_mtg_cards_that/",
        "body_summary": "Early december, a coworker asked me if I wanted Magic the Gathering cards her husband wanted to get rid off. I accepted and end up with 5 briefcases full of cards.\n\nGoing through the cards, I found that they were a lot (and I mean a lot) of cards ranging from anywhere between 15$ and 80$. I thought it was a little weird that her husband would just gifted away that many expensive cards, so I texted my coworker to ask if she was sure that her husband was giving everything to me. Her response was \"yes, he is sure. He doesn't play with them anymore. Enjoy\". So I kept the cards to built deck, trade some and sold a bunch of them at my local card shop for a couple hundread of bucks.\n\nFast foward to yesterday. Coworker came to me during lunch to ask if I can give her back all the cards. Turns out ...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 107,
            "ESH": 20,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 146
        },
        "total_judged": 146,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-17T05:13:59.636797"
    },
    {
        "id": "1qelcdp",
        "title": "AITA for buying the same presents for my wife and my mom from my work trip?",
        "url": "/r/AmItheAsshole/comments/1qelcdp/aita_for_buying_the_same_presents_for_my_wife_and/",
        "body_summary": "Hi, I thought I'd ask here because my wife and I aren't seeing eye to eye on this. I returned from Saudi Arabia on Wednesday where I was sent by my company for a business trip. It was a good trip, work went smooth, and I got to see Jeddah which was good (mild anxiety about what was happening in the Middle East aside).\n\nWhile there I bought some local stuff to bring home since this was the first time anyone in my immediate family I think had gone to the Middle East. I bought rugs, some decoration pieces, dates, and some local perfumes. My mom lives close to us, we have a good relationship with her. So when I was buying something I bought two of them, bought the same thing for my mom as I did for my wife. I thought this was a good idea, so both of them could get something from there.\n\nWhen I...",
        "reddit_judgments": {
            "YTA": 120,
            "NTA": 13,
            "ESH": 0,
            "NAH": 12,
            "INFO": 3,
            "TotalJudged": 148
        },
        "total_judged": 148,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-17T05:14:18.233474"
    },
    {
        "id": "1qem00y",
        "title": "AITA For not greeting my husband before telling him I need his help",
        "url": "/r/AmItheAsshole/comments/1qem00y/aita_for_not_greeting_my_husband_before_telling/",
        "body_summary": "Yesterday afternoon I (41F) got home from work after picking up my 6-year-old son from school and started to do some cleaning.  I had to get something from under the kitchen sink and I found that everything under there was wet.  I figured there must be a leak somewhere but I am not a plumber and have no idea how that stuff works.  I ended up just taking everything out from under there and tried to dry/clean everything as best I could.  \n\nThen I started getting some laundry together and got my son situated with something to do so I could start dinner.  (Yes, before anyone asks, I have ADHD and tend to start multiple things at once.  It's something I'm working on.)  My husband got home while I was cooking and as soon as he walked into the kitchen I told him I need him to look at the sink bec...",
        "reddit_judgments": {
            "YTA": 157,
            "NTA": 5,
            "ESH": 5,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 169
        },
        "total_judged": 169,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-17T05:14:35.613493"
    },
    {
        "id": "1qejewg",
        "title": "AITA for uninviting a fellow school mom and her daughter to my daughter’s party?",
        "url": "/r/AmItheAsshole/comments/1qejewg/aita_for_uninviting_a_fellow_school_mom_and_her/",
        "body_summary": "So my daughter (alias Mara) is having a birthday party this Sunday and a friend (alias Zena) that she regularly speaks about and is always playing with whenever it’s pick up time, is having hers on the Saturday. The child in question’s mother and I have been on decent terms but it’s still preschool so we all have our feelers out. I would’ve thought my daughter would be invited to Zena’s party but I found out through another mom that Zena was having a party a day before ours.\n\nFor context. I sent out invites the same day (exact date being Jan 7) she did, according to another mom, but I only got a response from her a day later stating that she and Zena would be there and that they are excited. Don’t get me wrong she absolutely has every right to invite who she wants to her daughter’s birthda...",
        "reddit_judgments": {
            "YTA": 46,
            "NTA": 9,
            "ESH": 5,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-17T05:14:51.393150"
    },
    {
        "id": "1qedo1u",
        "title": "AITA for not celebrating my birthday anymore?",
        "url": "/r/AmItheAsshole/comments/1qedo1u/aita_for_not_celebrating_my_birthday_anymore/",
        "body_summary": "Today is my birthday and I turned 25 (F). Every birthday I've had, including this one, I have never received one birthday gift, I've had the odd occasional card. I always focused my birthday gifts on what I needed and not wanted and would send a relative who asked me what I wanted one item I needed. For example, aged 14, I needed new shoes as the shoes I had on was too tight and I had grown a size, I told a relative I was constantly developing blisters and bleeding at the back of my ankle, never got the shoes, never got a present.\n\n  \nEvery year, my relatives ask me what I want to do and where do I want to go for my birthday, it never happens. If it does, my relatives say \"I have to pay for it\", if I wanted to go to McDonald's, for example, I have to pay for it myself, even though my famil...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 24,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-17T05:15:06.961935"
    },
    {
        "id": "1qea7se",
        "title": "AITA For Calling My Friend Privileged",
        "url": "/r/AmItheAsshole/comments/1qea7se/aita_for_calling_my_friend_privileged/",
        "body_summary": "Hello, I’m S (18F), and I had a falling out with my friend let’s call him A (19M).\n\nAt the moment, I’m in college without a car. A and I have an agreement that whenever I need groceries, he’ll drive me if I either buy him lunch, pay for an item on his grocery list, or give him some gas money nothing big. He’s been helpful, but I started having one issue. Not that anything bad *had* happened at first, but A smokes a lot. That in itself isn’t the problem do whatever you want but I asked that he not do it around me.\n\nI’m Black and A is white, and while I have no problem with people who smoke, I personally don’t want to be involved in that or deal with any trouble that might come with it. A would show me his carts and stuff, and during one drive he pulled one out of his glove compartment, talk...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 37,
            "ESH": 2,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-17T05:15:22.672918"
    },
    {
        "id": "1qelp7g",
        "title": "AITA for considering not going to my dad’s birthday after his partner verbally attacked my sister?",
        "url": "/r/AmItheAsshole/comments/1qelp7g/aita_for_considering_not_going_to_my_dads/",
        "body_summary": "Hi Reddit,\n\nThrowaway account for anonymity. My dad’s birthday is this weekend, and it’s one of the rare times all of us are able to be in town together. I live across the country and don’t get to see my family often. My sister (29F) and I wanted to do something meaningful for him since it’s been a long time since we’ve all been together.\n\nMy dad lives with his long-term girlfriend (let’s call her Jen). Before planning anything, my sister reached out to Jen multiple times throughout the week to ask if she already had plans for my dad. When she finally got a response, Jen said she did not have any plans. Based on that, my sister began asking a few of my dad’s close friends if they might be able to come by for a small get together, but made it clear that nothing would happen unless Jen appro...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 9,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-17T05:15:38.186989"
    },
    {
        "id": "1qeb1m4",
        "title": "AITA for not wanting to sell my friends' concert tickets?",
        "url": "/r/AmItheAsshole/comments/1qeb1m4/aita_for_not_wanting_to_sell_my_friends_concert/",
        "body_summary": "Hello Reddit. I recently bought multiple seats for a concert happening later this year. I bought several tickets upfront because I knew multiple people would likely be interested, and afterward I asked my friends if they wanted to go. They agreed, and the plan was that they would pay me back for their tickets.\n\nThey haven’t paid me yet. Recently, they noticed how much the tickets are currently reselling for and asked me to resell their tickets and send them the money instead of attending the concert.\n\nI’m unsure how to handle this. I bought the tickets intending for us to attend together, not to resell them. I also paid for everything upfront, and selling the tickets would change the original plan and affect my own experience at the concert. At the same time, they feel that since they agre...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 53,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-17T05:15:53.831041"
    }
]