[
    {
        "id": "1mqxf5e",
        "title": "AITA for not letting my colleague “borrow” my charger after she’s kept two of mine before?",
        "url": "/r/AmItheAsshole/comments/1mqxf5e/aita_for_not_letting_my_colleague_borrow_my/",
        "body_summary": "At work, I usually keep a phone charger at my desk because my battery dies quickly. In the past, a colleague has borrowed my chargers and then “forgotten” to return them. Twice I’ve had to go to her desk and ask for them back, and both times they came back weeks later looking worn out.\n\nYesterday, she came over again saying her phone was at 5% and asked to use my charger “just for a bit.” I told her I’d prefer not to lend it because the last two times I didn’t get mine back quickly. She rolled her eyes and said I was making a big deal over “a simple charger” and that I should learn to be more generous.\n\nNow a couple of people in the office think I was being petty, but I feel like I’m just setting boundaries after being taken advantage of.\n\nAITA?\n",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 113,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 116
        },
        "total_judged": 116,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-16T05:11:11.911249"
    },
    {
        "id": "1mr24s7",
        "title": "AITA for advising my sister to only enter plus-size beauty pageants and/or become a plus-size model ?",
        "url": "/r/AmItheAsshole/comments/1mr24s7/aita_for_advising_my_sister_to_only_enter/",
        "body_summary": "I (31f) have a sister (27f) who have done beauty pageants all her life. Losing effects her more the older she gets. At 22 she gained weight and became plus-size. As a plus-size woman, she had won every plus-size beauty pageant she's entered. But as a plus-size woman, she has yet to win a beauty pageant that's not specifically for plus-size women. She has done some plus-size modeling but treats it like a stepping stone. \n              Recently, she did extremely well for a plus-size 27 year old woman in a beauty pageant available to all women. She got runner-up but the winner was a thin 19 year old woman. Afterwards, she was crying and asking what she'll do now. I gave her advice but she accused me of being jealous. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 15,
            "ESH": 1,
            "NAH": 5,
            "INFO": 2,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-16T05:11:13.355449"
    },
    {
        "id": "1mra2bg",
        "title": "AITA for using professional language on an email I sent on behalf of my husband?",
        "url": "/r/AmItheAsshole/comments/1mra2bg/aita_for_using_professional_language_on_an_email/",
        "body_summary": "OP's husband asked her to email a consent form. She drafted a formal email, which he approved. He later berated her, claiming the email was embarrassing and sabotaged his job. OP asks if she's the asshole for the email's language.\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 84,
            "ESH": 5,
            "NAH": 4,
            "INFO": 2,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-16T05:11:16.932304"
    },
    {
        "id": "1mr3au9",
        "title": "AITA for firing my babysitter",
        "url": "/r/AmItheAsshole/comments/1mr3au9/aita_for_firing_my_babysitter/",
        "body_summary": "OP, a single mom, hired a friend to babysit weekly. Friend put 8-year-old Evie, who has anxiety and shares a room by choice, in the guest room alone as \"discipline\" for not sleeping. OP fired friend and refused to pay. Is OP the asshole for overreacting?\n...",
        "reddit_judgments": {
            "YTA": 40,
            "NTA": 41,
            "ESH": 38,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 123
        },
        "total_judged": 123,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-08-16T05:11:20.137819"
    },
    {
        "id": "1mr687i",
        "title": "AITA For letting my fiance un-invite his sister to our wedding",
        "url": "/r/AmItheAsshole/comments/1mr687i/aita_for_letting_my_fiance_uninvite_his_sister_to/",
        "body_summary": "OP's future SIL has been rude about OP's weight for years. After SIL insulted OP at a wedding dress fitting, fiance uninvited her. Fiance's family is upset and called OP selfish. AITA for not overruling the uninvitation?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 96,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 98
        },
        "total_judged": 98,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-16T05:11:22.111384"
    },
    {
        "id": "1mrd44z",
        "title": "WIBTA if I tell my friend I don't like being around her kid",
        "url": "/r/AmItheAsshole/comments/1mrd44z/wibta_if_i_tell_my_friend_i_dont_like_being/",
        "body_summary": "OP (32M) wants to tell his friend (29F) to stop bringing her undisciplined 4-year-old child around him. The child tantrums, demands OP's belongings, and the mom enables the behavior. OP asks: AITA if he tells his friend he doesn't like being around her child?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 42,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 43
        },
        "total_judged": 43,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-16T05:11:23.440169"
    },
    {
        "id": "1mqu3lq",
        "title": "WIBTA If I told my work bestie that the coworker she despises the most is right?",
        "url": "/r/AmItheAsshole/comments/1mqu3lq/wibta_if_i_told_my_work_bestie_that_the_coworker/",
        "body_summary": "OP's friend L oversteps at work, annoying coworker T. T emailed L to stop interfering, which L found cruel and reported to management. OP agrees with T. AITA if OP tells L she's wrong and needs to stay in her lane?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 30,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-16T05:11:24.669559"
    },
    {
        "id": "1mr6yik",
        "title": "WIBTA for not proofreading an important document that has already been proofread twice?",
        "url": "/r/AmItheAsshole/comments/1mr6yik/wibta_for_not_proofreading_an_important_document/",
        "body_summary": "OP's best friend's son wants to be a cop, despite OP's doubts due to his ADHD/carelessness. OP helped him with a lengthy application, finding many errors. After corrections, OP still found mistakes but chose not to say anything, letting him submit it as is. WIBTA if they didn't point out the remaining errors?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 28,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-16T05:11:26.049664"
    },
    {
        "id": "1mqw7sz",
        "title": "AITAH for telling my boyfriend now is not the time to get a new tattoo",
        "url": "/r/AmItheAsshole/comments/1mqw7sz/aitah_for_telling_my_boyfriend_now_is_not_the/",
        "body_summary": "OP(27F) & partner(40M) struggle financially. He got a raise, then secretly put a deposit on a tattoo without discussing it, despite them being late on bills. OP feels this is selfish. He says he deserves to treat himself. AITA for thinking he was wrong to do this?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 58,
            "ESH": 8,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 70
        },
        "total_judged": 70,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-16T05:11:28.019184"
    },
    {
        "id": "1mrbah4",
        "title": "WIBTA if I told my friend her husband is still drinking?",
        "url": "/r/AmItheAsshole/comments/1mrbah4/wibta_if_i_told_my_friend_her_husband_is_still/",
        "body_summary": "Sarah's husband, David, has destructive drinking binges. After a fight, Sarah threatened divorce, but they seemingly reconciled. OP found hidden beer cans, suggesting David is still drinking. OP is wondering if they should confront Sarah, and asks AITA for advice.\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 9,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 11
        },
        "total_judged": 11,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-16T05:11:29.137914"
    }
]