[
    {
        "id": "1qom607",
        "title": "AITA for not allowing my sister-in-law’s husband to stay in the bridal suite while we were getting ready?",
        "url": "/r/AmItheAsshole/comments/1qom607/aita_for_not_allowing_my_sisterinlaws_husband_to/",
        "body_summary": "For my wedding day, we rented a hotel suite in the city. I paid for hair and makeup for all my bridesmaids, and as a courtesy I also paid for my mother-in-law and my sister-in-law. I’m not close to my sister-in-law, but she’s very close to my husband, so I included her.\n\nOn the morning of the wedding, my mother-in-law and sister-in-law arrived late because my sister-in-law and her husband had been on a beach trip. When they arrived, my sister-in-law brought her husband into the suite with his clothes to get ready for the wedding later, which surprised me because she didnt mention anything about bringing him with her.\n\nAll three of them sat on the couch, and her husband stayed there on his phone. I texted my husband asking if he was supposed to stay and get dressed there. He didn’t know eit...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 164,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 164
        },
        "total_judged": 164,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-28T05:21:12.194204"
    },
    {
        "id": "1qolm4x",
        "title": "AITA for saying emergency daycare isn’t meant for parents who are home and „just need a break“?",
        "url": "/r/AmItheAsshole/comments/1qolm4x/aita_for_saying_emergency_daycare_isnt_meant_for/",
        "body_summary": "I am in a standoff with a friend (F20) and now I am being treated like I said something unforgivable. \n\nMy friend has a child in daycare. Today the daycare sent out a letter saying they are critically understaffed and will offer emergency care. \n\nMy friend is currently not working and stays home. She still signed her child up for emergency care and told me about it, then asked if I would do the same. \n\nI said no. We had the same exact situation before Christmas. I am also a SAHM and kept my child with me because I don’t think emergency care should be used for convenience when other parents genuinely rely on it to keep their jobs. I also think it’s unfair to already overwhelmed educators to treat emergency care like a normal service day. \n\nShe said she needs the emergency care because she i...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 124,
            "ESH": 1,
            "NAH": 5,
            "INFO": 8,
            "TotalJudged": 147
        },
        "total_judged": 147,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-28T05:21:22.638511"
    },
    {
        "id": "1qo7ghh",
        "title": "AITA for eating a normal portion of the cake my aunt made for my birthday?",
        "url": "/r/AmItheAsshole/comments/1qo7ghh/aita_for_eating_a_normal_portion_of_the_cake_my/",
        "body_summary": "For context, I (25M) love to cook. All the recipes I make, I've learned from my late paternal grandfather. One of my grandpa's dishes that I often make for almost every family gathering is his bananas foster, and for our family, it's definitely a crowd-pleaser. However, bananas are not my favorite food/flavor. I'll have a bite of the dish to make sure the dish tastes right, and I'll usually have a small portion of the bananas foster I've made.\n\nI celebrated my birthday last week, and many of my friends and family attended, including my aunt (my dad's older sister by 2 or 3 years). During the party, she approached me and gave me a bananas foster cake she made. I took the cake, thanked my aunt for it, placed it on the dessert table, and got a slice for myself. Admittedly, I did take a smalle...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 132,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-28T05:21:31.846771"
    },
    {
        "id": "1qoc11e",
        "title": "AITAH for not wanting to keep being the \"easy\" child in my family?",
        "url": "/r/AmItheAsshole/comments/1qoc11e/aitah_for_not_wanting_to_keep_being_the_easy/",
        "body_summary": "I’m 19 and the youngest in my family (closest is 24). My older siblings have always been very vocal about their needs, opinions, and what they will or won’t tolerate. Growing up that meant a LOT of arguments and long talks with my parents.\n\nI was always the opposite. I got good grades, didn’t cause problems, did my best to give my parents an easy time, and learned pretty early that things went smoother if I just didn’t ask for much. My parents used to joke that I was “so easy” compared to my siblings.\n\nNow that I’m older, I’m realising how much that stuck. If plans change, I’m expected to adjust. If someone needs a favour, I’m the one asked first. If there’s tension, I’m told to let it go because I’m “more mature.”\n\nRecently my parents planned afamily trip during a week I had already said ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 81,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 82
        },
        "total_judged": 82,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-28T05:21:39.646034"
    },
    {
        "id": "1qoa5dc",
        "title": "AITA for taking \"the best pieces\" when I serve dinner?",
        "url": "/r/AmItheAsshole/comments/1qoa5dc/aita_for_taking_the_best_pieces_when_i_serve/",
        "body_summary": "I cook dinner every day. Or what you could realistically say every day, except for the occasions where we get takeout or whatever else. I wasn't directly called an asshole for this, but there was a remark of \"You get the ~~bigger~~ better piece, huh?\"  \n**(corrected 'bigger' to 'better' as people thought it was a big enough difference to leave someone hungry)**  \nI feel like when I'm the one who figures out what we're gonna eat, does the grocery shopping, cooks the dinner, then I may have the right to decide who gets who when plating up.. Am I greedy?\n\nI wanna point out that if we get takeout or something like that, I'll offer up whatever I think they might like, it's just that when I cooked the meal and such, I feel like I can take the 'good cut'..\n\n**EDIT**: *To add some info, since the ...",
        "reddit_judgments": {
            "YTA": 68,
            "NTA": 30,
            "ESH": 5,
            "NAH": 6,
            "INFO": 8,
            "TotalJudged": 117
        },
        "total_judged": 117,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-28T05:21:53.934715"
    },
    {
        "id": "1qod4a7",
        "title": "AITA for not going to my cousins wedding because my long-term girlfriend wasn’t invited",
        "url": "/r/AmItheAsshole/comments/1qod4a7/aita_for_not_going_to_my_cousins_wedding_because/",
        "body_summary": "I (25M) and my girlfriend (25F) have been in a relationship for nearly 3 years, living together for 2 years. My cousin (29M) and his fiancée (28F) live in a different country and are coming back here to get married in about 6 months. \n\nA few weeks ago, they called around to give my family their invitation (I have 2 siblings, 21M and 17F) and my girlfriend was also at the house. We all chatted about the wedding etc and they went on their way. The invite was vague, directed to “Mother, Father and family”. But it wasn’t even a question in our minds that my girlfriend wouldn’t be going. She has a hotel booked and has been looking for dresses since. \n\nFor context, my extended family is quite small and my girlfriend would be quite close to them, has been to all family events, babysat the younger...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 48,
            "ESH": 2,
            "NAH": 44,
            "INFO": 8,
            "TotalJudged": 112
        },
        "total_judged": 112,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-28T05:22:02.584086"
    },
    {
        "id": "1qohehv",
        "title": "AITA for leaving a small gathering after being told I was overreacting",
        "url": "/r/AmItheAsshole/comments/1qohehv/aita_for_leaving_a_small_gathering_after_being/",
        "body_summary": "I'm 24F, Last weekend, a few friends got together at one person’s apartment to hang out. It wasn’t a party just snacks, music, and talking. I’d had a rough week and told everyone beforehand that I was a bit low energy but still wanted to come by for a bit. At some point, the conversation shifted into jokes about personal stuff. Most of it was fine, but then one friend started making repeated comments about something I’m sensitive about. I laughed it off at first, but after the third or fourth remark, I asked them calmly to drop it. They rolled their eyes and said I was being dramatic and that it was just jokes. A couple of others laughed, not really at me, but not exactly helping either. I felt embarrassed and honestly pretty small in that moment. I didn’t argue. I just grabbed my jacket, ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 79,
            "ESH": 1,
            "NAH": 0,
            "INFO": 12,
            "TotalJudged": 96
        },
        "total_judged": 96,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-28T05:22:11.846128"
    },
    {
        "id": "1qol3a4",
        "title": "AITA for making my nephew cry because I told him he is \"not talented\" at video games?",
        "url": "/r/AmItheAsshole/comments/1qol3a4/aita_for_making_my_nephew_cry_because_i_told_him/",
        "body_summary": "My sister and her son (8 years old) stay at my house for weekend. My nephew love video games, but he is very bad at them. He play my console and he lose every time. When he lose, he scream, throw my controller, and say the game is \"cheating\".\n\nMy sister just laugh and say \"he is just competitive, he is so talented for his age\".\n\nYesterday he almost break my expensive controller. I took it from him and told him: \"You are not talented. You are just loud. If you don't learn how to lose, you don't play anymore.\"\n\nHe start crying very loud. My sister is angry now. She say I \"destroyed his confidence\" and that I am \"cruel\" to a child. She say I should apologize and tell him he is great player. I refuse. I think kids need to know the truth.\n\nAITA? (English is my second language, sorry).",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 26,
            "ESH": 43,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 86
        },
        "total_judged": 86,
        "reddit_verdict": "ESH",
        "fetched_utc": "2026-01-28T05:22:12.628366"
    },
    {
        "id": "1qopx0f",
        "title": "AITA for telling my mother that I don't want her in my home if she and her family can't leave my things alone?",
        "url": "/r/AmItheAsshole/comments/1qopx0f/aita_for_telling_my_mother_that_i_dont_want_her/",
        "body_summary": "My mom has never taken me seriously when it comes to my things. As a child it was small stuff like moving around my furniture without asking or using my things without permission. Now, it's become a bigger issue. \n\nI'm very particular about my things, where I want them to be, and most importantly, cleanliness. I cannot stand dirt (we used to live in a home with mice, ants, pests, I'd often wake up to bugs on me and it drove me insane, my mom never cared, I had to clean the home everyday even as a child). My mom will come into my home and touch random objects and she brings my bratty preschooler sister with her. They touch things from family heirlooms to my childhood toys and leave behind butter, grease and never reorganise what they touched. The last time I spent an hour washing one of my ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 69,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-28T05:22:20.202970"
    },
    {
        "id": "1qo8pdj",
        "title": "AITA for feeding my cat on my plates?",
        "url": "/r/AmItheAsshole/comments/1qo8pdj/aita_for_feeding_my_cat_on_my_plates/",
        "body_summary": "I have a cat who used to eat too quickly - he’d scoff his food down as far as possible like it was going to be the last food he’d ever have, then often vomit it back up. When he was about a year old someone suggested I try feeding him on a dinner plate because it could slow him down, which I tried and it dramatically reduced his vomiting level, so I’ve been doing that for the last five years. They are my usual dinner plates, they get cleaned in the dishwasher after every use whether that’s use by him or use by me.\n\nI had some friends over a couple of months ago for dinner, including a couple who are a bit newer to the group. Looking back they were eating quite slowly and hesitantly, but at the time I thought that was just their eating speed. Roughly the same group came back this weekend, b...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 133,
            "ESH": 5,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 149
        },
        "total_judged": 149,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-28T05:22:30.091051"
    }
]