[
    {
        "id": "1qh5etb",
        "title": "AITA for refusing to change the chore chart even tho my wife works full time now.",
        "url": "/r/AmItheAsshole/comments/1qh5etb/aita_for_refusing_to_change_the_chore_chart_even/",
        "body_summary": "I met my wife in college and she was soon pregnant after we graduated. We moved in together and it was decided that she will not look for a job until she after she gave birth.\n\nOur daughter was born and my wife was a SAHM for the first two years. We had a lot of fight about the chore splitting. I was very overwhelmed coming home and having to do a ton of chores after work and also spend time with our daughter . This has gotten worse as our daughter has gotten older and  is a little tornado \n\nThe biggest issue was she wouldn’t pick up at all especially in the kitchen. That ment I would come home clean the kitchen, cook and then clean the kitchen again. The have to go around and clean up the days activities.\n\nWe argued about this a lot and her stance was she watches our kid all day long so I...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 99,
            "ESH": 28,
            "NAH": 2,
            "INFO": 6,
            "TotalJudged": 137
        },
        "total_judged": 137,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-20T05:22:23.088538"
    },
    {
        "id": "1qhfu83",
        "title": "AITA for calling my sister out for parentifying my niece?",
        "url": "/r/AmItheAsshole/comments/1qhfu83/aita_for_calling_my_sister_out_for_parentifying/",
        "body_summary": "I I was having a conversation with our mom about how I was just told that since I failed a class last semester, my financial aid was taken, so I have to skip this upcoming semester.\n\nUnprovoked, my sister jumped in, saying I needed to just give up on school because I’ve only successfully completed one semester in almost 2 years, just turned 27, and need to grow up and find a job because clearly college wasn’t for me since the one semester I completed, I was constantly complaining about being tired and burned out. I pointed out that I was burned out because not only was I taking 21 credit hours but also balancing 2 full-time jobs.\n\nShe insisted that I had “no idea” what tired is and that I don’t have to work all day and then come home to kids, and all I do is game and “feed off the governme...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 18,
            "ESH": 11,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-20T05:22:39.059436"
    },
    {
        "id": "1qh8kvi",
        "title": "AITA for refusing to go on a extended family vacations?",
        "url": "/r/AmItheAsshole/comments/1qh8kvi/aita_for_refusing_to_go_on_a_extended_family/",
        "body_summary": "Long story short, we usually travel as a large group of friends, extended family and kids. About 15-20 persons as a group overall.\n\nWe usually rent properties and do some activities during the week and share expenses. We are doing this since at least 2019.\n\nHowever, for my part it is usually the worst week ever. All I do is haul luggage, manage the car rental, activities and drive everyone around.\n\nUsually, this kind of trips happens near beaches, islands and remote places usually popular with tourists. However, I'm not that much of a beach guy and dread the heat and sun. Hauling chairs, rent spots, haul beach toys, all this for a few hours are usually enough to ruin my day.\n\nLast week, my SO made plans and I told her that I would prefer a smaller laid back trip with only our family (M and...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 19,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-20T05:22:54.936181"
    },
    {
        "id": "1qh7nqz",
        "title": "AITA for not wanting to look at my dad's ass?",
        "url": "/r/AmItheAsshole/comments/1qh7nqz/aita_for_not_wanting_to_look_at_my_dads_ass/",
        "body_summary": "I'm a medical student and I'm currently at home for vacation. My dad had been complaining of this weird painful lump near his anus for sometime and told me to take a look at it, you know for clinical purposes.\n\nI refused and offered to take him to a doctor. He's been angry at me ever since and yells at me even if I breathe too loud. My parents live in a pretty remote hilly region and the nearest hospital is about an hour away but the road is a bit difficult to drive through. \n\nThe pain got a bit more severe and my dad started complaining about not being able to walk so I told him to take the day off and went to work in his stead. (my parents run two restaurants for hikers and tourists) He has faked many illnesses before so me and my mum thought that he was being dramatic and obnoxious as u...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 63,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-20T05:23:10.907090"
    },
    {
        "id": "1qgvkaq",
        "title": "WIBTA for refusing to let boyfriend's family stay at our apartment",
        "url": "/r/AmItheAsshole/comments/1qgvkaq/wibta_for_refusing_to_let_boyfriends_family_stay/",
        "body_summary": "I (F, 31) live in Boston and share a small 600 sq ft, 2 bed/1 bath apartment with my boyfriend (M, 39). We use our second bedroom as a small guest room/office space (I work from home 1 to 2 days a week). The guest room has an Ikea daybed that was designed to pull out into a queen size, utilizing two very thin mattresses. Since we seldom have guests over, we opted for using one decent quality twin size mattress instead, expecting our most frequent guests to be our respective moms (both live out of state).\n\nWe have lived here for a year, and the extent of our guests so far have been my mother who came to stay with us for three nights this summer, and BF's brother-in-law who stayed with us for two nights in the fall. Now, BF has informed me that his BIL had so much fun in Boston, and that bot...",
        "reddit_judgments": {
            "YTA": 74,
            "NTA": 44,
            "ESH": 4,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-20T05:23:31.037653"
    },
    {
        "id": "1qhb3y0",
        "title": "AITA for leaving my bathroom light on over Christmas",
        "url": "/r/AmItheAsshole/comments/1qhb3y0/aita_for_leaving_my_bathroom_light_on_over/",
        "body_summary": "I (26m) live with with two roommates (26m and 25m). I have the master bedroom, which includes a private bathroom. Over Christmas, both of my roommates left town to visit their families. My family only lives a couple hours away, so I didn’t leave until Christmas Eve, and was only gone for 3 days (I came back the day after Christmas). \n\nUpon leaving, I left my bathroom light on. Since the bathroom is connected to my bedroom, the light only reflected in my personal space and not any shared areas. Growing up, my family always left a porch light on when we went on vacations. This was both to make it look like someone was home and and because it felt nice to come home to some light. I left the light on for the same reasons. Additionally, my cat stayed behind, and my room doesn't get the best nat...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 54,
            "ESH": 1,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-20T05:23:47.349519"
    },
    {
        "id": "1qgw8sj",
        "title": "WIBTA if I asked my flatmate to move out after her dog keeps peeing inside?",
        "url": "/r/AmItheAsshole/comments/1qgw8sj/wibta_if_i_asked_my_flatmate_to_move_out_after/",
        "body_summary": "A bit of context:\n\nMy (M27) parents have this two story house in town that they've been renting out for years. One previous tenant left the house in such a state that they had to renovate the whole house, including replacing the downstairs floor with Lino after the previous tenant's dog had destroyed the carpet with all its pee.\n\nDue to my original apartment I was renting being put on the market by the landlord, my parents offered to let me rent their rental, but I would need to get two roommates to help cover the cost. They are alright with the roommates having pets, so long as they don't pee upstairs, as they don't want to have to replace the carpet again.\n\nMy roommate (K) has an older dog (16 years old), who, on the same day they moved in, peed in my room. K cleaned it up and assured me...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 21,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-20T05:24:03.128101"
    },
    {
        "id": "1qh47hg",
        "title": "AITA for wanting to move out despite my parents’ problems at home?",
        "url": "/r/AmItheAsshole/comments/1qh47hg/aita_for_wanting_to_move_out_despite_my_parents/",
        "body_summary": "I’m a 22-year-old guy in the UK with Indian parents. I was raised in the uk and there weren’t many other Indian people in my area, so I’ve always clashed a bit with my parents over cultural things like going out, relationships, and independence. They aren’t abusive or evil, but they are traditionally controlling.\n\nFor example, last year my mum found out I had a white girlfriend and completely blew up, threatening to cut me out of the family. We didn’t speak for months because every time I tried to talk calmly she would shout and lose her temper (this is common for her, I have recommended therapy in the past which she refuses.)\n\nFor context, my parents own a shop. My dad has slowly become an alcoholic over the last 10 years. I’ve had to break up arguments for years, and over the last few ye...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 41,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-20T05:24:18.903893"
    },
    {
        "id": "1qh60fl",
        "title": "AITA for not including my friend’s boyfriend in our girls’ plans?",
        "url": "/r/AmItheAsshole/comments/1qh60fl/aita_for_not_including_my_friends_boyfriend_in/",
        "body_summary": "I (F22) am part of a close friend group with H (me), ZA (F23), and MM (F23). We’ve all known each other for years and went to an all-girls school together, so our friendship has always been very “girls-only” and pretty tight-knit.\n\nRecently, ZA started dating AP (M21). He seems fine overall, and I don’t have a personal issue with him, but since they started dating, ZA has been trying to include him in *everything* we do. We don't have a particular problem with it, but we kind of preferred the male-free friendship, since there's less tension.\n\nLast weekend, MM and I planned a girls’ night at my place. I was quite clear in the group chat that it was just going to be us lot. ZA agreed. However, about an hour before she was supposed to come over, she texted saying AP was “already with her” and...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 42,
            "ESH": 0,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-20T05:24:34.727012"
    },
    {
        "id": "1qhewvz",
        "title": "WIBTA, for evicting my grandmas stepdaughter",
        "url": "/r/AmItheAsshole/comments/1qhewvz/wibta_for_evicting_my_grandmas_stepdaughter/",
        "body_summary": "Susan is my grandma’s step-daughter from a previous marriage. Susan and her partner, Mark, moved into my grandma’s house in October 2024 when Susan had just been diagnosed with breast cancer and fell behind on rent. Out of sympathy, my grandma allowed them to stay rent-free, believing it would only be temporary. Susan is now cancer-free, but neither Susan nor Mark has obtained a job, and both rely on Social Security. I have also seen that Mark has active VPOs listed on the state website.\n\nIn October of this year, my grandma was diagnosed with lung cancer. As her health declined, she asked me and my partner to step in as power of attorney and purchase the house so she wouldn’t have to worry about what would happen to it after she passed. During her final days, Susan became my grandma’s prim...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 22,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-20T05:24:50.468955"
    }
]