[
    {
        "id": "1pi816r",
        "title": "AITA for refusing to clock out early so my coworker can take her kid to the hospital?",
        "url": "/r/AmItheAsshole/comments/1pi816r/aita_for_refusing_to_clock_out_early_so_my/",
        "body_summary": "I (31 F) carpool to work every day with four coworkers. We all live about an hour away from the office and have been carpooling ever since they forced us back to full time in person so that we could share commuting expenses (Gas and tolls).\n\nOne of my coworkers (let's call her S) has a young child who recently got very sick.For the last few days he’s been having constant nosebleeds so bad that he's even gone through an entire roll of toilet paper trying to stop the bleeding.\n\nLast Sunday night it got so bad that they took him to the hospital. On Monday she still came to work as usual and didn’t mention anything about it until we were all driving home. That’s when she told us she hadn’t asked her boss for time off to take her kid to the hospital because she “didn’t think she would be allowe...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 129,
            "ESH": 0,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-10T05:13:58.598068"
    },
    {
        "id": "1picthv",
        "title": "AITA for refusing to wake my brother up for work when he goes back to sleep?",
        "url": "/r/AmItheAsshole/comments/1picthv/aita_for_refusing_to_wake_my_brother_up_for_work/",
        "body_summary": "My (22M) brother (18M) has always been an extremely tight sleeper. Even in his childhood, our parents have tried to shake him awake and it's still difficult to get him up. In his later years, he had started to sleep through his alarm and, even though we sleep in separate rooms, I could still hear it and would have to go into his room to get him to turn it off.\n\nLast year, he got a job at a retail store. He loves his job and his coworkers. Unfortunately, recently, he has been late to work a couple of times. What had been happening is, although he does wake up when his alarm goes off, he had been falling back asleep afterwards. Now, I know this happens to a lot of us (I'll admit, it has happened to me at one point). \n\nThe second time it happened, while I was driving him to work, he had asked...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 119,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 125
        },
        "total_judged": 125,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-10T05:14:15.482205"
    },
    {
        "id": "1pibbhk",
        "title": "AITA for yelling at my sister after she ruined my one day off?",
        "url": "/r/AmItheAsshole/comments/1pibbhk/aita_for_yelling_at_my_sister_after_she_ruined_my/",
        "body_summary": "So I (19M) work full-time at a café + do online classes. I usually don’t get a proper day off. Last Sunday was literally the *first* day in like three weeks where I didn’t have to wake up early, deal with customers asking for “extra hot oat milk foam,” or attend stupid Zoom lectures.\n\nMy sister (24F) lives with us temporarily because she’s “figuring things out.” Which mostly means she sleeps till noon and then complains that “nobody respects creatives.” Whatever.\n\nAnyway, Saturday night I told everyone in the house that **I’m sleeping in on Sunday**. No alarms. No noise. No waking me up for anything short of a fire.\n\nCut to Sunday morning: it’s 6:47 AM and my door flies open like someone kicked it. My sister is freaking out because she can’t find her favourite black top. She’s blaming ever...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 106,
            "ESH": 6,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-10T05:14:31.908516"
    },
    {
        "id": "1pi4n2t",
        "title": "AITA for telling my friend to stop joking that I’m obsessed with her boyfriend when it makes everyone uncomfortable?",
        "url": "/r/AmItheAsshole/comments/1pi4n2t/aita_for_telling_my_friend_to_stop_joking_that_im/",
        "body_summary": "I 19 Female, have a friend, Lana, who loves teasing people for reactions. When she started dating her boyfriend, she suddenly began making jokes like, Careful, my boyfriend is too cute, Kali probably wants him for herself.  At first I laughed awkwardly, assuming she’d drop it.  But she started repeating it at parties, in group chats, even in front of people I barely knew. Some people started giving me weird looks, like I was secretly chasing after someone else’s man.\n\nI pulled her aside and said it made me uncomfortable because it wasn’t true and it made me look desperate or sneaky. She just laughed and said I was too sensitive.\n\nLast week at a hangout, someone asked her how they met, and she said, Well I had to get to him before Kali did.  Everyone laughed except me. I said calmly, I’ve a...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 49,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-10T05:14:47.955423"
    },
    {
        "id": "1pighn3",
        "title": "AITA for \"not contributing\" to a group project because I got my period?",
        "url": "/r/AmItheAsshole/comments/1pighn3/aita_for_not_contributing_to_a_group_project/",
        "body_summary": "Using a throwaway because my main has my name and posts in my college subreddit and would rather stay anonymous haha.\n\n\n\nIn one of my courses, we were randomly assigned group members for a project. I (22F) was with 3 other men (don’t know ages but early 20’s). One of the members I was familiar with, I wouldn’t call us friends but we’ve had other classes and assignments together. The other two I didn’t know. \n\n\n\nWe met in the library to decide a topic and assign roles so we could go home and do our parts on our own. When we got there, the wifi was down. One of the group members offered we could go to his apartment since he lives right beside campus. Usually, I wouldn’t be comfortable with this but it was the man I’ve worked with before so I felt it was okay.\n\n  \nAfter around 10 minutes of g...",
        "reddit_judgments": {
            "YTA": 42,
            "NTA": 30,
            "ESH": 12,
            "NAH": 6,
            "INFO": 4,
            "TotalJudged": 94
        },
        "total_judged": 94,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-10T05:15:05.397199"
    },
    {
        "id": "1pi5md5",
        "title": "AITA for telling my sister she can't use the bathroom?",
        "url": "/r/AmItheAsshole/comments/1pi5md5/aita_for_telling_my_sister_she_cant_use_the/",
        "body_summary": "I am a twenty years old disabled person. I'm getting up at 6:30AM everyday, and have to leave home at 8:00AM to go to work. I take meds in the morning, and I have to wait 30 minutes after taking it before I can eat my breakfast (or it won't work). I also sometimes take longer to shower since my mobility is reduced and I might need to sit (and I have a hard time washing my hair). I'm waking up extra early just for this even tho I have chronic fatigue and need to sleep longer than average. I also go to bed between 8:00PM and 8:30PM to try to meet my needs, but it's still not enough.\nSo I wake up, take my meds, go to shower, when I have my underwear on I go back to my room to get ready, and only then I can eat breakfast. And I still have to make my lunch for work.\nMy sister's 15 and she's wak...",
        "reddit_judgments": {
            "YTA": 40,
            "NTA": 13,
            "ESH": 6,
            "NAH": 2,
            "INFO": 7,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-10T05:15:24.893972"
    },
    {
        "id": "1pibcy1",
        "title": "AITA for not hiding my feelings about a forced family trip",
        "url": "/r/AmItheAsshole/comments/1pibcy1/aita_for_not_hiding_my_feelings_about_a_forced/",
        "body_summary": "My in-laws have invited (forced) us to go on a family cruise for a week.    It’s going to be them, (70s) plus brother and sister in-law (40s) and their 2 kids (13 and 10).  We have 2 kids (8 and 3).  \n\n They’ve put pressure on my wife for us to go.  My wife has then put a shit ton of pressure on me to go.  Now that fact is, I’m going to go, there’s no way I’m avoiding that.  But I’ve told her that this going to be one of the worst weeks of my life, I’m going to be absolutely miserable and I’m not going to pretend that I’m happy about this.  Here are my reasons why:\n\n Our 3-year-old (Let’s call him Tim).  The boy is right in the middle of his defiance stage and he only listens to me.  I’d say about 75% of the time he does what I ask him  (go pee, time for dinner, eat your dinner, time for s...",
        "reddit_judgments": {
            "YTA": 48,
            "NTA": 29,
            "ESH": 12,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 91
        },
        "total_judged": 91,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-10T05:15:42.923520"
    },
    {
        "id": "1pihzhd",
        "title": "AITA for refusing to put my future at risk for my girlfriend's mother?",
        "url": "/r/AmItheAsshole/comments/1pihzhd/aita_for_refusing_to_put_my_future_at_risk_for_my/",
        "body_summary": "I (25 M) have been with my current girlfriend (24 F, we'll call her Jess) for a little under 3 years now. Her mother (50 F, we'll call her Sue) has been in a relationship with someone (69 M, we'll call him David) after Jess's father passed a few years ago. Jess and her little sister (17 F, we'll call her Eve) have never liked David. About a year after Jess and I got together, Sue and David got married. \n\nBefore the marriage, David seemed like someone who would just sit around the house all day, but would still go out every so often. Afterwards, it got worse. Sue would have to beg David to take her places since she can't drive. All 5 of us live in a 4 bedroom together that I moved everyone into after Sue, Jess, Eve, and I decided that we no longer wanted to live in a big city back in 2023. ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 34,
            "ESH": 2,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-10T05:15:58.710194"
    },
    {
        "id": "1pif1jj",
        "title": "AITA for asking someone to stop smacking their gum in a public setting?",
        "url": "/r/AmItheAsshole/comments/1pif1jj/aita_for_asking_someone_to_stop_smacking_their/",
        "body_summary": "I asked the man next to me at the pharmacy seating area to stop smacking his gum. I very kindly said \"I'm not trying to be an asshole but could you please stop smacking your gum?\" he goes 'mmm a little bit of an asshole'. He then went on to talk about how he would rather have less Christmas music (some I, a fellow shopper, have...any control over?) and made a big scene about throwing away the gum, which is not something I asked or implied he should do.\n\nNow two things: 1. I am autistic and sound is a huge sensory overload for me. the sound was making me want to scream. Obviously doing that *would* make me the asshole, however I was very kind and patient in my ask of him to stop making the noise. I also waited about ten minutes before saying anything. \n\n2. If there was anywhere else to go s...",
        "reddit_judgments": {
            "YTA": 58,
            "NTA": 67,
            "ESH": 12,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 141
        },
        "total_judged": 141,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-10T05:16:16.488591"
    },
    {
        "id": "1pikw09",
        "title": "AITA Mil keeps buying gifts only for my daughter",
        "url": "/r/AmItheAsshole/comments/1pikw09/aita_mil_keeps_buying_gifts_only_for_my_daughter/",
        "body_summary": "Just like the title says, my mil keeps buying gifts just for my daughter, (K 5yrs). We also have a son (B 18mo). \n\nMy husband works in the same city as his parents, often they’ll give him a present to bring home for our daughter. Lately this has started to bother me because they NEVER get anything for B. I mean, he is a baby but he’d still enjoy bubbles or stickers.\n\nThe past two weeks they have sent 3 gifts to just my daughter. Today it was a full set of paintable ceramic nativity scene. I told K she needed to pick 2 of the pieces (out of 8) for B to paint because they needed to share it. She was totally fine with this. \n\nWhen my husband got up (he works graves) he was excited about the nativity and asked me if K had seen it. I said “Yes, but this is one of 3 gifts she’s gotten in the las...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 36,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-10T05:16:32.328754"
    }
]