[
    {
        "id": "1qznuac",
        "title": "AITA for not letting the previous owner’s adult children into my house after their father died?",
        "url": "/r/AmItheAsshole/comments/1qznuac/aita_for_not_letting_the_previous_owners_adult/",
        "body_summary": "This weekend, 2 people knocked on our door and said they were the previous owner’s children. I answered via our ring camera. They explained that their father had just passed away and that they wanted to come inside to look around and see the house where they grew up. They were emotional and said they were struggling with the loss. And that this is was the place they had the most memories of and left connected to their father. \n\nI felt bad, but I told them no. I explained that I wasn’t comfortable letting people I don’t know into my home, and I didn’t feel safe or prepared to host strangers, regardless of the circumstances. My husband also wasn’t home so I was alone.\n\nThey didn’t take it well. One of them became visibly upset and the other said they couldn’t believe I would deny them someth...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 157,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 161
        },
        "total_judged": 161,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-09T06:00:52.234327"
    },
    {
        "id": "1qzo92m",
        "title": "AITA for taking a coloring book back from my niece after she got attached to it?",
        "url": "/r/AmItheAsshole/comments/1qzo92m/aita_for_taking_a_coloring_book_back_from_my/",
        "body_summary": "I (27F) live with my husband (31M). We’ve been married about a year and a half. Overall things are good, but we’re still figuring out boundaries, especially around our stuff.\n\nI collect Hello Kitty and Sanrio items. Nothing extreme, but I have a small display shelf in the living room and a few related things on the bookshelf. Most of it is stuff I’ve picked up over the years. I fell in love with Hello Kitty as a kid when I lived in Japan, and after my family moved to the US I stopped seeing it around, so collecting it now feels a little nostalgic.\n\nLast year I went back to Japan to visit my grandparents and found these really nice Sanrio coloring books. They’re not like the cheap kids’ ones at the store. The paper is thicker, the art is really detailed, and I bought them more as nostalgic ...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 133,
            "ESH": 10,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 151
        },
        "total_judged": 151,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-09T06:01:02.549425"
    },
    {
        "id": "1qz8p9m",
        "title": "AITA for making a scene when my friend's friend was making fun of my wife?",
        "url": "/r/AmItheAsshole/comments/1qz8p9m/aita_for_making_a_scene_when_my_friends_friend/",
        "body_summary": "For some context, my wife is from Sweden. But her mother, who still lives in Sweden, is Ukranian and my wife got a lot of her traits so she does look very Slavic and, to be fair, it is something that stands out in the part of the US we live in. She is also not eligible to be a naturalized citizen in the US for a couple of years as she hasn't been in the US long enough and we have only been married for 10 months. \n\nBut, yesterday I went out to dinner and drinks with some of my friends, and one of my close friends brought his longtime friend who was visiting I've known for awhile. I have never particularly liked this person, but he's kind of a \"friend by proxy\" since he's close with one of my close friends and I just see him a few times a year at most. He's the type that has a tendency to re...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 129,
            "ESH": 6,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 148
        },
        "total_judged": 148,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-09T06:01:12.085891"
    },
    {
        "id": "1qzeulk",
        "title": "AITA for not housing my younger brother for free?",
        "url": "/r/AmItheAsshole/comments/1qzeulk/aita_for_not_housing_my_younger_brother_for_free/",
        "body_summary": "So, a bit of context to make sure everyone knows what's up. I'm 27 and living alone in a flat (apartment), I've been in the place since 2019 and made it a good spot for myself. My younger brother (Let's just call him Dave for convenience (not his real name obvs)) is currently 19 years old and still lives with our mum. Dave stays there for free, doesn't pay rent, his own food, none of that, the only thing he pays for is whenever he goes to Wetherspoons and gets his own food.\n\nRecently, he and mum have been getting into a lot of arguments, arguments that I only know about because I always get phone calls from both of them so they can complain about the other. It's even gotten to borderline petty where my brother will flat out call our mum a bitch because she asked him to do the dishes, and t...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 126,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 127
        },
        "total_judged": 127,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-09T06:01:21.082887"
    },
    {
        "id": "1qzmxwn",
        "title": "AITA for calling gold stable and my sister losing $1,000 because of it?",
        "url": "/r/AmItheAsshole/comments/1qzmxwn/aita_for_calling_gold_stable_and_my_sister_losing/",
        "body_summary": "I’m 19M and I’ve been trading for a few months. I’m up about 15%. My sister (22F) saw this and asked what she should do with her savings. I told her to look into gold because it’s generally stable and safer than most investments.\n\nShe bought some gold on Jan 22. The price went up a little, so she felt good about it and bought more on Jan 27. Altogether, she invested $10k.\n\nRight after that, the price dropped. She got really scared because that’s a lot of money for her. On Feb 1, she sold everything and locked in a $1,000 loss. After she sold, the price went back up and is now higher than when she first bought.\n\nNow she wants me to pay her back the $1,000. She says I tricked her by calling gold stable when it dropped about 10% in a week. She says she wouldn’t have invested that much if I ha...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 59,
            "ESH": 25,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 100
        },
        "total_judged": 100,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-09T06:01:29.084281"
    },
    {
        "id": "1qzslpt",
        "title": "AITA For refusing to tell the men in my family about my period?",
        "url": "/r/AmItheAsshole/comments/1qzslpt/aita_for_refusing_to_tell_the_men_in_my_family/",
        "body_summary": "Growing up my Dad said that I had to tell him and my brother each month when I got my period. For background there were 3 girls and 2 males in the household. This started when I got my period at age 11. His reasoning was that, as a man, he and my brother would need to know when to expect me to be more \"hormonal\". When I pushed back and said I had a right to privacy he was adamant that it was his right as a man and my father to know when I was on my period. I did not follow up on this and was lectured several times.\n\nThis was many years ago. The issue is my Mom still thinks this is a courteous thing to do and is kind and communicative. I on the other hand disagree and believe it was an invasion of my right to privacy. My Father still, of course, believes he had a right to know. \n\nSo, AITA f...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 135,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 138
        },
        "total_judged": 138,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-09T06:01:37.508484"
    },
    {
        "id": "1qzqh70",
        "title": "UPDATE: AITA for giving my friend a much-needed reality check?",
        "url": "/r/AmItheAsshole/comments/1qzqh70/update_aita_for_giving_my_friend_a_muchneeded/",
        "body_summary": "Since my original post, Dave and I finally had a proper conversation. I gave him a call the day after the post.\n\nHe told me that what I said genuinely hurt him, but he also admitted that, deep down, he knew I was right. He ended up breaking down and opening up in a way he never has before. He said this isn’t the life he pictured for himself, that he feels like he’s let his family down, and that he worries it’s “too late” to turn things around.\n\nFor context I didn’t include earlier: Dave comes from a very strict Asian household. He was expected to become a high-earning professional, and while his two younger siblings have gone on to build successful careers and start families, Dave burned out in uni. He told me that watching his siblings thrive while he struggled has crushed his self-esteem...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 0,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 0
        },
        "total_judged": 0,
        "reddit_verdict": "No Judgments Found",
        "fetched_utc": "2026-02-09T06:01:44.861879"
    },
    {
        "id": "1qziamh",
        "title": "AITA for refusing to dye my hair a ‘natural’ color and take my face piecering out for my great grandfather’s funeral?",
        "url": "/r/AmItheAsshole/comments/1qziamh/aita_for_refusing_to_dye_my_hair_a_natural_color/",
        "body_summary": "My great Grandfather died a couple days ago and the funeral service will be next week. I’m a senior in college and I’m taking off of work and school to go to my great grandfather’s funeral an honor his memory. I live in a different state than the rest of my family so I have to fly out there. It’s a whole expensive process to go to this funeral, but i want to be there for my grieving family and see my Pop Pop one last time. \n\nMy mother and Older sister called me earlier today and told me that I have to either wear a hat or dye my hair a natural color AND take out all my face piecering when I go to the service. \n\nI said no that its a disrespectful request to ask me to do all that. \n\nPop Pop always said he loved my hair and the way I dress (I’ve been dying my hair for the better part of a dec...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 44,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 46
        },
        "total_judged": 46,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-09T06:01:52.542646"
    },
    {
        "id": "1qzmt34",
        "title": "AITA for not letting my in-laws do laundry at my house?",
        "url": "/r/AmItheAsshole/comments/1qzmt34/aita_for_not_letting_my_inlaws_do_laundry_at_my/",
        "body_summary": "For context I have bought them a house. My brother in law is 50 and works retail with no ambition. He totes my wife’s parents around. The house I bought them I take care of. Mowing lawns and yard work. Fixing anything that breaks. They have washer and dryer hook up but they never have money. It’s almost as if they could be given a million dollars and still be broke. The reason I don’t want them to do laundry here is because they have no respect for my things. Overloading the washer. Putting shoes in my dryer. Just irresponsible behavior. I told them last week that they can just go use a laundry mat. AITA for telling them to do that?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 16,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-09T06:01:52.901399"
    },
    {
        "id": "1qzfn7i",
        "title": "AITA for rushing my brother when he spilled drinks on the computer",
        "url": "/r/AmItheAsshole/comments/1qzfn7i/aita_for_rushing_my_brother_when_he_spilled/",
        "body_summary": "So today my(20M) brother (19m) spilled coke all over the computer desk, I being in the room immediately got up, turned on the lights and was telling him to quickly wipe it as to not damage the computer, I handed him a handchief since that was all that was around, he was going very slowly and did not seem to even care, I kept telling him to just do it because well, he spilled his drink all around, he said \"its not even wet\" after lifting the SOAKED keyboard, I told him to fuck off and just start wiping. He started to just get back to using the computer and I said \"well what about the PC, what about the floor, there's wires you need to check\" he said \"if it was important something would have happened\" I said \"oh yea cause you're an expert technician\" he then got up from the seat and checked ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 21,
            "ESH": 2,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-09T06:02:00.477772"
    }
]