[
    {
        "id": "1qss29u",
        "title": "AITA Insisting 33 year old boyfriend wears shoes in shopping centres",
        "url": "/r/AmItheAsshole/comments/1qss29u/aita_insisting_33_year_old_boyfriend_wears_shoes/",
        "body_summary": "AITA - Me (35f) had been planning on going to our local very large shopping centre all day. When I've finished work he's come over and I gave him a 30 minute reminder, a 15 minute reminder and a 5 minute reminder we were leaving. \nOnce we left I asked him he brought shoes (ongoing dispute in our relationship) and he said no. I've told him countless times he has the choice to not wear shoes when we leave the house but I also have a choice to not have a part of it. I informed him I consider not wearing shoes in public a disgusting practice and he started accusing me of him insulting him and calling him disgusting. I reiterated I wasn't saying that about him as a person just the act of going barefoot in nice very busy shopping centres. On the drive there I informed him he would be staying in ...",
        "reddit_judgments": {
            "YTA": 16,
            "NTA": 56,
            "ESH": 11,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 85
        },
        "total_judged": 85,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-02T05:56:54.924549"
    },
    {
        "id": "1qtf1hb",
        "title": "AITA for refusing to let my MIL babysit over a dummy?",
        "url": "/r/AmItheAsshole/comments/1qtf1hb/aita_for_refusing_to_let_my_mil_babysit_over_a/",
        "body_summary": "\\*Throwaway\\*\n\nAs the title mentions, this is over something people might consider to be trivial. Here goes.\n\nI have a toddler. Said toddler was inseparable from their dummy (pacifier) to the point we had to make them go cold-turkey.\n\nI had many sleepless nights because the dummy was a vital part of their night-time routine, but any access to one would cause a world of chaos for us.\n\nLong story short, it took us 1 month to fully wean and 3 months to get to the point where any stray dummies were voluntarily surrendered.\n\nWe have a baby now. Our toddler was great at handing the dummies to the baby without daring to put it in their own mouth. That was until my MIL babysat and we returned to find our toddler asleep with a dummy in their mouth.\n\nMy husband was furious and tried to explain what ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 84,
            "ESH": 1,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 94
        },
        "total_judged": 94,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-02T05:57:03.786203"
    },
    {
        "id": "1qsvvpp",
        "title": "AITA for not helping my in laws?",
        "url": "/r/AmItheAsshole/comments/1qsvvpp/aita_for_not_helping_my_in_laws/",
        "body_summary": "To give a bit of context, I 25M bought a house conveniently/not next to my in laws. I've lived here over five years now. \n\nThree years ago, my co brother-in-law and my brother-in-law were talking about some jet ski's they had seen on Facebook market I was skeptical at first because they live in a townhome and I live in a house next to the townhomes.\n\nWell the next day after hearing them talk about it I came home from work to the jet ski's on a trailer sitting in my driveway no one asked me to store them there I head over to check them out since they were trying to find a good place for it and I walked up and let them know I personally didn't want them in my house 6 days out of the 7 especially over the winter.(living in Colorado and all)\n\nwell, it started a whole show of drama I got called...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 24,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-02T05:57:11.760872"
    },
    {
        "id": "1qtf4kr",
        "title": "AITA for not paying to have my partner's birthday gift professionally framed?",
        "url": "/r/AmItheAsshole/comments/1qtf4kr/aita_for_not_paying_to_have_my_partners_birthday/",
        "body_summary": "I gave me partner a painting for her birthday by one of her favorite artists. She already owns several pieces from this artist. \n\nA while back, the artist was having a sale and my partner mentioned she was thinking about buying one, but decided not to when she realized the price was in USD and not CAD, making it too expensive. I ended up buying the piece as a surprise for her birthday. It cost me about $1,400 CAD. \n\nAfterward, she told me that it would cost around $850 CAD to get the piece professionally framed. Apparently, this specific artwork required a special frame and glass to properly preserve it, which is also what the artist recommends. The pieces also tend to appreciate in value, so proper framing matters.\n\nMy partner is now upset because she feels that she's stuck paying for the...",
        "reddit_judgments": {
            "YTA": 18,
            "NTA": 36,
            "ESH": 4,
            "NAH": 13,
            "INFO": 10,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-02T05:57:20.092244"
    },
    {
        "id": "1qteb8i",
        "title": "AITA if I just tell my boyfriend if he wants food a certain way he should just cook it himself?",
        "url": "/r/AmItheAsshole/comments/1qteb8i/aita_if_i_just_tell_my_boyfriend_if_he_wants_food/",
        "body_summary": "I feel like I am being unreasonable because I know his response will be like \"seriously? you don't even make this tiny effort to make things like I want them?\" but it's not about that at all. I love making efforts to make him happy, I mean, shit, I clean the house all by myself every week just so he doesn't have to worry about that (we both work full-time, I just have a better schedule than he does, he clocks out at 7pm every week day and I at 5pm which means I always get home earlier and I just clean the house on fridays). We have the unspoken chores duties that is \"I cook, he cleans the dishes.\" But a lot of times, I also clean the dishes as I am cooking to take that load off of him as well. I just like to make him happy with stuff like this. It's less stuff he has to worry about and the...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 92,
            "ESH": 4,
            "NAH": 1,
            "INFO": 6,
            "TotalJudged": 107
        },
        "total_judged": 107,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-02T05:57:28.962423"
    },
    {
        "id": "1qtg3zn",
        "title": "AITA for canceling my nieces visitation because their mother doesnt hold up her end of the  deal?",
        "url": "/r/AmItheAsshole/comments/1qtg3zn/aita_for_canceling_my_nieces_visitation_because/",
        "body_summary": "My sister and I haven’t had the best relationship over the years. 2025 was the year we really bonded ever since we lost our mom 3 years ago. It’s been on and off for reasons that do not relate to this post so I’ll skip that, just had to put it out for a little context.\n\nShe has two kids, 5 and 3 years and she brings them to me sometimes when maybe she has to work or has somewhere to be. This arrangement started last year because of the “bond” we had and I never had a problem with it, I love the kids and they love me and she told me how much it really helped her live a little when I took the kids so I was happy to do it. I had no problem with this arrangement cus I work on appointment and I had no strong client base back then so I always had time whenever she dropped the kids and would not ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 30,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-02T05:57:36.737023"
    },
    {
        "id": "1qtffl7",
        "title": "AITA for refusing to babysit my roommate’s noisy toddler because it disrupts my work-from-home schedule?",
        "url": "/r/AmItheAsshole/comments/1qtffl7/aita_for_refusing_to_babysit_my_roommates_noisy/",
        "body_summary": "I (30F) live with a roommate who has a toddler. I work from home full time and have a very strict schedule with meetings and deadlines. Recently, my roommate has been asking me to watch their toddler during the day so they can run errands or have some free time.\n\nI’ve refused multiple times because the toddler is very loud and unpredictable, and watching them seriously disrupts my ability to focus and meet work commitments. I’ve offered to help out occasionally but made it clear that I can’t take on regular babysitting. My roommate says I’m being selfish and not a good friend for not helping more, especially since we share the apartment and they don’t have family nearby. AITA",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 88,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 89
        },
        "total_judged": 89,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-02T05:57:37.397588"
    },
    {
        "id": "1qtk8mh",
        "title": "AITAH for telling my girlfriend that she can take one of my cars out when she starts paying half the bills on them",
        "url": "/r/AmItheAsshole/comments/1qtk8mh/aitah_for_telling_my_girlfriend_that_she_can_take/",
        "body_summary": "I (19M) own two cars. One is winter-capable (AWD, winter tires, etc.), and the other absolutely is not it’s still on summer tires and basically unusable now that it’s cold. And icy outside\n\nWe’re currently dealing with winter temps around 7–20°F most days, so realistically only one car is safe to drive right now.\n\nMy girlfriend (19F) doesn’t own a car. Usually this isn’t a problem because we go places together such as university, errands, etc. But recently she asked if she could start taking my car out by herself when she needs to go places, since it’s getting really cold.\n\nI told her no.\n\nTo be clear, it’s not because I think she’s a bad driver or that she’s going to crash it. My reasoning is:\n\n\t•\tI want to have access to my own car in case something comes up unexpectedly\n\n\t•\tI’m paying 1...",
        "reddit_judgments": {
            "YTA": 27,
            "NTA": 59,
            "ESH": 4,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 94
        },
        "total_judged": 94,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-02T05:57:45.826421"
    },
    {
        "id": "1qtat80",
        "title": "AITA for kicking them out with no money?",
        "url": "/r/AmItheAsshole/comments/1qtat80/aita_for_kicking_them_out_with_no_money/",
        "body_summary": "I (24) organized a last-minute trip to Patagonia and invited a (24) friend to join me. I had booked a cabin and wasn’t keen on staying alone, so I had asked a few mates until Agustin was down to tag along. We didn’t make an itinerary, as he refused to meet up to chat beforehand. Throughout our time there, several incidents occurred that created significant tension. The most prominent was a planned 5-hour mountain trek. We got a very late start that afternoon because Agustin slept in all morning, despite our agreement to wake up early. He was in a cranky mood and refused to get up. In an effort to keep the peace and salvage the day, I prepared us breakfast.\n\nWhen we finally arrived at the trailhead, Agustin got cold feet after a stranger warned us not to start so late. To address his concer...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 6,
            "ESH": 3,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-02T05:57:53.251575"
    },
    {
        "id": "1qti1r4",
        "title": "AITA for being upset that my bf didn’t want to drive to my house",
        "url": "/r/AmItheAsshole/comments/1qti1r4/aita_for_being_upset_that_my_bf_didnt_want_to/",
        "body_summary": "I slept at my boyfriends house last night, and before he picked me up he asked me to bring my laptop because he wanted to play a game with me. The next morning, he drove me home and as soon as I got in the door I realized I forgot my laptop at his house. I called him quickly and asked if he could bring me my laptop from his house because I had work for class that I needed to do. He said no, and that he was tired and that he already drove me home so he wasn’t willing to drop off my laptop. For context, he only lives 10-15 mins away from my house, so it’s not like the drive is long. Even though he said he was tired, I knew he was going out to see his friends later so that didn’t really make sense to me. He said I could bus to get it, but that would take me about an hour or so (2 hours there ...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 23,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-02T05:58:00.838294"
    }
]