[
    {
        "id": "1qu17kl",
        "title": "AITA for telling my sister you are selfish and canceling her engagement dinner at my place",
        "url": "/r/AmItheAsshole/comments/1qu17kl/aita_for_telling_my_sister_you_are_selfish_and/",
        "body_summary": "I have a younger sibling and it seems like I am always helping her. In college I would help her with essays. I would listen to her problems, if she got stuck somewhere I would go and pick her up . She is 24 now and it is got pretty clear that she doesn’t reciprocate helping out. Or does any  favors for family\n\n\n\nMy brother and I have both noticed it. I had a conversation with her about it and she said she would do better.\n\n\n\nRecently she asked if I could use my house to her engagement dinner and I agreed. It was a big favor in my opinion and I have been helping plan it.\n\n\n\nMy sister lives very close to my kids daycare. I left work and on the way home there was a huge crash on the highway. I wasn’t moving at all ( it took me 4 hours to get to home ). My husband was also stuck in it.  The da...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 151,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 152
        },
        "total_judged": 152,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-03T05:43:02.488796"
    },
    {
        "id": "1qtx6k6",
        "title": "AITA for telling my sister that our bio dad isn’t my dad and and if she can’t accept  that maybe she isn’t my sister either",
        "url": "/r/AmItheAsshole/comments/1qtx6k6/aita_for_telling_my_sister_that_our_bio_dad_isnt/",
        "body_summary": "My bio dad has been dead since I was a baby. I have zero memories of him and for a good amount of my childhood I had no father figure. Sure my mom and my siblings told me stories about him but that isn’t the same as actually knowing someone.\n\nWhen I was eleven my mom married Jim ( fake name). He became my father figure while my sister only tolerate him. This is when my relationship with my sister and I started to fall apart. \n\nShe has always been mad about me replacing “dad”.  She would make me feel bad about thinking as him as my father figure and that I was betraying “bio dad”\n\nOur relationship got better after she went to college. The issue is I was looking through old photos with my mom and we saw a few of my bio dad at a themed park with my siblings.\n\nApparently before he died he woul...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 87,
            "ESH": 28,
            "NAH": 5,
            "INFO": 2,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-03T05:43:12.585271"
    },
    {
        "id": "1quf0az",
        "title": "AITA for giving my coworker food she is \"allergic\" to?",
        "url": "/r/AmItheAsshole/comments/1quf0az/aita_for_giving_my_coworker_food_she_is_allergic/",
        "body_summary": "(Throwaway account)\n\nI (31M) work in a small office with about 20 employees. It's not uncommon for people to bring in homemade snacks to share with everyone. One of my coworkers (\"Tina\" 24F) claims she is allergic to white eggs, but that brown eggs are fine, and always asks people who bring in food what kind of eggs they used. When she first mentioned her allergy to me, I pointed out that there's no nutritional difference between white and brown eggs, and that her \"allergy\" was likely just a coincidental bad experience with white-shelled eggs. She not only *insisted* that she is *deathly* allergic to white eggs, but another coworker of ours (\"Sara\" 23F) overheard this and rounded on me, saying that just because there's no \"nutritional difference\" doesn't mean that there's no difference, or...",
        "reddit_judgments": {
            "YTA": 67,
            "NTA": 63,
            "ESH": 24,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 156
        },
        "total_judged": 156,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-03T05:43:23.436587"
    },
    {
        "id": "1qtsvdp",
        "title": "AITA for refusing to let my mom stay with me in Canada even if she shows up anyway?",
        "url": "/r/AmItheAsshole/comments/1qtsvdp/aita_for_refusing_to_let_my_mom_stay_with_me_in/",
        "body_summary": "I (30s M) live in Canada. I went no contact with my mom (60s F) a few months ago after years of ongoing family issues. Recently things escalated badly.\n\nContext: my mom lives in the Philippines. I previously sponsored her under a parent super visa so she could visit Canada. During her last visit, we fought constantly. She kept saying I don’t spend enough time with her, that I go out too much, and that I prioritize my partner over her. At the time, I was (and still am) in a serious long-term relationship.\n\nShe repeatedly said she wanted to move in with me permanently because she’s getting old and “doesn’t know where to go.” I told her clearly that my partner would not be comfortable living with another person, especially long-term. My apartment is small, and we planned it as a space for jus...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 48,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-03T05:43:31.575398"
    },
    {
        "id": "1qu42vz",
        "title": "AITA for not allowing my dad and sister to live with us after I just had a baby and their home was ruined by a neighbor's house fire?",
        "url": "/r/AmItheAsshole/comments/1qu42vz/aita_for_not_allowing_my_dad_and_sister_to_live/",
        "body_summary": "To start, I needed to escape from living with my dad and sister many years ago. I moved in with my boyfriend (now husband) in college ten years ago. They're irresponsible, siphon money, and don't take care of anything. My sister is a narcissist, and I have been in therapy for years.\n\nI had a baby recently and I'm writing this post on 3 hours of sleep. I'm exhausted and burned out. I'm a working mom, my husband works too, and we're still in survival mode.\n\nTheir neighbor's house caught fire and burned to the ground. My dad and sister's home was close - the siding melted, windows cracked, blinds melted, inside smells like smoke. No one was hurt. My dad and sister still have their belongings. Utilities are off and insurance companies are looking into everything. No clue how long this will tak...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 67,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 71
        },
        "total_judged": 71,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-03T05:43:39.592330"
    },
    {
        "id": "1qty0qc",
        "title": "AITA for not deleting my ao3 account against my parents wishes",
        "url": "/r/AmItheAsshole/comments/1qty0qc/aita_for_not_deleting_my_ao3_account_against_my/",
        "body_summary": "So, I (14) write fan fiction for fun in a fandom Im in. My parents were somewhat aware of this, as well as my sister (16). However, my sister and her friends snooped through my ao3, against my personal boundaries. In fact, she’s never really respected my privacy and boundaries, and when she decided to snoop through my discord bio one day, she found the link to my ao3. I’ve told her that I’d rather she didn’t read it since it would make me uncomfortable and it’s more of a private hobby. However, she did do it anyways, with her friends. She then told my parents about it, saying that it would be a bad look for future employers and fellow classmate if they found out. However, i not only use a private email for my ao3 that is in no way connected to my personal information, i don’t tell people i...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 73,
            "ESH": 1,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-03T05:43:48.257529"
    },
    {
        "id": "1qu1rx8",
        "title": "AITA for my productivity/behaviour becoming affected after my friend installed home security cameras?",
        "url": "/r/AmItheAsshole/comments/1qu1rx8/aita_for_my_productivitybehaviour_becoming/",
        "body_summary": "I (24M) moved into my good friend’s (39M) house and we’ve been living together for 3 years. We’re not partners. I don’t work on account of a stressful degree, but the house is paid off and he makes enough for bills, so I buy groceries, do chores/cook, so I’m home often when not in class.\n\n2 years ago, he bought a doorbell camera and security cameras for the sides and back of the house plus window/door sensors for security and to monitor his dog who sometimes escapes the yard. Fine. \n\nBut soon after, he wanted security cameras **in** the house. He claimed it was to monitor the dog’s mischief. They’d be in the entryway, living room, and hallway (which points at our bedrooms and bathroom).\n\nI said I was opposed. I didn’t see the point of internal cameras when the outside was covered already. ...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 70,
            "ESH": 3,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 88
        },
        "total_judged": 88,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-03T05:43:56.438230"
    },
    {
        "id": "1quhhpk",
        "title": "AITA for telling my friend our husbands spent the day at the strip club?",
        "url": "/r/AmItheAsshole/comments/1quhhpk/aita_for_telling_my_friend_our_husbands_spent_the/",
        "body_summary": "I (36F) am 5 months postpartum. My husband (34 M) and I welcomed our son last fall after years of infertility and multiple rounds of IVF. While becoming a mom has been an incredible joy it has also been physically and emotionally exhausting. I do most of it on my own as my husband works out of town 2 weeks on and 2 weeks off. I had a c section and have honestly just struggled with recovery and PP mental health. Our baby had severe reflux hated being put down and would only sleep in short stretches. When my husband is home, I have asked him to help more so I can recover. Instead,  his time often goes elsewhere but honestly that is a story for a different post. \nToday my husband had plans to go to the shooting range with his friend. He left before I was even awake. At 12:50 pm I checked his ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 50,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-03T05:44:05.117645"
    },
    {
        "id": "1qtzrq7",
        "title": "WIBTAH for \"living a lie\" and deceiving my parents until I can escape this country in 2028?",
        "url": "/r/AmItheAsshole/comments/1qtzrq7/wibtah_for_living_a_lie_and_deceiving_my_parents/",
        "body_summary": "I (M23) have been living a lie since 2024; I’ll be living it until 2028.\n\nI was born & raised in a muslim country, and two years ago I came to a conclusion that there is no sky daddy who is constantly keeping an eye on us. But the thing is I can't tell or even hint about my apostasy to anyone here, because of blasphemy laws which mandate life or death sentence. Although apostasy itself is not a crime but it comes under the broader definition of blasphemy laws. But before I get to the legal prosecution/persecution, if people around me got a whiff of me being an apostate, i will face ostracization from my family, potential mob lynching me to death because i will be a walking ticket to heaven for these people.\n\nI was introverted and asocial even before my apostasy, but now it's weighing upon ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 52,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-03T05:44:13.149241"
    },
    {
        "id": "1qube16",
        "title": "AITA for not helping my stepchild anymore?",
        "url": "/r/AmItheAsshole/comments/1qube16/aita_for_not_helping_my_stepchild_anymore/",
        "body_summary": "I (44) married my husband (47) over 15 years ago. We both came into the marriage with 2 kids each, his oldest is 29 now I will call him Jim. Jim and his wife Joy had a set of twins almost 2 years ago the babies ended up spending about 6 months in the NICU a little over an hour way from home. Jim and Joy also have 3 older kids, while Joy spent her days and nights with the babies. I would go over and see her and the babies, we also kept the older kids a few times. When the babies came home I started taking Joy and the babies to their doctor’s appointments because Joy is not comfortable driving on the interstate. I have been doing this for about 18 months, I never ask for gas money. In August my son, Teddy (20), moved to the city where we take the babies to the doctors. One of their appointme...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-03T05:44:21.034454"
    }
]