[
    {
        "id": "1o5byxt",
        "title": "AITA for refusing to get a second job?",
        "url": "/r/AmItheAsshole/comments/1o5byxt/aita_for_refusing_to_get_a_second_job/",
        "body_summary": "OP's husband's business failed, leaving them financially strained. OP wants him to get a job, but he resists. SIL says OP should get a second job instead. OP refuses, leading to arguments and feeling unsupported. AITA for expecting him to work?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 130,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-14T05:10:58.567365"
    },
    {
        "id": "1o5d303",
        "title": "AITA for packing something I shouldn't have when I helped my friend move?",
        "url": "/r/AmItheAsshole/comments/1o5d303/aita_for_packing_something_i_shouldnt_have_when_i/",
        "body_summary": "OP helped a friend move, packing a closet as requested. The friend blames OP for packing the landlord's thermostat, implying OP should've known it wasn't his. OP offered to install it if mailed, but the friend attributed the mistake to OP's ADHD. AITA for packing the thermostat?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 123,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 125
        },
        "total_judged": 125,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-14T05:11:00.574033"
    },
    {
        "id": "1o5i8os",
        "title": "AITA for causing a scene at my in-laws' anniversary dinner over my brother-in-law's racist comments?",
        "url": "/r/AmItheAsshole/comments/1o5i8os/aita_for_causing_a_scene_at_my_inlaws_anniversary/",
        "body_summary": "OP asked her husband to stop his brother Mark's racist remarks, especially around their son. At a family dinner, Mark made offensive comments; the husband did nothing. OP angrily told Mark to \"shut the f\\*\\*\\* up\". Now her MIL is angry. AITA?\n...",
        "reddit_judgments": {
            "YTA": 19,
            "NTA": 82,
            "ESH": 21,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 127
        },
        "total_judged": 127,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-14T05:11:04.375552"
    },
    {
        "id": "1o5ue95",
        "title": "AITA for finally asking for the apartment back after my niece’s “temporary” stay turned into four years?",
        "url": "/r/AmItheAsshole/comments/1o5ue95/aita_for_finally_asking_for_the_apartment_back/",
        "body_summary": "OP lives with parents, sister, and niece in their house. Niece occupies OP's intended apartment. After years of waiting, OP asked niece to move out and requested a warning before a specific person is brought over. Family is angry at OP. AITA?\n...",
        "reddit_judgments": {
            "YTA": 27,
            "NTA": 61,
            "ESH": 16,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-14T05:11:07.716073"
    },
    {
        "id": "1o5tk9k",
        "title": "AITA? I let me child watch K Pop Demon Hunters",
        "url": "/r/AmItheAsshole/comments/1o5tk9k/aita_i_let_me_child_watch_k_pop_demon_hunters/",
        "body_summary": "I let child (in grade 1) watch K Pop Demon Hunters. My child has watched at both my house and her my co-parent (ex’s), house and with multiple family members.\n\nThis morning my ex flipped out demanding that our child should not be watching anymore because she found the lyrics in 1 song (How it’s done) questionable.\n\nThe movie is rated PG. I said my child would be allowed to watch with me.",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 120,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 123
        },
        "total_judged": 123,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-14T05:11:10.325073"
    },
    {
        "id": "1o5dwoo",
        "title": "AITA for getting mad at my parents for using the money my grandma gave me for graduation?",
        "url": "/r/AmItheAsshole/comments/1o5dwoo/aita_for_getting_mad_at_my_parents_for_using_the/",
        "body_summary": "OP's grandma gave her $1.4k as graduation gift via OP's dad, who spent it. OP asked for the money; dad refused. They fought. Parents feel OP is ungrateful. OP feels betrayed. AITA?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 63,
            "ESH": 4,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 76
        },
        "total_judged": 76,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-14T05:11:12.667521"
    },
    {
        "id": "1o636zy",
        "title": "AITA for telling my coworker I'm not surprised his wife divorced him.",
        "url": "/r/AmItheAsshole/comments/1o636zy/aita_for_telling_my_coworker_im_not_surprised_his/",
        "body_summary": "OP (20F) told her coworker (40M) she wasn't surprised about his divorce, given his gaming habits over his wife. He complained, dividing coworkers. AITA?\n...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 57,
            "ESH": 5,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 75
        },
        "total_judged": 75,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-14T05:11:13.970941"
    },
    {
        "id": "1o5dduh",
        "title": "AITA Am I the bad guy for yelling at my parents and telling them that they lost the little trust I had in them?",
        "url": "/r/AmItheAsshole/comments/1o5dduh/aita_am_i_the_bad_guy_for_yelling_at_my_parents/",
        "body_summary": "OP, 22, living with parents, lent them their phone. Parents secretly installed parental controls due to kidnapping fears & homophobia. OP yelled when their university email was affected. Now parents are upset. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 34,
            "ESH": 3,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-14T05:11:16.011687"
    },
    {
        "id": "1o5nifk",
        "title": "AITA for asking my husband to cancel our anniversary trip to Everest?",
        "url": "/r/AmItheAsshole/comments/1o5nifk/aita_for_asking_my_husband_to_cancel_our/",
        "body_summary": "OP's husband booked an Everest Base Camp hike for their anniversary, despite not being an experienced hiker. OP researched and, concerned about safety & her husband's discomfort (food, camping), showed him videos of hiking dangers. He's hurt by her reaction and sees it as insulting his planning. AITA for questioning the trip?\n...",
        "reddit_judgments": {
            "YTA": 47,
            "NTA": 43,
            "ESH": 15,
            "NAH": 16,
            "INFO": 3,
            "TotalJudged": 124
        },
        "total_judged": 124,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-10-14T05:11:19.876250"
    },
    {
        "id": "1o60xjb",
        "title": "AITA for telling my mum to grow up after she took my laptop for \"staying up past 12\"",
        "url": "/r/AmItheAsshole/comments/1o60xjb/aita_for_telling_my_mum_to_grow_up_after_she_took/",
        "body_summary": "so i had a day off and i came home from college to see my mum and since it was the weekend at the time  and im more than over age to have a bed time i stayed down stairs drinking watching tv, ect then she came storming down shouting how she is disapointed in me and she unplugged the tv and took my laptop and told me to get some sleep and slamed the door so as the next day came along it was quiet so i broke it and told her that she has to grow up and get a grip then she said to me that when ever i stay with her i need to hand my things in at 10 pm so i grabbed my stuff and left and now im writing this im thinking why dont parents act like they were ever my age like shes told me shes done worce things when she was younger than me than playing fn at 12 30 pm at 19 years of age",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 21,
            "ESH": 6,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-14T05:11:20.348420"
    }
]