[
    {
        "id": "1lnk4uu",
        "title": "AITA for asking my sister-in-law to rub sunscreen on my back when I have back acne ?",
        "url": "/r/AmItheAsshole/comments/1lnk4uu/aita_for_asking_my_sisterinlaw_to_rub_sunscreen/",
        "body_summary": "OP (31f) asked her brother's wife (SIL) to apply sunscreen to her back, which has acne. Brother confronted OP, saying SIL has social anxiety, can't say no, and felt uncomfortable touching \"diseased skin.\" Brother called OP inconsiderate. AITA?\n...",
        "reddit_judgments": {
            "YTA": 74,
            "NTA": 34,
            "ESH": 9,
            "NAH": 6,
            "INFO": 5,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-06-30T05:14:32.125513"
    },
    {
        "id": "1ln8fr0",
        "title": "AITA for not letting my sister bring her boyfriend to my wedding?",
        "url": "/r/AmItheAsshole/comments/1ln8fr0/aita_for_not_letting_my_sister_bring_her/",
        "body_summary": "OP banned her sister's boyfriend, Jake, from her wedding due to his history of rude, disruptive behavior. Sister refuses to attend without him, threatening their relationship. OP asks if she's wrong to prioritize a drama-free wedding over her sister's presence.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 136,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 138
        },
        "total_judged": 138,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-30T05:14:36.218226"
    },
    {
        "id": "1lns0j2",
        "title": "AITA for only paying for my pregnant sisters meals when I can verify them?",
        "url": "/r/AmItheAsshole/comments/1lns0j2/aita_for_only_paying_for_my_pregnant_sisters/",
        "body_summary": "OP's sister is pregnant and asks for money. OP worries money might indirectly fund her boyfriend's drug habit (selling & use). OP offers to directly pay for food instead, which sister often refuses. AITA for being too strict with financial help?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 68,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 75
        },
        "total_judged": 75,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-30T05:14:38.068732"
    },
    {
        "id": "1lnh2xr",
        "title": "WIBTA for spending my birthday gift card the way I want instead of using it with my MIL?",
        "url": "/r/AmItheAsshole/comments/1lnh2xr/wibta_for_spending_my_birthday_gift_card_the_way/",
        "body_summary": "My MIL had told me that she wanted to take me to a create-your-own fragrance shop for my birthday as a cute thing for us to do. I loved the idea and was super down to do it! A few days later, I get an email from her with a Sephora gift card instead. No big deal at all as I love Sephora and had already built a cart of things I’ve been needing to restock on, so this gift card is perfect! The issue is that she messaged me saying she wants to go to Sephora together to get a makeover and sent me a link of a few of the options and their associates costs. I don’t want a makeover lol and would rather spend the gift card on the items in my cart.\n\nWIBTA if I tell her I’m not interested in the makeover and just want to use the gift card for the things I actually need/want?",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 16,
            "ESH": 0,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-30T05:14:39.165912"
    },
    {
        "id": "1ln7fa9",
        "title": "AITA? Struggling woman!?!",
        "url": "/r/AmItheAsshole/comments/1ln7fa9/aita_struggling_woman/",
        "body_summary": "OP & cousin received necklaces \"for each other\" chosen by themselves. Cousin demanded OP exchange after finding OP's gift \"better\". OP refused, wants to keep the necklace they picked. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 52,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-30T05:14:40.519467"
    },
    {
        "id": "1lnjs6i",
        "title": "AITA for telling my parents they are no longer allowed to stay at my house?",
        "url": "/r/AmItheAsshole/comments/1lnjs6i/aita_for_telling_my_parents_they_are_no_longer/",
        "body_summary": "OP's UK parents visit yearly for a month each, expecting free lodging/care. OP dislikes their presence due to a stressful upbringing. Dad's car died, OP refused hers. They claim limiting visits equals barring access to grandkids. OP feels exhausted and wants them to stay elsewhere, questioning if AITA.\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 41,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 46
        },
        "total_judged": 46,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-30T05:14:42.204338"
    },
    {
        "id": "1lnhlu5",
        "title": "AITAH for telling my wife, she may need to take an Uber from the airport.",
        "url": "/r/AmItheAsshole/comments/1lnhlu5/aitah_for_telling_my_wife_she_may_need_to_take_an/",
        "body_summary": "My wife is working out of town in California. She is flying back to the Midwest on the Fourth of July when one of my kids is having family over for the Fourth of July. I told her that I wasn’t sure what we would be doing at 3:30 PM and she may need to take an Uber. She’s upset that I don’t want to go pick her up with a 40 minute drive each way when she could easily take an Uber. \n\nA point of context, I take an Uber to and from the airport for work every other week for my travel. It is paid for by my work, but hers is not.  But the cost is not an issue.  \n\n",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 65,
            "ESH": 0,
            "NAH": 11,
            "INFO": 3,
            "TotalJudged": 96
        },
        "total_judged": 96,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-30T05:14:44.767629"
    },
    {
        "id": "1lnntzs",
        "title": "AITA for blowing up at my brothers over a $13 Mother’s day gift?",
        "url": "/r/AmItheAsshole/comments/1lnntzs/aita_for_blowing_up_at_my_brothers_over_a_13/",
        "body_summary": "OP planned a Mother's Day surprise. Brothers agreed to contribute, but OP received money from Mom's boyfriend to cover the expenses. Brother asked for \"leftover\" money. OP refused, a fight ensued where she criticized their financial irresponsibility. AITA for her reaction?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 21,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-30T05:14:45.896870"
    },
    {
        "id": "1lnfkkx",
        "title": "AITA for wearing the same shirt to two different events a few days apart",
        "url": "/r/AmItheAsshole/comments/1lnfkkx/aita_for_wearing_the_same_shirt_to_two_different/",
        "body_summary": "OP wore the same shirt to nephew's 2nd party. SIL flipped out, barring entry. Bro called, upset OP didn't attend. AITA for re-wearing the shirt?\n...",
        "reddit_judgments": {
            "YTA": 23,
            "NTA": 17,
            "ESH": 6,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 51
        },
        "total_judged": 51,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-06-30T05:14:48.242559"
    },
    {
        "id": "1lnhnrl",
        "title": "AITA For Refusing To Give My Stuff To My Sister?",
        "url": "/r/AmItheAsshole/comments/1lnhnrl/aita_for_refusing_to_give_my_stuff_to_my_sister/",
        "body_summary": "OP (13-16M) got a purple fidget at a party his sister (12F) attended as a friend. She wanted it because purple is her favorite color. The host threatened to kick them out unless OP gave it to her. OP refused out of spite & they were kicked out. AITA?\n...",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 16,
            "ESH": 14,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-06-30T05:14:49.721601"
    }
]