[
    {
        "id": "1qcs4o6",
        "title": "AITA for calling out a line-cutter at Costco",
        "url": "/r/AmItheAsshole/comments/1qcs4o6/aita_for_calling_out_a_linecutter_at_costco/",
        "body_summary": "I was at Costco and had just finished checking out when I realized I’d picked up the wrong item. I headed over to the supervisors' desk and waited behind a gentleman who was already there. A couples minute later, a woman nudged in front of my cart, giving me an unapologetic wave. 'I'll be quick, I just have a question,' she said.\n\nI didn't hold back. 'I don't give a shit. Wait in line,' I told her. She looked at me like I was an alien and told me I was being incredibly rude. I followed up with: 'Fine, pretty fucking please then. I also have a question, what makes yours more important than mine?'\n\nWhen I went home and told my wife, she said I overreacted and in retrospect, I shouldn't have cursed but I don't regret calling her out.",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 131,
            "ESH": 19,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 157
        },
        "total_judged": 157,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-15T05:18:48.310357"
    },
    {
        "id": "1qcoz83",
        "title": "AITA for leaving the house to stay with my boyfriend after my sister forced me to take care of her child?",
        "url": "/r/AmItheAsshole/comments/1qcoz83/aita_for_leaving_the_house_to_stay_with_my/",
        "body_summary": "Me (20F) and I do not like kids. I never have I do not enjoy taking care of them playing with them or being responsible for them I have always been clear about this with my family.\nMy sister ( 31F) has a daughter(5m) I love her but loving someone does not mean I want to be a caregiver to the most thing i hate.\n\nA few months ago my sister started asking me to help her with her daughter. at first it was small things watching her for an hour staying with her while my sister ran errands .I did not love it but I agreed because I felt pressured.\n\nSlowly it turned into more and more I was expected to babysit multiple days a week for hours I had to feed her play with her help her shower and put her to sleep My sister never asked anymore she just assumed I would do it and yell at me when i dont.\n\nW...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 131,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-15T05:19:05.633477"
    },
    {
        "id": "1qcitks",
        "title": "AITA for telling my boyfriend not to treat me like his secretary",
        "url": "/r/AmItheAsshole/comments/1qcitks/aita_for_telling_my_boyfriend_not_to_treat_me/",
        "body_summary": "This morning, as my boyfriend was getting ready to leave for work, he asked me a succession of questions (Do you have a USB-C cable I can borrow? What am I cooking tonight? Do we have beef? Is it going to rain today?). He was in a rush and I was having breakfast at the table, from where I can reach the under-counter fridge. After the ‘do we have beef’ question, I just shrugged like I didn’t know and opened the fridge so he could see inside. He went ‘okay, cool’ from across the table and then asked me about the weather. I said ‘I don’t know, I’m not your Siri.’ \n\nHe went ‘I’m just asking you a question’ and I went ‘You’ve asked me lots of questions’ and then something like ‘people ask their mom or their secretary things like this’. He got annoyed and said I was being weird, then left saying...",
        "reddit_judgments": {
            "YTA": 19,
            "NTA": 54,
            "ESH": 4,
            "NAH": 4,
            "INFO": 0,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-15T05:19:23.080728"
    },
    {
        "id": "1qcqjw8",
        "title": "AITA for locking the bathroom door with a chair?",
        "url": "/r/AmItheAsshole/comments/1qcqjw8/aita_for_locking_the_bathroom_door_with_a_chair/",
        "body_summary": "I(18m) live in a one bathroom household with my family and they all have a bad habit of opening the bathroom door even though someone is clearly using it. It’s gotten to the point where ive been avoiding using it during times when my family is getting ready to go somewhere (school,work,etc) because EVERYONE uses it to get ready. They also have a weird logic that because we’re family, walking in or getting walked in on is no big deal but im the only one who doesn’t agree with this in my house, so i lock the door but since its an older house, the knob will lock but its not locked into the frame, so when im using the bathroom, good chance they just fidget with the door handle then pop the door open like im not sitting on the toilet which pisses me off. The other day, i broke my self made rule...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 60,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-15T05:19:39.065239"
    },
    {
        "id": "1qcm82v",
        "title": "AITA for asking my mum to stop moving my things around and talking about the \"safety\" of my new place?",
        "url": "/r/AmItheAsshole/comments/1qcm82v/aita_for_asking_my_mum_to_stop_moving_my_things/",
        "body_summary": "Invited my mum round to stay at my (just moved in) basement apartment, pretty much the from the second she got here, she couldn't stop moving things around, desks, unpacking things, putting them in the shelves, trying to organise things a certain way etc.\n\nI told her please don't do that many times and to stop it, it's my place and I will unpack everything when ready and how I like, she said she's only trying to help get me organised (just moved in) I repeated this many times, she kept doing it, kept doing it.\n\nShe then said its not very secure in here, criticising the windows, saying they don't lock properly, I do agree the windows could be a bit better, they don't have a key lock feature from the inside, but they can't be opened from the outside if that makes sense, it's like those windo...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 33,
            "ESH": 1,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-15T05:19:54.613024"
    },
    {
        "id": "1qcuojo",
        "title": "AITA For wanting to get wings on my bday?",
        "url": "/r/AmItheAsshole/comments/1qcuojo/aita_for_wanting_to_get_wings_on_my_bday/",
        "body_summary": " My girlfriend (F21) asked what I wanted to do for my 25th birthday and offered to treat me to dinner. She also invited her parents since they were both off. Initially, I said I wanted to try something new, but after looking at a few spots, I wasn’t feeling any of them. I decided to stick with my two safe options: sushi or wings.\n\nSince her parents work at a sushi bar and she doesn't like sushi, I opted for wings at Buffalo Wild Wings\nShe immediately pushed back, asking, 'But you've had that before; don't you want something new?' I told her I genuinely just wanted wings. She started sending links to other places, insisting she wanted something with rice and chicken. When I told her I wasn't interested, she got mad, called me a 'brat' and 'ungrateful,' and even accused me of trying to manip...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 62,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-15T05:20:10.451419"
    },
    {
        "id": "1qcnr50",
        "title": "AITA for spending a long time at a party teaching another person how to pronounce my name.",
        "url": "/r/AmItheAsshole/comments/1qcnr50/aita_for_spending_a_long_time_at_a_party_teaching/",
        "body_summary": "I’m from country A she is from country B, and we met in country C in a program for foreigners that are in C to learn and or improve their C language skills.\n\nThe language program organized a party for all participants, and we were all wearing name tags with our names and all the languages, one speaks, on them.\n\nSo, this girl comes up to me and asks: “Is your name pronounced ‘her country’s pronunciation of my name 1’ or ‘her country's pronunciation of my name 2’”  \nAnd I tell her I’m fine with either or she can call me ‘my name as pronounced in C by the instructors’.\n\nThe thing is. Ich have a name that is kind of challenging in an international context.   \n3-4 syllables depending on the language  \nBeginning and ending with letters that are not spoken in all languages and another one in the ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 21,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-15T05:20:26.033476"
    },
    {
        "id": "1qck8yq",
        "title": "AITAH for not wanting my mum to live with me again",
        "url": "/r/AmItheAsshole/comments/1qck8yq/aitah_for_not_wanting_my_mum_to_live_with_me_again/",
        "body_summary": "For context, mum left a toxic 14 year relationship. Me, my partner and sister were in a 4 bedroom rental so we had the space for her and we took her in. Mums old house was a drinking house, so when she moved in with us we only had 2 rules for her. No partys here and no bringing her ex around.\n\nIn the beginning everything was fine, mum was helping out cooking, cleaning, paying her $100 a week for board and doing well. Couple months in she starts acting up, her room smells, she stops cooking, stops buying food, starts going to families houses complaining that she’s bored here, that she always has to look after the dogs and she can’t go anywhere or do anything because of it. (She doesn’t even have a car or a job)\n\nMums ex gets engaged to another women but they’re still in contact calling each...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 15,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 15
        },
        "total_judged": 15,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-15T05:20:41.497880"
    },
    {
        "id": "1qcmpie",
        "title": "AITA For intentionally not picking up my “friends” call",
        "url": "/r/AmItheAsshole/comments/1qcmpie/aita_for_intentionally_not_picking_up_my_friends/",
        "body_summary": "This happens very frequent but I’m only now speaking about it to someone else. I texted my friend tonight around 9-10 PM because we haven’t talked all day,just with a normal convo. Right after my text she then called me 5 times through FaceTime while we were texting,still telling me to pick up the phone. She called me a few times through a text now number,I’m assuming she thought I’d pick up a random number over hers. Then went back to spam FaceTime calling me,and still constantly texting me to pick up the whole time. Sometimes I am straight up and say I don’t want to be on the phone at the moment,just don’t feel like it but nothing personal,unfortunately she always takes it fully personal then gets an attitude expecting me to call back after I see that she’s mad,and I just didn’t feel lik...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 15,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 19
        },
        "total_judged": 19,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-15T05:20:57.056824"
    },
    {
        "id": "1qctzei",
        "title": "AITA for telling my mother to stop telling me about her problems",
        "url": "/r/AmItheAsshole/comments/1qctzei/aita_for_telling_my_mother_to_stop_telling_me/",
        "body_summary": "Okay so for context my mom has been under a lot of stress the last 2 years because of my sister (F19) Long story short, my sister was in a VERY toxic and abusive relationship, and my mom and sister always had a rocky relationship. I was always the mediator between them. \n\nThe ONLY thing my mom talks about with me is related to her. Even my sister’s issues with not going to work…etc I tried to really support my mom in the beginning. But I am in a difficult situation because my mom antagonizes my sister and vice versa.\n\nBut also, I have my own issues, and whenever I try to talk about anything other than my sister with my mom. Like what movie we could watch, she’s totally disengaged from the conversation and redirects it towards my sister.\n\nIn one of these occasions, I told her to stop talkin...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 8,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 8
        },
        "total_judged": 8,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-15T05:21:12.753422"
    }
]