[
    {
        "id": "1llr6al",
        "title": "AITA for not sharing my groceries just because we live together?",
        "url": "/r/AmItheAsshole/comments/1llr6al/aita_for_not_sharing_my_groceries_just_because_we/",
        "body_summary": "I (31M) rent a flat with two other guys. We all agreed we’d buy our own groceries and label stuff.\n\nOne of them keeps “accidentally” using my stuff milk, eggs, even my coffee. He always says “I’ll replace it,” but rarely does. I stopped saying anything and just started moving my stuff into my room mini fridge.\n\nNow he’s calling me petty and says I’m “killing the vibe.” But I’m not his parent.\n\nAITA for being territorial about my food in a shared house?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 134,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-28T05:11:53.472228"
    },
    {
        "id": "1llsd9n",
        "title": "AITA for picking a dinner my girlfriend didn’t like while playing a game?",
        "url": "/r/AmItheAsshole/comments/1llsd9n/aita_for_picking_a_dinner_my_girlfriend_didnt/",
        "body_summary": "OP and GF played a game deciding dinner via rock paper scissors. OP won entree, chose frozen pizza, which GF dislikes. GF refused to eat it, despite the game's rules. OP wonders if he's TA for choosing pizza she dislikes after winning the game.\n...",
        "reddit_judgments": {
            "YTA": 16,
            "NTA": 95,
            "ESH": 12,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 127
        },
        "total_judged": 127,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-28T05:11:58.166781"
    },
    {
        "id": "1lm5b47",
        "title": "AITA for telling my daughter she needs to grow up, and apolgize to her sister",
        "url": "/r/AmItheAsshole/comments/1lm5b47/aita_for_telling_my_daughter_she_needs_to_grow_up/",
        "body_summary": "OP's daughter Sofia reacted badly to Julie asking their stepfather, Jim, to give her away at her wedding, accusing Julie of replacing their deceased father. OP told Sofia to apologize and grow up. Sofia blamed OP's remarriage and is now NC. AITA?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 94,
            "ESH": 3,
            "NAH": 6,
            "INFO": 4,
            "TotalJudged": 111
        },
        "total_judged": 111,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-28T05:12:01.408637"
    },
    {
        "id": "1llsbiv",
        "title": "AITA for refusing to continually pay for both tickets when my friend is getting the hotel for free?",
        "url": "/r/AmItheAsshole/comments/1llsbiv/aita_for_refusing_to_continually_pay_for_both/",
        "body_summary": "OP (38F) and Laura (42F) attend shows, staying in a hotel via Laura's mom's points. OP always buys both tickets. OP asked Laura to split ticket costs, feeling it's unfair. Laura refused, ending the trip. AITA?\n...",
        "reddit_judgments": {
            "YTA": 18,
            "NTA": 95,
            "ESH": 6,
            "NAH": 9,
            "INFO": 7,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-28T05:12:05.669580"
    },
    {
        "id": "1lm4etm",
        "title": "AITA? A prior tenant keeps showing up to my home banging on the door and honking....",
        "url": "/r/AmItheAsshole/comments/1lm4etm/aita_a_prior_tenant_keeps_showing_up_to_my_home/",
        "body_summary": "OP moved, gets prior tenant's mail, returns it. Tenant harassed OP for mail and a missing package, even after OP contacted police. OP hid, called police again when she returned. AITA for ignoring her, not handing over the mail, not responding on Facebook, and calling the police?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 38,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-28T05:12:07.649891"
    },
    {
        "id": "1lm814y",
        "title": "AITA: For telling my boyfriend no to an invitation to an all-inclusive resort (getting engaged) because his mom will be there.",
        "url": "/r/AmItheAsshole/comments/1lm814y/aita_for_telling_my_boyfriend_no_to_an_invitation/",
        "body_summary": "OP doesn't want BF to propose on vacation with his mom. BF insists, citing desire for an \"extravagant\" proposal, despite her preference for a private moment. OP offered alternatives (pre-vacation proposal, skipping the trip). Now BF is upset. AITA for not wanting to go if he proposes there?\n...",
        "reddit_judgments": {
            "YTA": 16,
            "NTA": 71,
            "ESH": 9,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 99
        },
        "total_judged": 99,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-28T05:12:10.588366"
    },
    {
        "id": "1lln843",
        "title": "AITA for telling my sister’s baby daddy to sleep in the spare bedroom instead of on my couch in his underwear?",
        "url": "/r/AmItheAsshole/comments/1lln843/aita_for_telling_my_sisters_baby_daddy_to_sleep/",
        "body_summary": "OP's sister lets her abusive ex (BD) stay in OP's house to see their child. BD sleeps on the couch, making pregnant OP uncomfortable. OP asked BD to use the guest room, causing a fight. Sis says OP is kicking her child off the couch. AITA for setting boundaries in my own home?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 50,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-28T05:12:12.509042"
    },
    {
        "id": "1lluxkk",
        "title": "AITA for telling my sister the way she's trying to lose weight will lead to her actually becoming overweight ?",
        "url": "/r/AmItheAsshole/comments/1lluxkk/aita_for_telling_my_sister_the_way_shes_trying_to/",
        "body_summary": "My (37f) little sister Linda (29f) is not even overweight. She circles 145 pounds at 5 feet 6 inches which is around 65 kg at 167 cm for my non-American friends. She got dumped by her boyfriend and she's trying hard to lose weight. \n              I'm legitimately overweight as I am 198 lb at 5 feet 5 inches which is around 89 kg at 165 cm. She's making the same I made after I had my baby. Under 1,200 calories, not enough protein, tons of cardio, no strength training, ect. Burn out my muscles and mess up my metabolism. I tried to explain that to my sister but she called me controlling. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 59,
            "NTA": 40,
            "ESH": 2,
            "NAH": 10,
            "INFO": 2,
            "TotalJudged": 113
        },
        "total_judged": 113,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-06-28T05:12:15.509916"
    },
    {
        "id": "1llrbcj",
        "title": "AITA for refusing to buy my sisters furniture",
        "url": "/r/AmItheAsshole/comments/1llrbcj/aita_for_refusing_to_buy_my_sisters_furniture/",
        "body_summary": "OP (23f) bought an apt. Sister (26f) moving abroad wants to sell furniture (all white). Family expects OP to buy it, but OP refuses due to dog/spills. AITA for not buying it to \"help\" sister?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 141,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 142
        },
        "total_judged": 142,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-28T05:12:18.400478"
    },
    {
        "id": "1lm07uh",
        "title": "AITA for asking my neighbor to stop using my driveway to park their car?",
        "url": "/r/AmItheAsshole/comments/1lm07uh/aita_for_asking_my_neighbor_to_stop_using_my/",
        "body_summary": "My neighbours (call them Bob and Linda) are an elderly couple in their 70ies who live in the house next to us. They are fine, although we don’t talk at all. \n\nWe live in a neighborhood where parking is a bit tight, and my driveway is right next to the street. (I don’t own a car) \n\nBob and Linda suddenly started to use my driveway, first for a couple of hours and by now they are just straight up occupying it. They started using it without asking permission because it’s convenient for them, but it’s causing me some inconvenience.\n\nWhen I asked them to not park there, they got upset and said I was being too rigid. I just want my driveway back. \n\nAITA?",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 72,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 75
        },
        "total_judged": 75,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-28T05:12:19.427518"
    }
]