[
    {
        "id": "1locnnx",
        "title": "AITA for only buying food for myself?",
        "url": "/r/AmItheAsshole/comments/1locnnx/aita_for_only_buying_food_for_myself/",
        "body_summary": "OP's family eats shared food quickly, leaving her hungry. OP now buys/stores her own food, avoiding shared meals. When siblings are hungry after eating shared food, OP doesn't share her food. Mom called her selfish. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 144,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 147
        },
        "total_judged": 147,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-01T05:16:25.879363"
    },
    {
        "id": "1lo1muy",
        "title": "AITA for causing my MIL not to come to my husband's birthday?",
        "url": "/r/AmItheAsshole/comments/1lo1muy/aita_for_causing_my_mil_not_to_come_to_my/",
        "body_summary": "OP planned a lobster buffet for her husband's birthday. MIL invited herself. Husband refused to pay. OP invited MIL alone but MIL brought two extra guests. OP reluctantly agreed, confided in SIL, causing MIL to cancel. AITA for undermining her husband's wishes?\n...",
        "reddit_judgments": {
            "YTA": 68,
            "NTA": 48,
            "ESH": 6,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 122
        },
        "total_judged": 122,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-07-01T05:16:28.515555"
    },
    {
        "id": "1lo9vys",
        "title": "AITA for not making a fuss when someone sat in \"my\" seat?",
        "url": "/r/AmItheAsshole/comments/1lo9vys/aita_for_not_making_a_fuss_when_someone_sat_in_my/",
        "body_summary": "OP always sat on a comfy lounge at their kid's sport. New parents used it, sparking outrage from others who thought OP \"owned\" it. OP didn't care, baffling everyone. AITA for not claiming the lounge and causing this drama?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 49,
            "ESH": 0,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-01T05:16:30.614256"
    },
    {
        "id": "1lobspa",
        "title": "AITA for telling my Fiancé one of her bridesmaids can’t bring her boyfriend",
        "url": "/r/AmItheAsshole/comments/1lobspa/aita_for_telling_my_fiancé_one_of_her_bridesmaids/",
        "body_summary": "OP doesn't want Emily's awful boyfriend, Rick, at their wedding due to his past behavior (misogyny, stalking, disturbing photos). Fiancée fears excluding Rick will cause Emily and her friends to boycott the wedding. AITA for banning Rick?\n...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 80,
            "ESH": 3,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 97
        },
        "total_judged": 97,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-01T05:16:33.739142"
    },
    {
        "id": "1loe873",
        "title": "AITA I am a 58year old only child. My very elderly parents want to have a say in the protections I put in place, after I’m dead, for my adult vulnerable child.",
        "url": "/r/AmItheAsshole/comments/1loe873/aita_i_am_a_58year_old_only_child_my_very_elderly/",
        "body_summary": "OP's parents, making estate plans, want to dictate how OP will provide for their vulnerable adult child via a trust after OP's death. OP feels this is an overstep. AITA?\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 70,
            "ESH": 0,
            "NAH": 6,
            "INFO": 11,
            "TotalJudged": 96
        },
        "total_judged": 96,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-01T05:16:35.839392"
    },
    {
        "id": "1lo86il",
        "title": "AITA for asking my mother-in-law please stop sending me cake ?",
        "url": "/r/AmItheAsshole/comments/1lo86il/aita_for_asking_my_motherinlaw_please_stop/",
        "body_summary": "I (31f) have a mother-in-law (55f) who is a kind, soft-spoken baker. Since I got married 4 months ago my MIL has sent me, at least, one cake per month. I'm not overweight right now but I used to be obese and that was hell I don't want to go back to. I already gain 13 pounds since the wedding. My husband (29m) doesn't like sweets. He is thin and he has never been overweight. \n                  I tried as gently as I possible could asking my MIL to please stop sending me cake. She seemed okay and I was hoping she was okay. But my brother-in-law (25m) came over to tell me that I broke his mom's heart. He said I should have re-gifted her cakes. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 105,
            "ESH": 0,
            "NAH": 12,
            "INFO": 0,
            "TotalJudged": 125
        },
        "total_judged": 125,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-01T05:16:37.855544"
    },
    {
        "id": "1lnzghx",
        "title": "AITA for pulling our neighbors dog away from our baby when it wasn't listening to the owner?",
        "url": "/r/AmItheAsshole/comments/1lnzghx/aita_for_pulling_our_neighbors_dog_away_from_our/",
        "body_summary": "OP's neighbor's untrained puppies bothered their baby. Husband pulled a puppy away, collar broke. Neighbors accused them of abuse. OP texted neighbor, who doubled down, citing husband's force. Now neighbors demand OP contain their dog. AITA?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 55,
            "ESH": 13,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-01T05:16:39.514278"
    },
    {
        "id": "1lofbma",
        "title": "AITAH for making my daughter go to bed early even though all her friends stay up late?",
        "url": "/r/AmItheAsshole/comments/1lofbma/aitah_for_making_my_daughter_go_to_bed_early_even/",
        "body_summary": "OP's 12yo daughter wants a later bedtime like her friends. OP has strict device curfew ending at 11:30pm, bedtime at midnight. Daughter threw a tantrum. Wife suggests compromise. AITA for enforcing the bedtime?\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 96,
            "ESH": 1,
            "NAH": 3,
            "INFO": 3,
            "TotalJudged": 106
        },
        "total_judged": 106,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-01T05:16:44.534677"
    },
    {
        "id": "1lo8v7a",
        "title": "AITA for taking our house key with me and letting my roommate out?",
        "url": "/r/AmItheAsshole/comments/1lo8v7a/aita_for_taking_our_house_key_with_me_and_letting/",
        "body_summary": "I live with two friends, and we share a single key. Last week they went out on vacation and said they would come back only in mid-July. On friday I also came back to my home town and, with their schedule in mind, brought the key with me so i could make 2 copies for them, and then return to our shared apartment 4 days later, on tuesday.\nToday's morning, on monday, one of my friends ALREADY on our apartment's footstep call me asking where the key is (we usually leave it at the reception), and i tell him i brought it with me because i was thinking he would return only after 3 weeks, so i would have time to make another 2 copies for them. He told me i shouldn't have done that, \"what are we going to do now\", I should have left it at the reception, etc. \nSo, AITA?\n\n",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 6,
            "ESH": 37,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "ESH",
        "fetched_utc": "2025-07-01T05:16:45.297340"
    },
    {
        "id": "1lokoh0",
        "title": "WIBTA if I backed out of a sibling camping trip aftery sister last minueTe decided to take our niece",
        "url": "/r/AmItheAsshole/comments/1lokoh0/wibta_if_i_backed_out_of_a_sibling_camping_trip/",
        "body_summary": "OP, sis, & bro planned a camping trip, no young kids. Sis invited niece (6, ADHD) without consulting others, expecting babysitting. OP wanted a relaxing trip, now considers dropping out. AITA if she cancels?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 70,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 71
        },
        "total_judged": 71,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-01T05:16:46.597008"
    }
]