[
    {
        "id": "1r713yg",
        "title": "AITAH for expecting a girl to get off a treadmill in the gym?",
        "url": "/r/AmItheAsshole/comments/1r713yg/aitah_for_expecting_a_girl_to_get_off_a_treadmill/",
        "body_summary": "The gym I go to doesn’t have a lot of treadmills and I’ve recently started running. I went to the gym with my partner last night and all of the treadmills were in use. I used some weight machines to start then went back to the treadmills. \n\nI noticed there was a girl just sat on the treadmill while her friend was using the treadmill next to her. She’d been there for at least 15 mins not using it so I went up and asked if she was planning to use it. She said she was with her friend but I just said she can wit next to her friends machine instead of taking up machines from people who want to use them, \n\nShe shrugged her shoulders and refused to move. A women comes over and asks what’s happening so I explain it. She said she’s the girls mother and that I shouldn’t be telling her daughter to mo...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 148,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 148
        },
        "total_judged": 148,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-18T05:54:35.717293"
    },
    {
        "id": "1r75lcy",
        "title": "Update: AITA for interrupting my autistic brothers routine for my own physical pain?",
        "url": "/r/AmItheAsshole/comments/1r75lcy/update_aita_for_interrupting_my_autistic_brothers/",
        "body_summary": "Sorry for not being around to update or respond for a while! I took several people's advice, told my brother that I was down because my bed was so violently uncomfortable and he brought it up to my parents, I read this to my parents but changed ages, genders and the hobby so it sounded like another person, essentially hid it. At the end, I told them I felt the same and related to the story, and how bad my back pain was. I told them how I couldn't lie on one side without big red marks where I had been laying even after only 10 minutes etc etc. And I got grounded for being 'ungrateful, rude and dramatic'. For about 2 weeks. I only just got my phone back to update you all.\n\nGood news is that me and my brother (mainly him) wore my parents down and I got a new mattress! A cheap memory and high ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 2,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 2
        },
        "total_judged": 2,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-02-18T05:54:43.178321"
    },
    {
        "id": "1r7o0fj",
        "title": "AITAH for not wanting to give my cart up for free at Aldis",
        "url": "/r/AmItheAsshole/comments/1r7o0fj/aitah_for_not_wanting_to_give_my_cart_up_for_free/",
        "body_summary": "So I don’t know if Aldis are everywhere or not. Their carts require you to put a quarter in them to use them but you get your quarter back when you return them. It’s to convince people to push their carts back to the front of the store rather than leaving them in the parking lot etc. An unspoken rule is if someone grabs your cart from you before you turn it in they give you a quarter for it. This lady asked for my cart and I asked if she had a quarter she said no so I shrugged and turned it in to get my quarter back. She got really upset and some other people kinda side eyed me and it made me feel like a jerk. I don’t keep change or use cash and I just keep the quarter in my center console for when I shop there. So to me if I gave the cart for free I would be SOL the next time I shopped th...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 125,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-18T05:54:53.882129"
    },
    {
        "id": "1r7c1p3",
        "title": "AITA for being honest and telling my friend that her schedule just doesn’t work when I didn’t move dinner plans so she could come.",
        "url": "/r/AmItheAsshole/comments/1r7c1p3/aita_for_being_honest_and_telling_my_friend_that/",
        "body_summary": "I have a friend group from college, there are about seven girls in the group. This is about Asha, Asha dropped out her senior year of college and has been a waitress since. Everyone else went on and gradated and now works pretty standard 9-5 jobs.\n\nDue to Asha having a waitress job she is off when literally when everyone is at work. She works most night shifts especially Friday’s and the weekends ( that’s when she makes the most money) \n\nIt has gotten even harder since some of us are now married with kids ( so babysitting costs). Due to this she basically can never makes it to hangouts.\n\nExample dinner at 7pm when everyone else is off she is working. She invited us to get brunch on Tuesday ( everyone is working). Sunday’s brunch, can’t come because she is working.\n\nIt has resulted in her f...",
        "reddit_judgments": {
            "YTA": 18,
            "NTA": 93,
            "ESH": 7,
            "NAH": 17,
            "INFO": 5,
            "TotalJudged": 140
        },
        "total_judged": 140,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-18T05:55:05.187008"
    },
    {
        "id": "1r768xd",
        "title": "WIBTAH for asking this autistic university student to be quiet or go elsewhere?",
        "url": "/r/AmItheAsshole/comments/1r768xd/wibtah_for_asking_this_autistic_university/",
        "body_summary": "There are three types of areas in my university library: \n\n1) Social/group spaces - all talking, videos etc is fine\n\n2) Quiet spaces - occasional whispers, music from headphones, can faintly hear social spaces in adjacent rooms in the background\n\n3) Silent spaces. No sound except typing and clicking. None. Shh. \n\n  \nThis autistic lad uses the silent room every day. So do I. I'm fairly sure he needs to be in a silent space to concentrate. So do I. But... he mutters. Constantly. Just quietly, under his breath.  But it is constant. If a couple of people were in there whispering at the same volume as his muttering, I would go over and ask them to either be quiet or move to a 'quiet' space instead of the 'silent' space (and have done, many times). \n\n  \nI'm not actually going to ask him to be qu...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 42,
            "ESH": 0,
            "NAH": 7,
            "INFO": 1,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-18T05:55:13.878194"
    },
    {
        "id": "1r7fe2w",
        "title": "AITAH for declining the invitation to my Mother’s wedding because of comments made by a 5 year old?",
        "url": "/r/AmItheAsshole/comments/1r7fe2w/aitah_for_declining_the_invitation_to_my_mothers/",
        "body_summary": "Hi everyone,\n\nLong-time lurker, first-time poster!\n\n***As a disclaimer, there are quite a few factors that have resulted in me withdrawing from the wedding. I can’t include them all in the post, but my decision has resulted in tension within my family and I am being made to feel as if I am wrong for my choice.***\n\n***(Also, this is a “straw that broke the camel’s back” sort of thing. I don’t mean to come off as click-baity!)***\n\nI (F28) am the eldest of 3. I have a younger sister (27) and a younger brother (24). We also have a half-brother (5).\n\nFor background, the 3 of us have never gotten along with our soon-to-be Step Father (“Milton”). If anything, it became a mutual agreement that we would not have anything to do with one another.\n\nAfter they had gotten engaged, my brother and sister ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 68,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 71
        },
        "total_judged": 71,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-18T05:55:22.004008"
    },
    {
        "id": "1r7kcrj",
        "title": "AITA for refusing to clean the bathroom anymore after my partner keeps leaving it dirty and says I’m “too sensitive”?",
        "url": "/r/AmItheAsshole/comments/1r7kcrj/aita_for_refusing_to_clean_the_bathroom_anymore/",
        "body_summary": "My partner (36M) and I (31F) have lived together for about a year now, and for the most part, we get along really well. But there’s one issue that keeps coming up and it’s honestly starting to make me resent him: he consistently leaves the bathroom dirty and expects me to deal with it.\n\nSpecifically, after he uses the toilet, there are often stains or splashes left behind on the seat and sometimes on the floor. Not every single time, but often enough that I’ve started noticing it almost daily. I’ll go in to use the bathroom and have to wipe things down before I can even sit, which feels gross and unfair.\n\nAt first, I tried to be polite about it. I mentioned it gently and asked if he could just double-check and clean up after himself. He laughed it off, I didn’t push it because I didn’t wan...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 99,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-18T05:55:30.383318"
    },
    {
        "id": "1r7cu4d",
        "title": "WIBTAH for telling my parents they are terrible parents for not helping me during the hardest time in my life?",
        "url": "/r/AmItheAsshole/comments/1r7cu4d/wibtah_for_telling_my_parents_they_are_terrible/",
        "body_summary": "I (27F) have grown up in a family that some would call transactional. My parents aren’t as loving as I’ve noticed other parents are towards their kids, and they are always going through life checking boxes (go to college, get a good job, get married, have kids, etc.). My parents both got their masters, had high paying jobs, & are well off. They are now retired with pensions, living on a farm they bought in cash, & doing well (millionaires).\n\n3 years ago I was separating from my soon to be ex-husband (amicably) who tragically passed in a motorcycle accident shortly after we began our divorce process. He was 27, we had no life insurance, no savings, still living together, and everything tied together still. After the funeral, I called our lawyers office to notify them of his passing and see ...",
        "reddit_judgments": {
            "YTA": 67,
            "NTA": 6,
            "ESH": 0,
            "NAH": 2,
            "INFO": 7,
            "TotalJudged": 82
        },
        "total_judged": 82,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-18T05:55:40.098502"
    },
    {
        "id": "1r70hos",
        "title": "AITA for getting my roommates sent home early at a summer camp?",
        "url": "/r/AmItheAsshole/comments/1r70hos/aita_for_getting_my_roommates_sent_home_early_at/",
        "body_summary": "This happened a few years ago but has been bugging me ever since. I’m still not entirely sure I made the right call, and I honestly think I might’ve ruined some poor kid’s life.\n\nWhen I was a Sophomore in high school, I got the opportunity to go to a week-long summer camp at a prestigious nearby college. The camp was mostly kids who really enjoyed the subject we were there for, and was a really exciting time since we got to actually stay in the dorms and study in some of the classrooms at this college which many of us dreamed to attend.\n\nOverall, my time there was great, but unfortunately I got paired with 2 of some incredibly terrible roommates. It was clear from the first day that I met them that they really had no interest in attending the camp, and that they were way too immature to be...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 15,
            "ESH": 0,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 19
        },
        "total_judged": 19,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-18T05:55:47.803400"
    },
    {
        "id": "1r7df87",
        "title": "AITA for 'hiding' the new lump from my mom?",
        "url": "/r/AmItheAsshole/comments/1r7df87/aita_for_hiding_the_new_lump_from_my_mom/",
        "body_summary": "Hi, sorry if the language is poor, english is not my first :( \n\nWhen I (20F) was diagnosed with cancer last year, my family was understandably devastated. My mom (50F) was especially shaken, but overall they all were supportive through surgery and treatment. It was overwhelming, but I'm grateful for that.\n\nSince my surgery and during rehabilitation, though, things have changed. I’ve been dealing with pretty severe post-surgery fatigue. Some days just showering feels like running a marathon. My doctor has told me recovery takes time, and I’m doing what I can.\n\nMy mom, however, has been constantly commenting on me for the past few months. She criticizes how I eat (“You shouldn’t be eating that,” “You’re not eating enough protein,” “That’s why you’re tired”), how little I move (“You need to p...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 34,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-18T05:55:55.446074"
    }
]