[
    {
        "id": "1oe5d4y",
        "title": "AITA for refusing to let my parents have my daughter unless they spend proper one‑on‑one time with her?",
        "url": "/r/AmItheAsshole/comments/1oe5d4y/aita_for_refusing_to_let_my_parents_have_my/",
        "body_summary": "OP's parents prioritize sister's kids, failing to provide promised childcare. Now they want daughter overnight, but only with cousins. OP refused, demanding individual time to avoid daughter feeling like an afterthought. Parents angry. AITA for setting boundary of consistent, individual time?\n...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 69,
            "ESH": 4,
            "NAH": 0,
            "INFO": 7,
            "TotalJudged": 90
        },
        "total_judged": 90,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-24T05:11:19.539294"
    },
    {
        "id": "1oej2wk",
        "title": "AITA for yelling at my mom to leave me alone after she kept saying I stink even though I shower twice a day?",
        "url": "/r/AmItheAsshole/comments/1oej2wk/aita_for_yelling_at_my_mom_to_leave_me_alone/",
        "body_summary": "OP's mom repeatedly tells OP they smell bad despite showering twice daily, using deodorant & perfume. OP yelled at their mom after she persisted, causing insecurity. Dad says OP overreacted. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 76,
            "ESH": 0,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-24T05:11:22.034533"
    },
    {
        "id": "1oe9fc4",
        "title": "AITA for cancelling on an old friends wedding & not wanting to pay a fee?",
        "url": "/r/AmItheAsshole/comments/1oe9fc4/aita_for_cancelling_on_an_old_friends_wedding_not/",
        "body_summary": "OP (M29) introduced friends who are now marrying. He canceled attending their wedding last minute due to work. The groom asked OP to pay £95 to cover his empty dinner spot. OP thinks the meal price is excessive. AITA if he questions the cost instead of just paying?\n...",
        "reddit_judgments": {
            "YTA": 51,
            "NTA": 49,
            "ESH": 7,
            "NAH": 4,
            "INFO": 2,
            "TotalJudged": 113
        },
        "total_judged": 113,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-10-24T05:11:25.789806"
    },
    {
        "id": "1oe9k8n",
        "title": "AITAH for scolding my niece and not letting her play with my sons toys?",
        "url": "/r/AmItheAsshole/comments/1oe9k8n/aitah_for_scolding_my_niece_and_not_letting_her/",
        "body_summary": "OP's niece destroys their baby's toys (balls, mats, walker). OP scolded niece, then sent her to her mother. Brother is angry, saying toys are cheap. OP now restricts niece from toys, explaining why. AITA?\n...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 67,
            "ESH": 3,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-24T05:11:27.859836"
    },
    {
        "id": "1oehksi",
        "title": "AITA for ignoring my fiancés wishes by feeding our dog kibble rather that raw food?",
        "url": "/r/AmItheAsshole/comments/1oehksi/aita_for_ignoring_my_fiancés_wishes_by_feeding/",
        "body_summary": "OP's dog has butt problems, likely diet-related. Fiancé insists on raw/homemade dog food, citing benefits for their sick dog, despite vet concerns about deficiencies and recommendations for kibble. OP wants to switch to vet-recommended kibble. AITA for feeding kibble against fiancé's wishes?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 61,
            "ESH": 2,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-24T05:11:30.507882"
    },
    {
        "id": "1oejw08",
        "title": "AITA for not paying more than my fair share of rent because I make considerably more money than my roommates?",
        "url": "/r/AmItheAsshole/comments/1oejw08/aita_for_not_paying_more_than_my_fair_share_of/",
        "body_summary": "I recently moved into a house that I’m renting out with my significant other and 3 friends that were really down on their luck. We all agreed on paying our portions of bills and rent, split 5 ways. Then my gf let it slip of how much money I get paid. I’m not here to gloat but it’s upwards of $100k annually and I get commissions on top. Now my gf and my roommates are trying to reason with me that I should pay around 2.5 times what we agreed on beforehand because it isn’t fair that they have to pay a considerable amount of their monthly earnings while I put in an amount that doesn’t stress me out at all. I can see where they’re coming from but I’m not budging. Does that make me the asshole?",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 115,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 119
        },
        "total_judged": 119,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-24T05:11:31.794051"
    },
    {
        "id": "1odvwgm",
        "title": "AITA for calling my SO friend a gold digger?",
        "url": "/r/AmItheAsshole/comments/1odvwgm/aita_for_calling_my_so_friend_a_gold_digger/",
        "body_summary": "My girlfriend and I were talking about her friends and she mentioned this one friend that was with a guy that she didn’t like, had no sex with and cheated on her (he is gay). Then she proceeded to tell me that he has a really rich family. I jokingly called her a gold digger. She got upset at me and told me it was wrong and unfair. We do joke a lot about these things, she called my brother ugly and told me he looked way too old for his age when I showed a picture. I defended him. Am I an asshole for calling her friend a gold digger?",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 7,
            "ESH": 7,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-10-24T05:11:32.112763"
    },
    {
        "id": "1oe6jov",
        "title": "AITA if I ask my roommate to pick up her hair",
        "url": "/r/AmItheAsshole/comments/1oe6jov/aita_if_i_ask_my_roommate_to_pick_up_her_hair/",
        "body_summary": "I’ll keep it short but essentially my roommate (we’re both freshmen in college in a typical sized dorm room for a college in a city) has a lot of unhygienic habits. However one that really gets me is she pulls her hair out of her brush and leaves it around. So all over her side is clumps of her hair and gotten times it’s in the middle of our room too. This just doesn’t feel very hygienic to me. Is there anything I could do to ask her to not, I know it’s technically on her side for the most part but it’s still really gross so..",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 21,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 21
        },
        "total_judged": 21,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-24T05:11:32.371800"
    },
    {
        "id": "1oecngo",
        "title": "AITA for telling my husband that my father is in rehab?",
        "url": "/r/AmItheAsshole/comments/1oecngo/aita_for_telling_my_husband_that_my_father_is_in/",
        "body_summary": "OP's dad went to rehab; mom told OP, asking her to keep it secret. Dad told OP's older brother himself. OP told her younger brothers and husband. Mom's angry OP broke her trust and blames her for family drama. AITA for telling?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 40,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-24T05:11:33.571920"
    },
    {
        "id": "1oeaf7s",
        "title": "AITA for demanding the entire AirBnB refund?",
        "url": "/r/AmItheAsshole/comments/1oeaf7s/aita_for_demanding_the_entire_airbnb_refund/",
        "body_summary": "OP, wife, and friends rented an AirBnB. OP and wife suffered severe bedbug bites; others were unaffected. AirBnB refunded $750. Wife wants to split the refund 3 ways, but OP thinks they deserve the whole amount since they were the only ones affected. AITA if OP insists on keeping the full refund?\n...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 8,
            "ESH": 0,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-10-24T05:11:34.847914"
    }
]