[
    {
        "id": "1pksb2u",
        "title": "AITA for telling my DIL that I got the iPads for the kids but I have locked her out of the settings",
        "url": "/r/AmItheAsshole/comments/1pksb2u/aita_for_telling_my_dil_that_i_got_the_ipads_for/",
        "body_summary": "update: I am still going to give them the ipads and for the first few weeks they will stay at my place and then I will let them take them home but I will be monitoring them  They deserve to have nice things at home even if mom is a dick. I am also going to inform her in text that this is a loan and I am going to make it very clear that if she does sell them I will file a report with the police and persue it. I can literally see where the iPad are online.  \n( I don’t like it but she needs to stop doing this shit and it if have to presue it then I will). I\n\nedit: she is locked out of everything. The cloud is in my name, with my own passcodes, that’s locked. I had the people help me do this so no one else can get it.\n\nunless she gets hacking skills to rival apple engineera she will not be abl...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 92,
            "ESH": 15,
            "NAH": 0,
            "INFO": 6,
            "TotalJudged": 121
        },
        "total_judged": 121,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-13T05:12:19.969803"
    },
    {
        "id": "1pkww7j",
        "title": "AITA for refusing to hold my sister in laws giant drink bottles",
        "url": "/r/AmItheAsshole/comments/1pkww7j/aita_for_refusing_to_hold_my_sister_in_laws_giant/",
        "body_summary": "My wife and our three daughters are obsessed with those massive Stanley/Frank Green drink bottles the ones that take a full working day to finish.\n\nWhenever we go to community events, parks, school stuff,literally anywhere without a table\n\nI somehow become the designated drink bottle valet. Not ideal, but manageable.\n\nRecently, my sister-in-law moved to town. She and her two daughters also love these oversized drink bottles. She’s noticed that I’m always the guy holding everyone else’s… and has started casually adding hers to the pile.\n\nSo now at events I’m stuck on a park bench guarding 7 giant drink bottles unable to move without abandoning hydration for an entire family when it’s just my girls I could still move around the event and look at stuff.\n\nFast forward to tonight We’re at my da...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 124,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 129
        },
        "total_judged": 129,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-13T05:12:36.767350"
    },
    {
        "id": "1pkv59n",
        "title": "AITA for throwing my friend’s diagnosis in her face?",
        "url": "/r/AmItheAsshole/comments/1pkv59n/aita_for_throwing_my_friends_diagnosis_in_her_face/",
        "body_summary": "I've had a close friendship with Mia for ten years. From the start, she was open about her borderline diagnosis, which helped me understand why her behavior toward me could sometimes be extreme. Most of the time, I was her \"favorite person,\" which meant weeks of idealization followed by sudden devaluation phases. In good times, we spent every free moment together, but in bad times, I had to apologize for days over minor things. I constantly watched what I said, how I said it, and what I better kept quiet about to avoid triggering another devaluation wave. I would never pathologize her or bring up her borderline diagnosis. I learned to walk on eggshells, carefully frame criticism, and swallow a lot. This unbalanced our relationship, but I was willing to bear it for Mia because I understood ...",
        "reddit_judgments": {
            "YTA": 92,
            "NTA": 14,
            "ESH": 19,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-13T05:12:54.181249"
    },
    {
        "id": "1pl1zcd",
        "title": "AITA for not lying to my kids about Christmas present?",
        "url": "/r/AmItheAsshole/comments/1pl1zcd/aita_for_not_lying_to_my_kids_about_christmas/",
        "body_summary": "My MIL/FIL are giving their 4 children/spouses (7 total) and 4 grandchildren a trip to Disneyland for Christmas. Before she purchased the gift, she checked with each couple/child to see if we would accept the gift. Each of us obviously said yes. So now that my MIL has spent $15K for 9 adults and 4 children to spend a week at the happiest place on earth and just a few days before Christmas, my SIL has decided that she does not want her children (7F and 3F) to receive the gift on Christmas but would like to wait until Easter. Her reasoning is that her children deserve to open more than one \"small\" gift on Christmas and she doesn't want to deal with the excitement of the present for 6 months. She would also like my children (7F and 5F) to hide this gift from their cousins until Easter. I have...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 34,
            "ESH": 1,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-13T05:13:09.934949"
    },
    {
        "id": "1pkt428",
        "title": "AITA for telling my brother I’m sick of his friends?",
        "url": "/r/AmItheAsshole/comments/1pkt428/aita_for_telling_my_brother_im_sick_of_his_friends/",
        "body_summary": "I (28F) have a brother (30M) who has been one of my best friends for my entire life. We’ve always had a great relationship. He has a wife Sarah (31F) and she is wonderful, too. Sarah does not have the best relationship with her family members for one reason or another, so she never understood why my brother and I were such good friends. Regardless, she has always respected it. She’s awesome. \n\nEnter Bob (31M) and Mary (31M). Bob and Mary are their couple friends. They came into my brother’s life about 5 years ago and changed everything.\n\nBob and Mary are miserable. They often get into arguments in public and Mary actively discusses that she wants a divorce. Despite this, they still drag each other around. It’s very uncomfortable to be a part of anything with them. \n\nSarah is obsessed with ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 31,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-13T05:13:25.728272"
    },
    {
        "id": "1pl91ww",
        "title": "AITA for telling a coworker to stop commenting on my snack choices?",
        "url": "/r/AmItheAsshole/comments/1pl91ww/aita_for_telling_a_coworker_to_stop_commenting_on/",
        "body_summary": "Some backstory: my work provides snacks for employees regularly and keeps our break room well stocked. There is not a supply issue in play here. I also regularly drink a particular soda and don’t stray from that, unless I’m drinking water. I tend to bring my own since I drink it at home as well and me partaking in the company-provided snacks and drinks isn’t keeping anyone else from getting something.\n\nOn more than one occasion, coworkers have commented on my soda consumption, asking things like “What number is that?” etc. I usually brush it off, even though I hate it and actually find it quite rude. Granted, I have a long-standing issue with questions like that because my dad is notorious of it, but I know of course others don’t know that and I can’t expect anyone to automatically know it...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 82,
            "ESH": 0,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 88
        },
        "total_judged": 88,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-13T05:13:41.957306"
    },
    {
        "id": "1pkw8vu",
        "title": "AITAH for wanting my exes mom in the delivery room?",
        "url": "/r/AmItheAsshole/comments/1pkw8vu/aitah_for_wanting_my_exes_mom_in_the_delivery_room/",
        "body_summary": "Hello everyone! I am 35 weeks pregnant and was recently asked about who would be in the delivery room with me at a family gathering for my husband’s side of the family.\n\nI told everyone it would be my husband and my daughter’s grandma as she was there for the first birth and made it such an amazing experience for me. (I have a daughter with someone from a previous relationship which ended on good terms. We all still are very close and see each other often. ) it got very quiet and wasn’t mentioned again. Fast forward to when we get home his mom texts him that she and other family members are very upset with my decision. She said she feels very upset and that she’s being left out on seeing her grandchild be brought into the world. She said he will need support and it isn’t just about me and ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 139,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 140
        },
        "total_judged": 140,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-13T05:13:59.841545"
    },
    {
        "id": "1pkzboy",
        "title": "AITA? Mom trying to force me to use scholarship to buy grandma a trailer",
        "url": "/r/AmItheAsshole/comments/1pkzboy/aita_mom_trying_to_force_me_to_use_scholarship_to/",
        "body_summary": "Me 19f received a full ride scholarship to a good college in my area, i currently go to for social work. I also received almost 7,000 dollars on top of this for school expenses and living. I need money to live on campus over the summer. She wants to buy my grandma a new trailer and says she will pay me back but i dont trust her. The trailer is currently safe to live in and they will not be kicked out. Am i the asshole for saying no?\nEdit:\nShe had access to my account and does help me with money sometimes and helps me so i feel like i owe her and don’t want to ruin our family relationship.",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 99,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-13T05:14:01.506633"
    },
    {
        "id": "1pksfmw",
        "title": "AITA for not wanting to babysit my sister's kids for free?",
        "url": "/r/AmItheAsshole/comments/1pksfmw/aita_for_not_wanting_to_babysit_my_sisters_kids/",
        "body_summary": "My sister R (33) has 5 kids, 4 boys and 1 girls ranging from ages 5 to 15. She asked me and my partner to babysit four of the children for the night so she could go out for the night with her husband. She offered us £120 for babysitting and I agreed to babysit as long as she pays us prior to me picking the kids up. She agreed with this and said she'd pay us the day before.\n\nThe day before we were supposed to babysit she messaged us stating she no longer needed us to babysit as she couldn't afford to pay us. We said that's fine and thanks for letting us know and went on with our day. I later get a message asking us if we can still babysit but this time for free. I said I'm sorry but I can't do that as I can't financially afford to look after her kids, even for 24 hours. \n\nWe've babysat her ...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 41,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-13T05:14:17.271021"
    },
    {
        "id": "1pl5od9",
        "title": "AITA for refusing to lend my car to my brother after he keeps returning it with an empty tank?",
        "url": "/r/AmItheAsshole/comments/1pl5od9/aita_for_refusing_to_lend_my_car_to_my_brother/",
        "body_summary": "Hi Reddit,\n\nI (27M) have a car and work full-time. My brother (23M) is a college student and doesn’t own a car, so over the past few months I’ve been lending him mine pretty regularly to get to class or go out with friends.\n\nAt first I didn’t mind, but I started noticing that every single time he returns it with the gas tank almost empty. I’ve brought it up multiple times, calmly, telling him that I don’t mind lending the car, but he should at least replace the gas he uses. He always says, “Yeah yeah, next time.”\n\nSpoiler: next time never comes.\n\nLast week he asked to borrow the car for a weekend trip. When he brought it back, the low-fuel light was on. That was kind of the last straw for me, so I told him I’m not lending him my car anymore until he starts being more responsible.\n\nNow my b...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 76,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 76
        },
        "total_judged": 76,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-13T05:14:33.142655"
    }
]