[
    {
        "id": "1qmxe20",
        "title": "AITA for telling everyone involved what my best friend's husband did?",
        "url": "/r/AmItheAsshole/comments/1qmxe20/aita_for_telling_everyone_involved_what_my_best/",
        "body_summary": "I kind of feel like a jerk for saying unkind things about my best friends husband. At the same time, I thought that everyone who went out of their way to come help them deserve an explanation as to why they had to be out in -40° weather.\n\nYesterday I (36 F) got a frantic call from my best friend (36 F). She says that both she and her husband (35 M) were stuck at the gas station because both cars wont start. While this sounds unrealistic to some, this is in a northern state during an arctic blast of -40° cold front. Batteries stop working in that kind of cold. My friend tells me that her husband called her to come give him a jump, and when she got there and tried to jump his car, hers suddenly shut off and then wouldn't start.\n\nNaturally, I already have jumper cables in my trunk. So I head ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 140,
            "ESH": 0,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 148
        },
        "total_judged": 148,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-26T05:27:03.887092"
    },
    {
        "id": "1qmbxma",
        "title": "AITA for telling my SIL that I don’t can’t about her health condition and she needs to shower",
        "url": "/r/AmItheAsshole/comments/1qmbxma/aita_for_telling_my_sil_that_i_dont_cant_about/",
        "body_summary": "My SIL has a health condition that causes her to sweat more than average, she can nothing at all physically but still be sweating bullets, it can even be cold out and she still breaks a sweat. This is something that I’ve always known about her since we started talking back in high school and although we weren’t super close back then it was something I can live with. Now flash forward to modern day and I’m now with her brother, and she often likes to stop by very often since we live very close together, this I absolutely don’t mind since she’s overall a sweet person and likes to bring free food. The only issue is that she smells, like absolutely foul.\n\nI knew she wasn’t the most hygienic person sometimes out of forgetfulness but after she moved out of her parents house and nobody is there t...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 81,
            "ESH": 4,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 101
        },
        "total_judged": 101,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-26T05:27:21.556174"
    },
    {
        "id": "1qmxsxf",
        "title": "AITA for kicking my \"mentally ill\" brother out of my house when he was treating my wife like garbage",
        "url": "/r/AmItheAsshole/comments/1qmxsxf/aita_for_kicking_my_mentally_ill_brother_out_of/",
        "body_summary": "so i am 34M, i am married and own a home with my wife (26f) in Los Angeles. my younger brother is 32M and he has never lived on his own.. lived with my dad until around 24, he then moved into his girlfriends parents house until he was like 28 maybe, they broke up so my dad gifted him a condo that was above his business. he got a ton of free passes with my dad, he trashed the condo, didnt take care of anything, and my dad finally decided to retire and sell it because he couldnt take it anymore. my brother is also on his 3rd car, all bought by our grandfather.\n\n  \nabout 3-4 months ago was when he got kicked out, he came to our door begging and i knew exactly how it was going to go. i told him he had one month to get his shit together, and kept caving.\n\nmy wife is an actress, and she only boo...",
        "reddit_judgments": {
            "YTA": 20,
            "NTA": 120,
            "ESH": 2,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-26T05:27:38.624651"
    },
    {
        "id": "1qn0kk3",
        "title": "AITA for telling my parents that I will not parent my younger adult sister?",
        "url": "/r/AmItheAsshole/comments/1qn0kk3/aita_for_telling_my_parents_that_i_will_not/",
        "body_summary": "I (M24) work at a university as IT support. I have a younger sister \"Cleo\" (F20) who started studying at this university in the Autumn of last year.  \n  \nShe's moved out of the family home and into a houseshare with two friends (our parents live 3 hours away from the school). I love my sister but for some background she can be quite immature for her age. I think my parents have babied her a lot.  \n  \nWhen Cleo got accepted into the university and decided that's where she's going, my parents made it clear they want me to keep tabs on her. They were worried she's going to get a sketchy boyfriend, start drinking or just generally be reckless. I told my parents I'd check in with her to make sure she's ok but I'm not interested in spying on her every move. They'd frequently call me to ask what ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 103,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 104
        },
        "total_judged": 104,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-26T05:27:55.031019"
    },
    {
        "id": "1qmbvh9",
        "title": "AITAH for wanting to set a boundary with my sister? She brings a nanny on weekends and I’m still required to help.",
        "url": "/r/AmItheAsshole/comments/1qmbvh9/aitah_for_wanting_to_set_a_boundary_with_my/",
        "body_summary": "First of all, I’m conscious that my sister has been overwhelmed with all the demands that comes with being a “two under two” mom since last year, plus her husband traveling a lot for work. I love her and those babies, so I really try to be understanding. For the past year, I've stayed over some nights at her house to help her, even though they live kind of far; I've also been very accommodating when she has needed emergency babysitting or something like that. My niece, her oldest, stays over at my mom's⏤an apartment downstairs from mine⏤almost every weekend, and I tend to her on Sunday mornings while my mom tries to do some chores. My relationship with my parents⏤specially with my dad⏤is a bit strained right now, and also, Sundays are basically the only day I can rest, but I push down any ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 34,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-26T05:28:10.729745"
    },
    {
        "id": "1qmuq7i",
        "title": "AITA for announcing my own mother's death on Facebook?",
        "url": "/r/AmItheAsshole/comments/1qmuq7i/aita_for_announcing_my_own_mothers_death_on/",
        "body_summary": "Burner account and being vague for obvious reasons.\n\n  \nLast week my mom died. It was expected, she was elderly. \n\n  \nSoon after I got the news, I posted on Facebook telling my family and friends about it.  After that I received a message from a family member (family member by marriage) saying that it was inappropriate of me to spread the news since other family members (who I have absolutely no contact with) were in different time zones, and that this family member was unable to contact his/her children to let them know.\n\nI was told that I posted the news to \"garner sympathy, attention and support.\"\n\nMy husband got the phone call and told me about it, and after I heard the words \"she's at peace\" I didn't hear anything else. I have no idea what he said after. Maybe the family member asked ...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 94,
            "ESH": 2,
            "NAH": 6,
            "INFO": 4,
            "TotalJudged": 121
        },
        "total_judged": 121,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-26T05:28:27.075802"
    },
    {
        "id": "1qn387s",
        "title": "AITA if I leave a note for my neighbours about bringing their screaming baby into the apartment hallway CONSTANTLY?",
        "url": "/r/AmItheAsshole/comments/1qn387s/aita_if_i_leave_a_note_for_my_neighbours_about/",
        "body_summary": "One of my neighbours has a newborn and they CONSTANTLY walk the baby up and down the hall when it’s crying/screaming trying to console it. Throughout the day and into the night (currently happening right now and it’s just past 10PM).\n\nI’m dealing with multiple chronic health conditions and work from home, and I’m at my wits end. I have a polite note written ready to stick to their door asking if they can please soothe their baby INSIDE their apartment and not in the hallway, as this is a shared space and the sound carries into nearby apartments.\n\nI hate confrontation, so I feel like leaving a note on their door is my best option lol.\n\nI understand that living in an apartment isn’t always going to be quiet, but imo it’s extremely rude to disturb everyone else with screaming at all hours. KE...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 39,
            "ESH": 0,
            "NAH": 8,
            "INFO": 1,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-26T05:28:43.242453"
    },
    {
        "id": "1qmulxq",
        "title": "AITAH for refusing to pay more of the rent and bills?",
        "url": "/r/AmItheAsshole/comments/1qmulxq/aitah_for_refusing_to_pay_more_of_the_rent_and/",
        "body_summary": "My girlfriend and I have been together for 5 years. She's had trouble with anxiety especially around work which has caused her to move jobs a few times.\n\nHer current job is one she's wanted for a while and she's had it for a year. Things started well then her anxiety came back so she's had a lot of sickness. She qualifies from her qualification in a couple of months and will be getting a £350 a month pay rise after tax.\n\nShe's talking about reducing her hours and going part time and only working three days a week. This would end up with her earning £250-£300 a month less instead of £350 more. She mentioned if she did this I'd need to pay a higher percentage of the bills.\n\nI mentioned to her that I don't really want to be paying more just because she's choosing to go part time.\n\nShe shrugge...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 74,
            "ESH": 5,
            "NAH": 1,
            "INFO": 7,
            "TotalJudged": 91
        },
        "total_judged": 91,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-26T05:28:59.627437"
    },
    {
        "id": "1qn0alk",
        "title": "AITA for getting mad at my husband for scolding our daughter after she threw up?",
        "url": "/r/AmItheAsshole/comments/1qn0alk/aita_for_getting_mad_at_my_husband_for_scolding/",
        "body_summary": "Our 4 year old has a history of throwing up on longer car trips. We were on our way back from a trip and our daughter kept asking us to pull over, probably about 3 times, saying she needed to throw up. Each time we did, got her out of the car seat, and she would bend over on the side of the road but nothing came out. Finally we just gave her a plastic bag and said if you need to throw up, throw up in here. \n\nShe ended up throwing up about 15 minutes away from home all over herself, all over the car seat, and starting crying. My husband started scolding her for not vomiting in the bag, and how she made us pull over all those times. She is covered in vomit, bawling, while he was doing this. I got mad at him, saying why are you treating her this way, I'm sure she doesn't want to be covered in...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 67,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 70
        },
        "total_judged": 70,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-26T05:29:15.745840"
    },
    {
        "id": "1qmkorm",
        "title": "AITA: no weekday visits",
        "url": "/r/AmItheAsshole/comments/1qmkorm/aita_no_weekday_visits/",
        "body_summary": "I am a parent to a 2.5 year old and pregnant. I work full time and have an emotionally taxing job. I usually get home after grabbing kid by 5:45 and then in a mad dash to get him dinner, bathed and ready for bed by 7:30. My son is not a great eater so it’s a stressful time of day when I’m tired.\n\nMy mother claims the only thing that makes her happy is him and she wants to see him multiple times a week including mid week. No expression of wanting to see me or help. I expressed that for that to happen, she is welcome to pick him up early and then I can grab him from her for bedtime. She denied that saying she can’t do that but can come over after 5:45. I stated no because it’s already hectic and I don’t want another mouth to feed or her comments about how my house should be tidier. \n\nMy pare...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 68,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 69
        },
        "total_judged": 69,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-26T05:29:31.916502"
    }
]