[
    {
        "id": "1pqd81p",
        "title": "AITA For telling my (28F) grandpa (84M) he doesn't get calls from his grandkids because he's a bully",
        "url": "/r/AmItheAsshole/comments/1pqd81p/aita_for_telling_my_28f_grandpa_84m_he_doesnt_get/",
        "body_summary": "Hi. I was over at my grandpa's house yesterday. He and my Nana got new phones and were trying to set them up with my help. We called customer support. My Nana was trying to increase the font on her phone and the customer service rep was guiding us. As we were working on our phones my grandpa got agitated. My Nana was trying to ask questions to the representative and several times my grandpa shushed her. I noticed but  I didn't think it was a big deal and was showing my Nana the settings on my phone and how big I could make my font. My grandpa leaned over and said \"shut up.\" I said \"no.\" He said \"I'm telling you to be quiet\" and I said \"no.\" Then he stood up and took his jacket off and said \"get the hell out of my house.\" I said \"no.\" He said he was going to call the police and I said fine ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 54,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-20T05:11:48.968913"
    },
    {
        "id": "1pqdata",
        "title": "AITA for not wanting to spend holidays with my brother and sister in law and their kids?",
        "url": "/r/AmItheAsshole/comments/1pqdata/aita_for_not_wanting_to_spend_holidays_with_my/",
        "body_summary": "Newish to Reddit so forgive me if my format is off.\n\nMy sister in law (who is married to my husband’s brother) sent my husband and I a text asking what day we were planning on heading to my husband’s dad’s house to celebrate Christmas so that they could meet us there.\n\nFor context, they went no contact with us for a little over a year and decided to reconnect this year. We tried reaching out multiple times to find out why and never got an answer. Fast forward, my husband’s brother finally reached out because he missed him and explained (I shit you not) that he was offended because I was surprised he had a Pinterest account and he didn’t like my tone when I showed my surprise. His wife also was offended by me for answering the multiple questions I was getting about when I was going to start...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 33,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-20T05:12:04.674318"
    },
    {
        "id": "1pqp0qp",
        "title": "AITA for saying my FIL doesn’t know how to parent?",
        "url": "/r/AmItheAsshole/comments/1pqp0qp/aita_for_saying_my_fil_doesnt_know_how_to_parent/",
        "body_summary": "So all of this blew up yesterday and I don’t know if I went too far or not. My husband (23m) had just dropped me (25f) off at work and was going to visit his parents’ house. When he pulled into their driveway my SIL (19F) comes outside and start screaming that he can’t park there. My SIL has a tendency to be rude and disrespectful especially to my husband/her brother. Yes ik she’s 19 but it has been that way for years. My husband is the type of person to put up with a lot but like most people can only handle so much. He told her to quit being a bitch. Well she goes inside to cry wolf to my FIL (68m) who starts berating my husband. Then my husband calls me at work and tells me the whole situation about to have a panic attack. I was so fed up with everything that I told him to go inside to t...",
        "reddit_judgments": {
            "YTA": 19,
            "NTA": 7,
            "ESH": 17,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 46
        },
        "total_judged": 46,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-20T05:12:21.226523"
    },
    {
        "id": "1pqeye1",
        "title": "AITA for saying 'NO' to a close friend's requests?",
        "url": "/r/AmItheAsshole/comments/1pqeye1/aita_for_saying_no_to_a_close_friends_requests/",
        "body_summary": "About 1 year ago, I met a girl on a single party (We both tried to meet guys there) and we become close friend.\n\nIn the beginning I really like her, so I always say yes to her requests. Few months later, I met my current bf, so she began to request things from me and my bf (as she is still single now).\n\nI began to feel exhausted from her high demanding requests, and I started to say no, but she starts blaming me to be a bad friend. I struggle because I really see her as one of my best friend, so I felt a bit guilty to say no to her.\n\nSome request I said no:\n\n\\- She saw my bf made Fruit Platter for me, she requested my bf made one for her too. However, I knew she hate fruits, and my bf actually did not want to serve her, so I said no.  \n  \n\\- She requests me & my bf to go shopping with her,...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 16,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-20T05:12:36.734774"
    },
    {
        "id": "1pqkj3y",
        "title": "AITA For exchanging or returning a few gifts from my Husband in the past?",
        "url": "/r/AmItheAsshole/comments/1pqkj3y/aita_for_exchanging_or_returning_a_few_gifts_from/",
        "body_summary": "My Husband will not let this go. There have been a few times in the 16 years we've been together that ive returned or exchanged gifts hes given me and he still to this day brings it up. One time he got me an expensive LV purse and I exchanged it and upgraded to one with a strap (because the purse was large and would last longer with a strap) and another was a gold necklace. I exchanged the gold necklace because it was very thin and too tight...it would eventually break and I didnt want him to lose out on the $600 he'd spent by just keeping it so instead I exchanged it for some earrings (because the jewelry store DID NOT have a longer chain option with their necklaces) \n\nIve received so many gifts from him that I love and wear all the time and still remind him of how much I adore them but \n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 21,
            "ESH": 0,
            "NAH": 7,
            "INFO": 1,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-20T05:12:52.566265"
    },
    {
        "id": "1pqcula",
        "title": "AITA for getting mad at my roommate for eating my leftovers",
        "url": "/r/AmItheAsshole/comments/1pqcula/aita_for_getting_mad_at_my_roommate_for_eating_my/",
        "body_summary": "I(23) person went out of my way between work shifts to get lemon chicken from my favorite restaurant and had previously gotten it over the weekend.(I like to add im not the best with eating leftovers and have previously given my roomate the okay if I leave food for 5 days it's up for grabs as I am really picky when it comes to food and have like 3 safe foods I can eat all the time others I might not finish.)  I was heading back to work and wanted to save some for later, so I put over half of my meal in my fridge. I went to work ate my snack then came home at 9pm. I saw my leftover pizza bites from 2 days ago on my roommates desk. I told them that I said I would eat them and they were going to be my lunch tomorrow. They responded with oh they been in the fridge for 2 days. I took the pizza ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 9,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 10
        },
        "total_judged": 10,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-20T05:13:07.948832"
    },
    {
        "id": "1pqf6hg",
        "title": "AITA for washing my roommates cups wrong",
        "url": "/r/AmItheAsshole/comments/1pqf6hg/aita_for_washing_my_roommates_cups_wrong/",
        "body_summary": "I 29F live with two roommates 28m and 26f. We constantly have struggled coming to a consensus about chores.\n\nBoth the roommates are extremely messy. Im talking food on the floor, use napkins everywhere, constant stuff on the floor messy. They generally dont pick up after themselves so all counters and tables quickly fill up with junk. \n\nThe kitchen is the worst as theres always burnt pans with cleaning chemicals, trash, and even rotting food sitting out in the open. Its so gross ive basically stopped cooking except when I have just cleaned. \n\nWhen I clean, I try to fill the dishwasher as much as possible. I also clear things, just not mold because I wont touch that. My roommates maintain that the dishes need a pre-wash. However they never do it in a timely manner, and the dishes just pile ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 22,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-20T05:13:23.421757"
    },
    {
        "id": "1pqlfwk",
        "title": "AITA for telling my brother to clean up his own mess?",
        "url": "/r/AmItheAsshole/comments/1pqlfwk/aita_for_telling_my_brother_to_clean_up_his_own/",
        "body_summary": "My (18F) brother (15M) refuses to clean up after himself. For context we share a full bathroom (i.e. toilet, shower, bath, sink all in the one room) and our bedrooms are each about a metre away from the bathroom. \n\nTonight, I walked into the bathroom and attempted to shut the door when my brother dashed out of his bedroom and said he needed to grab his water bottle (which was in the bathroom for reasons I am not privy to), so I let him into the bathroom to grab the bottle. When he did grab it he knocked down one of those portable travel mirrors with batteries in it (4 AA), and all of the batteries and a piece of the mirror went flying down to the floor. This within itself is fine, I understand that people make mistakes and I didn’t mind, he also apologised. But then he started walking back...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 10,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 10
        },
        "total_judged": 10,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-20T05:13:38.844347"
    },
    {
        "id": "1pqgvzh",
        "title": "AITA For not spending time with my sister in law?",
        "url": "/r/AmItheAsshole/comments/1pqgvzh/aita_for_not_spending_time_with_my_sister_in_law/",
        "body_summary": "Hi .. this is my first post ever on Reddit so I'm kinda nervous \nI'm a 24 years old female .. I don't have alot of mental energy to spend time with people in general even my own family \nIt might seem weird to you but in my country we live with our families till marriage \n\nMy brother got married in the apartment that I lived in for 19 years of my life since I was 4 .. and we moved to the apartment in the lower floor as dad wanted to give my brother the better apartment as it was customized to his needs and also wanted to have less stairs to worry about when he gets home from outside.. now we live on the 2nd floor and my brother and his wife on the 3rd floor \n\nShe is from our home town and its in a country side so people there do alot of stuff together like cooking and working around the hou...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 11,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 13
        },
        "total_judged": 13,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-20T05:13:54.249241"
    },
    {
        "id": "1pqgyv2",
        "title": "AITA for not giving my brother 400 dollars?",
        "url": "/r/AmItheAsshole/comments/1pqgyv2/aita_for_not_giving_my_brother_400_dollars/",
        "body_summary": "I’m 21 and a male. I moved out of my house in florida to live with my brother(R) and his wife(A). they were in texas at the time and i slept on their couch and paid them around 250 a month. they told me it would go to paying off their credit cards(so they could buy a house and move when the military told them to) and to pay for groceries and such. even though they told me it was optional they also said they didn’t really have another option if i wasn’t there to help. after a year of living there i go back to florida for a month because the military told them to move to pennsylvania. we never discussed me paying rent again and before i left texas i told them my worries about moving with them because the house would need 6 rooms to fit everyone. R told me id have a room both in texas and in ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 6,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 10
        },
        "total_judged": 10,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-20T05:14:09.681494"
    }
]