[
    {
        "id": "1jucqde",
        "title": "AITA for calling my ex-wife's new boyfriend names in front of my kids?",
        "url": "/r/AmItheAsshole/comments/1jucqde/aita_for_calling_my_exwifes_new_boyfriend_names/",
        "body_summary": "OP(46m)'s ex left him for their neighbor. They share custody of their kids. OP occasionally calls the neighbor names, sometimes within earshot of the kids. Ex complains. Friend agrees with her. OP asks AITA for calling the neighbor names in front of the kids.\n...",
        "reddit_judgments": {
            "YTA": 161,
            "NTA": 4,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 168
        },
        "total_judged": 168,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-09T05:11:23.916887"
    },
    {
        "id": "1ju7vmq",
        "title": "AITA for locking my room door so kids won’t get inside and ruin my stuff?",
        "url": "/r/AmItheAsshole/comments/1ju7vmq/aita_for_locking_my_room_door_so_kids_wont_get/",
        "body_summary": "OP (19F) locked her room to protect valuables from her poorly behaved young cousins visiting for dinner. An aunt needed to change her baby and tried to unlock OP's room. OP refused. Grandma scolded OP for disrespecting the family and their fertility, though OP said nothing about that. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 149,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 151
        },
        "total_judged": 151,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-09T05:11:27.248352"
    },
    {
        "id": "1jugui1",
        "title": "AITA for no longer wanting to give a HOUSE to my sister? My portion of inheritance",
        "url": "/r/AmItheAsshole/comments/1jugui1/aita_for_no_longer_wanting_to_give_a_house_to_my/",
        "body_summary": "OP and siblings planned to gift their inheritance (house) to sister. Sister's husband plans to sell it, causing sibling upset. OP proposed a 5-year residency stipulation, which he refused. Now OP questions if AITH for retracting gift.\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 136,
            "ESH": 2,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-09T05:11:30.657370"
    },
    {
        "id": "1jukipp",
        "title": "AITA for telling our moms they can’t join our vacation?",
        "url": "/r/AmItheAsshole/comments/1jukipp/aita_for_telling_our_moms_they_cant_join_our/",
        "body_summary": "OP and fiancé got a free Cabo trip. Both moms want to join, citing jealousy. OP feels guilty saying no, as the trip is essentially free. Fiancé wants alone time, no wedding talk. AITA for refusing to invite the moms?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 125,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 129
        },
        "total_judged": 129,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-09T05:11:34.294114"
    },
    {
        "id": "1ju9i0u",
        "title": "AITA for not letting my sister move in after she cheated on my best friend?",
        "url": "/r/AmItheAsshole/comments/1ju9i0u/aita_for_not_letting_my_sister_move_in_after_she/",
        "body_summary": "OP's sister cheated on OP's best friend (her fiancé). OP refused to let her stay after she was kicked out. Family is angry, saying family comes first. OP asks: AITA for prioritizing their friend's feelings over their sister's homelessness?\n...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 84,
            "ESH": 1,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 98
        },
        "total_judged": 98,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-09T05:11:36.064963"
    },
    {
        "id": "1junjqs",
        "title": "AITA for keeping a relationship with my brothers ex wife when they have two kids together?",
        "url": "/r/AmItheAsshole/comments/1junjqs/aita_for_keeping_a_relationship_with_my_brothers/",
        "body_summary": "OP and their mom planned a visit with OP's brother's ex-wife & kids. Brother, amidst a nasty divorce & suspecting infidelity, disapproved. Other sibling sided with him, accusing OP of disloyalty. AITA for supporting the ex-wife and children's relationship with the family?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 87,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 90
        },
        "total_judged": 90,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-09T05:11:37.655676"
    },
    {
        "id": "1jun7tt",
        "title": "AITA for setting a boundary about not wanting to talk about food, which led to my cousin cutting me off?",
        "url": "/r/AmItheAsshole/comments/1jun7tt/aita_for_setting_a_boundary_about_not_wanting_to/",
        "body_summary": "OP's autistic son has food issues. Cousin Kelsey's food talk triggered OP's anxiety. OP set a boundary asking Kelsey to avoid the topic. Kelsey reacted badly, cut off contact, and blocked OP. AITA for setting the boundary?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 59,
            "ESH": 0,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-09T05:11:39.068305"
    },
    {
        "id": "1jujfej",
        "title": "AITA for leaving home despite my mother and her partner’s finances?",
        "url": "/r/AmItheAsshole/comments/1jujfej/aita_for_leaving_home_despite_my_mother_and_her/",
        "body_summary": "OP (17F) is being kicked out by her mother for mental health issues, reporting her, and applying for UK disability benefits (Universal Credit). Mom says it'll make them lose the house. OP found supported housing but Mom begs her to stay for benefits. AITA for leaving?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 47,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-09T05:11:40.326901"
    },
    {
        "id": "1jui8d2",
        "title": "AITA for refusing to pay my roommate for a new stove?",
        "url": "/r/AmItheAsshole/comments/1jui8d2/aita_for_refusing_to_pay_my_roommate_for_a_new/",
        "body_summary": "OP, high, accidentally broiled instead of baking, causing a fire because roommate stored cutting boards in the broiler. Landlord wants them to pay for a new oven. Roommate wants OP to pay half. OP refuses, saying roommate shouldn't have stored wood there. AITA?\n...",
        "reddit_judgments": {
            "YTA": 77,
            "NTA": 38,
            "ESH": 9,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-09T05:11:44.688008"
    },
    {
        "id": "1jucbu7",
        "title": "AITA for not walking my roommate home when she didn't want to go to a frat party?",
        "url": "/r/AmItheAsshole/comments/1jucbu7/aita_for_not_walking_my_roommate_home_when_she/",
        "body_summary": "My roommate (19F) who we will call Emma, and I (18F) are freshman at the pretty big college. We got along fine and were friendly. One thing that I did notice about Emma was that she was extremely introverted. She didn't want to go to basically any of the freshman events and when I invited her out she often turned me down. She also didn't make an effort to meet new people or interact with people in our classes. We have the same major so we have a lot of classes together. She was almost always in our room if she wasn't in class. I never pressured her to go out or to events because I understand that it's not for everyone but I did want to meet people and have the “college experience.”\n\nOn Halloween weekend, me, Emma and two other girls decided to do a group costume. The other girls and I want...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 36,
            "ESH": 1,
            "NAH": 4,
            "INFO": 2,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-09T05:12:00.613065"
    }
]