[
    {
        "id": "1o3t89q",
        "title": "WIBTA to refuse to meet my dad after he traveled halfway across the world to visit me?",
        "url": "/r/AmItheAsshole/comments/1o3t89q/wibta_to_refuse_to_meet_my_dad_after_he_traveled/",
        "body_summary": "OP's dad is visiting after years of OP traveling to see him. OP needs to grocery shop due to spoiled food, which dad dislikes, preferring sightseeing. OP offered alternatives. Dad made a dinner reservation. OP feels disregarded & wants to decline. AITA if OP skips dinner?\n...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 47,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-12T05:09:52.011938"
    },
    {
        "id": "1o3stb3",
        "title": "WIBTA If I got married somewhere quite far from my family?",
        "url": "/r/AmItheAsshole/comments/1o3stb3/wibta_if_i_got_married_somewhere_quite_far_from/",
        "body_summary": "My boyfriend and I want to get married at a castle in Dorset (UK), my family live about a 5 hour drive away and I anticipate that they will take issue with this. I live far and don’t see them terribly often, likewise they make little effort to come and see me. \n\nThe venue is considerably closer to where my boyfriend’s family lives, however this didn’t sway our opinion on the location. My mother in particular will likely see this as me “choosing them” over my own family. Are we being selfish for wanting this?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 31,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-10-12T05:09:52.635197"
    },
    {
        "id": "1o3n587",
        "title": "AITA for asking for an apology from my sister after she didn’t properly take care of my dog like I asked",
        "url": "/r/AmItheAsshole/comments/1o3n587/aita_for_asking_for_an_apology_from_my_sister/",
        "body_summary": "OP, caregiver to their mom, left dog with sister while running errands. Dog had accident. OP asked for apology, sister refused, argued, and locked OP out. Sister now stonewalling OP. AITA?\n...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 4,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-10-12T05:09:53.612094"
    },
    {
        "id": "1o3slcv",
        "title": "AITA for not walking my dog long enough?",
        "url": "/r/AmItheAsshole/comments/1o3slcv/aita_for_not_walking_my_dog_long_enough/",
        "body_summary": "OP, 18, argues with their mom about dog-walking duties. Mom blames OP when the dog has accidents, even when OP covers for her. OP feels unfairly criticized and is asking if they are the asshole for feeling backed into a corner and questioning their own selfishness due to their mom's constant negativity.\n...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 3,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-10-12T05:09:54.833285"
    }
]