[
    {
        "id": "1l8p5bb",
        "title": "AITA: My girlfriend is mad that I don’t want to babysit her nephew on Father’s Day.",
        "url": "/r/AmItheAsshole/comments/1l8p5bb/aita_my_girlfriend_is_mad_that_i_dont_want_to/",
        "body_summary": "On Sunday it’s Father’s Day. My first Father’s Day. I want to spend it alongside my girlfriend and our 7 month old. However her brother asked us to babysit his kid on that day because him and his girlfriend want to go out. When my girlfriend asked me I politely said no as it’s my first Father’s Day and I would like to spend it as a little family. She got salty and a little mad and is now being passive aggressive. Her brother doesn’t like me and the feeling is mutual and we don’t speak. He only talks to my girlfriend when he needs a favour. His kid is great and we’ve babysat him multiple times. On my girlfriend’s first Mother’s Day it was just us 3. I don’t know why she can’t do the same for me. ",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 128,
            "ESH": 0,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-12T05:11:48.885446"
    },
    {
        "id": "1l8ydh2",
        "title": "AITA for not adjusting our China trip to my BIL’s cardio limits?",
        "url": "/r/AmItheAsshole/comments/1l8ydh2/aita_for_not_adjusting_our_china_trip_to_my_bils/",
        "body_summary": "OP planned a China trip for his family and sister's. Doug, sister's husband, struggled with the walking. OP left Doug to taxi back from a walk. Sister is upset at OP's inconsideration. AITA for prioritizing the trip's itinerary over Doug's limitations?\n...",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 135,
            "ESH": 14,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 168
        },
        "total_judged": 168,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-12T05:11:55.445772"
    },
    {
        "id": "1l8y5xt",
        "title": "WIBTA: Taking my coffee maker with me when I leave my current job",
        "url": "/r/AmItheAsshole/comments/1l8y5xt/wibta_taking_my_coffee_maker_with_me_when_i_leave/",
        "body_summary": "OP, a PhD student, owns a coffee maker at work. For years, they were the only user. Now a new, annoying coworker, Anne, uses it daily. OP is graduating and wonders: AITA if they take the coffee maker, even though Anne relies on it and OP doesn't need it, given Anne's difficult behavior?\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 91,
            "ESH": 0,
            "NAH": 4,
            "INFO": 3,
            "TotalJudged": 107
        },
        "total_judged": 107,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-12T05:12:00.539021"
    },
    {
        "id": "1l8tjdj",
        "title": "AITA for having my husband add me to his Costco account and take his ex wife off?",
        "url": "/r/AmItheAsshole/comments/1l8tjdj/aita_for_having_my_husband_add_me_to_his_costco/",
        "body_summary": "OP's husband added her to his Costco account, requiring his ex-wife to be removed. He informed the ex's boyfriend beforehand. The ex is now angry about losing her free membership. OP asks if they were wrong.\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 41,
            "ESH": 2,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-12T05:12:02.115562"
    },
    {
        "id": "1l8zfu7",
        "title": "AITA for siding with our son after he screamed at my wife?",
        "url": "/r/AmItheAsshole/comments/1l8zfu7/aita_for_siding_with_our_son_after_he_screamed_at/",
        "body_summary": "OP's wife tried forcing their autistic son to try on a girl's shirt for his cousin. Son yelled; OP defended him, arguing his wife should've known better and refuses to punish him. Wife is now cold. AITA?\n...",
        "reddit_judgments": {
            "YTA": 66,
            "NTA": 25,
            "ESH": 54,
            "NAH": 1,
            "INFO": 6,
            "TotalJudged": 152
        },
        "total_judged": 152,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-06-12T05:12:08.607606"
    },
    {
        "id": "1l8usi4",
        "title": "AITA for keeping the bridesmaid dress and wearing it after I got kicked out of the wedding",
        "url": "/r/AmItheAsshole/comments/1l8usi4/aita_for_keeping_the_bridesmaid_dress_and_wearing/",
        "body_summary": "OP was asked to be a bridesmaid but disagreed with the bride's strict demands. OP said she was out. The bride uninvited OP but refused to let her wear the bridesmaid dress to the wedding. OP wore it to brunch & posted pics, angering the bride. AITA?\n...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 96,
            "ESH": 5,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 109
        },
        "total_judged": 109,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-12T05:12:10.329210"
    },
    {
        "id": "1l8s81e",
        "title": "WIBTA if i didn’t attend a family dinner because of my sister?",
        "url": "/r/AmItheAsshole/comments/1l8s81e/wibta_if_i_didnt_attend_a_family_dinner_because/",
        "body_summary": "OP's sister gave away her cat despite promising a goodbye. Later, sister resold a concert ticket promised to OP for profit. Hurt by this, OP doesn't want sister at family dinner introducing her boyfriend. Mom refuses dinner without sister. AITA for refusing to attend if sister's there?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 31,
            "ESH": 3,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 39
        },
        "total_judged": 39,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-12T05:12:12.005759"
    },
    {
        "id": "1l8s1en",
        "title": "AITA for refusing to chip-in for alcohol at a suprise party?",
        "url": "/r/AmItheAsshole/comments/1l8s1en/aita_for_refusing_to_chipin_for_alcohol_at_a/",
        "body_summary": "Friend's party has a \"everyone splits cost\" rule, regardless of alcohol consumption. OP, a non-drinker, offered to calculate costs differently. Host refused. OP declined, left group. Host kicked OP's GF. Other friends said OP overreacted. AITA for not paying for alcohol they won't consume?\n...",
        "reddit_judgments": {
            "YTA": 40,
            "NTA": 92,
            "ESH": 9,
            "NAH": 10,
            "INFO": 5,
            "TotalJudged": 156
        },
        "total_judged": 156,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-12T05:12:16.343313"
    },
    {
        "id": "1l8zaya",
        "title": "AITA for not asking my mom to remove a pic in her home of my ex husband for my new husband",
        "url": "/r/AmItheAsshole/comments/1l8zaya/aita_for_not_asking_my_mom_to_remove_a_pic_in_her/",
        "body_summary": "OP's mom dislikes OP's husband & displays a photo of OP & ex. Husband hid the photo; mom replaced it. Husband is upset OP didn't demand its removal. OP chose peace. AITA?\n...",
        "reddit_judgments": {
            "YTA": 46,
            "NTA": 33,
            "ESH": 41,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 121
        },
        "total_judged": 121,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2025-06-12T05:12:18.958715"
    },
    {
        "id": "1l8lc6r",
        "title": "AITA-Telling my mom and sister to return their dog to the breeder.",
        "url": "/r/AmItheAsshole/comments/1l8lc6r/aitatelling_my_mom_and_sister_to_return_their_dog/",
        "body_summary": "OP, recovering from a motorcycle accident, questions sister's ability to care for a high-energy Aussie puppy. Sister works long hours; OP can't exercise him. OP suggests returning the puppy to the breeder (contractually obligated to take him back if sister can't care for it). Mom initially objects. AITA for prioritizing the puppy's wellbeing? (UPDATE: Sister agrees to contact the breeder.)\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 19,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-12T05:12:20.415195"
    }
]