[
    {
        "id": "1mly1jh",
        "title": "AITA for telling my husband to grow up and learn to be a father",
        "url": "/r/AmItheAsshole/comments/1mly1jh/aita_for_telling_my_husband_to_grow_up_and_learn/",
        "body_summary": "I (37f) told my husband (31m) that he needed to grow up and learn to be a better father. our daughter has very unruly and tangled hair. It's very difficult to manage, and I must admit that since getting a job, I haven't been keeping on top of it. our daughter is 8. \n\nToday, a friend of mine and I, spent hours on her hair, detangling it, brushing it, and making it look nice. Excited, we went to show her father, who instantly said, \"What's wrong with your hair?\" and \"It looks weird.\" She started crying and is currently sobbing in her bedroom. So I told him that he needed to grow up and learn to be a father, and he says I crossed a line. \n\nAITA?",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 34,
            "ESH": 47,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 98
        },
        "total_judged": 98,
        "reddit_verdict": "ESH",
        "fetched_utc": "2025-08-10T05:16:14.790321"
    },
    {
        "id": "1mlj5ld",
        "title": "WIBTA for not attending my twin sister's wedding two weeks after my firstborn's due date as she expects all family to meet the baby before the wedding?",
        "url": "/r/AmItheAsshole/comments/1mlj5ld/wibta_for_not_attending_my_twin_sisters_wedding/",
        "body_summary": "OP's pregnant. Twin sister, after prior miscarriage, is getting married two weeks post-due date. Sister demands baby only attend if close family meets it beforehand, causing OP stress about postpartum visits. Partner suggests not attending. OP fears being seen as AH by family for prioritizing her needs. WIBTA for skipping the wedding?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 90,
            "ESH": 2,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 96
        },
        "total_judged": 96,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-10T05:16:19.496807"
    },
    {
        "id": "1mm4o22",
        "title": "AITA for only getting pictures of my adopted daughter",
        "url": "/r/AmItheAsshole/comments/1mm4o22/aita_for_only_getting_pictures_of_my_adopted/",
        "body_summary": "OP adopted her friend's daughter, Avery. To have more photos of Avery for the house, OP took many pictures of her on vacation. Husband thinks OP focused too much on Avery, making the other kids feel unimportant. AITA for prioritizing Avery's photos?\n...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 88,
            "ESH": 0,
            "NAH": 15,
            "INFO": 2,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-10T05:16:21.938318"
    },
    {
        "id": "1mm21gn",
        "title": "AITA-Made people uncomfortable at a coffee shop",
        "url": "/r/AmItheAsshole/comments/1mm21gn/aitamade_people_uncomfortable_at_a_coffee_shop/",
        "body_summary": "OP sat in a comfy chair near 3 older men in a public coffee shop. They felt he joined their conversation. OP offered to move, but they left instead. AITA for sitting near them?\n...",
        "reddit_judgments": {
            "YTA": 29,
            "NTA": 60,
            "ESH": 5,
            "NAH": 3,
            "INFO": 7,
            "TotalJudged": 104
        },
        "total_judged": 104,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-10T05:16:23.937366"
    },
    {
        "id": "1mlnjnx",
        "title": "AITA for yelling at my mother-in-law?",
        "url": "/r/AmItheAsshole/comments/1mlnjnx/aita_for_yelling_at_my_motherinlaw/",
        "body_summary": "OP's wife miscarried. Her family blamed her. OP, hearing this, yelled at his mother-in-law, defending his wife. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 46,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-10T05:16:24.994139"
    },
    {
        "id": "1mlhgv2",
        "title": "AITA for snapping at my mom after a therapy session",
        "url": "/r/AmItheAsshole/comments/1mlhgv2/aita_for_snapping_at_my_mom_after_a_therapy/",
        "body_summary": "OP's parents often joked/stated they loved each other more. This hurt OP, who fears being second best. After therapy discussing this, OP told their mom her comments caused these feelings. Mom cried, dad got angry. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 44,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-10T05:16:26.112276"
    },
    {
        "id": "1mm5hf1",
        "title": "AITA for going off on my parents for not filling up my gas tank after borrowing my car for a month?",
        "url": "/r/AmItheAsshole/comments/1mm5hf1/aita_for_going_off_on_my_parents_for_not_filling/",
        "body_summary": "OP (25F) lent her car to her parents for a month. They returned it with an empty tank, causing it to not start. OP confronted her mom, who dismissed it as \"just gas.\" OP argues it's about courtesy. AITA for being upset they didn't refill the tank?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 41,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-10T05:16:27.371720"
    },
    {
        "id": "1mlz1sk",
        "title": "AITA for refusing to lend my lawn mower to my neighbor after repeated damage?",
        "url": "/r/AmItheAsshole/comments/1mlz1sk/aita_for_refusing_to_lend_my_lawn_mower_to_my/",
        "body_summary": "I'm (34F) and i really like keeping my yard nice and tidy. A while ago, my neighbor (40M) asked if he could borrow my lawn mower because his one broke. I said yes, but when he gave it back, I noticed the blades were dull and the handle was loose. I told him about it, and he said sorry but didn't fix it. \n\nNow he wants to borrow it again, and honestly, I'm hesitant. I told him no this time because I don't want to deal with more damage or fixing it. He seemed super annoyed, saying I'm being unreasonable and told this bs that neighbors should help each other out. \n\nSome people around here are starting to talk about it, and I'm wondering if I really am the asshole her. I just think it's fair to protect my stuff, especially after what happened. \n\nSo, AITA ? ",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 111,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-10T05:16:28.542765"
    },
    {
        "id": "1mlsh0j",
        "title": "AITA for refusing to pay for my new car",
        "url": "/r/AmItheAsshole/comments/1mlsh0j/aita_for_refusing_to_pay_for_my_new_car/",
        "body_summary": "OP's mom bought them a £4k car, expecting repayment from OP's savings account. OP repeatedly said they didn't want a car. Mom is now angry OP refuses to pay and is demanding gifts back. AITA for refusing to pay?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 52,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-10T05:16:30.057047"
    },
    {
        "id": "1mlv9v6",
        "title": "AITA I want to go on a small vacation with my sister and niece & nephew but I don’t want to be stuck paying for her boyfriend.",
        "url": "/r/AmItheAsshole/comments/1mlv9v6/aita_i_want_to_go_on_a_small_vacation_with_my/",
        "body_summary": "OP wants to take sister/kids on vacation but doesn't want sister's unemployed, socially awkward boyfriend to come. OP feels uncomfortable around him and doesn't want to pay for him. AITA for asking sister to exclude him?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 27,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-10T05:16:31.198018"
    }
]