[
    {
        "id": "1r7vnqh",
        "title": "WIBTAH if I don't attend to my friends baby shower because they said my pregnancy was an accident and that I didn't deserve it ?",
        "url": "/r/AmItheAsshole/comments/1r7vnqh/wibtah_if_i_dont_attend_to_my_friends_baby_shower/",
        "body_summary": "When I was pregnant with my first child two years ago, I had a really heavy feeling that I had to keep my pregnancy journey quite discreet because two of my friends (they are married) had difficulties with infertility. \n\nWhen my fiance and I were exprecting it was obvious that they were hurt and that after each encounter with us they would cry themselves to sleep. \n\nSo whenever we were together I wouldn't bring up the pregnancy or even all of the great new thrills I was living. I don't have much friends so it hurt me inside a lot nat to be able to appreciate the moment as much but I didn't wanted to hurt them just because baby was existing inside me. \n\nBut they talked to other friends of ours and said awful things such as :\n-\"The child was an accident\" (It wasn't, I prepared my body for ev...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 99,
            "ESH": 0,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 106
        },
        "total_judged": 106,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-19T05:52:30.268010"
    },
    {
        "id": "1r8k4d5",
        "title": "AITA My wife and I came home at 3am and my MIL acted like we were 16 sneaking into house",
        "url": "/r/AmItheAsshole/comments/1r8k4d5/aita_my_wife_and_i_came_home_at_3am_and_my_mil/",
        "body_summary": "My (41m) spouse (42f) and I had plans to go hiking and have dinner with friends. We made our kids (16m and 12f) sandwiches for lunch and called my spouse’s mom and ask to bring the kids dinner because we would be gone into the evening. We also told the kids we would be out late. We have left our kids at home alone multiple times and we fully trust them. We just wanted to make sure they had something decent instead of warming something up, hence asking MIL to bring food. Not once did we ask her to stay nor did we expect her to. We have told her many times, you can stay and watch tv (due to her not having internet) if she wants, but she never has to stay. \n\nMy spouse and I have an amazing day with great friends and after dinner, they wanted to go back to their place to hang out more, next th...",
        "reddit_judgments": {
            "YTA": 32,
            "NTA": 105,
            "ESH": 20,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 161
        },
        "total_judged": 161,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-19T05:52:41.503473"
    },
    {
        "id": "1r88ikd",
        "title": "AITA for correcting my coworker in front of customers after she kept correcting me?",
        "url": "/r/AmItheAsshole/comments/1r88ikd/aita_for_correcting_my_coworker_in_front_of/",
        "body_summary": "I’m 19F and I recently started a new job.\n\nThere’s a coworker (mid 20sF) who’s been there longer. From day one, she keeps correcting me. Not in a helpful way. More like… publicly.\n\nIf I say something slightly wrong, she jumps in.\n\nIf I explain something to a customer, she interrupts and “re-explains” it.\n\nEven when I’m right.\n\nAt first I ignored it because I’m new and I didn’t want drama.\n\nBut yesterday we had customers, and I was handling everything fine. A customer asked about a small detail, and I answered correctly.\n\nShe immediately cut me off and said, “No, that’s not how it works,” and gave the EXACT same explanation I just gave - just with different wording.\n\nThe customer looked confused.\n\nSo I said, calmly, “That’s actually what I just said.”\n\nShe went quiet. The customer awkwardly...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 42,
            "ESH": 3,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-19T05:52:49.149523"
    },
    {
        "id": "1r7w2t1",
        "title": "AITA for suggesting my recent ex gf not attend a friend’s wedding as my plus one?",
        "url": "/r/AmItheAsshole/comments/1r7w2t1/aita_for_suggesting_my_recent_ex_gf_not_attend_a/",
        "body_summary": "My gf and I recently broke up, we were in a 5 year relationship. We had our ups and downs and always seemed to work things out. She recently ended things permanently. I had tried to talk with her about it but she was adamant on ending things this time.\n\nI have been in a difficult spot emotionally, loved this girl a lot. During our relationship, I introduced here to a lot of my friends whom she became friends with. \n\nOne of my friends is getting married in a few months and we had our invitations months ago when we were still together. She was invited as my plus one. \n\nhere’s where things get a bit complicated. About a week after we broke up, she was with another guy. It wasn’t like she tried to spare me and hide it either. She was posting him on social media, etc. I unfortunately saw this a...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 54,
            "ESH": 0,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-19T05:52:56.978685"
    },
    {
        "id": "1r87duc",
        "title": "AITA for requesting my friend to buy her own food?",
        "url": "/r/AmItheAsshole/comments/1r87duc/aita_for_requesting_my_friend_to_buy_her_own_food/",
        "body_summary": "So for a bit of backstory. Im 20F when i was 18 i wasnt careful and i wasnt safe and i ended up pregnant, i had a job that gave a somewhat stable income and me and my partner made the decision to keep the child. I now have a beautiful 1 year old little boy. I wouldnt change my decision no matter if people think i made the wrong choice, i made my bed and i will lay in it. \n\nHowever, 2 months ago i lost my job, they had some cut backs in staff and unfortunately i was let go, ive been trying to find another job since, however surviving off of 1 income currently, we are drowning. Some weeks we are having to choose between feeding our child and paying our electric bill. \n\nI have a long distance friend who visits twice a year, i wouldnt say shes rich, but lets just say she has enough money in he...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 59,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-19T05:53:04.682397"
    },
    {
        "id": "1r81mg8",
        "title": "AITA for standing my ground when my roommate kept borrowing my expensive kitchen gear without asking",
        "url": "/r/AmItheAsshole/comments/1r81mg8/aita_for_standing_my_ground_when_my_roommate_kept/",
        "body_summary": "I’m 27F and I live with my roommate Jen who I’ve known since college We’re generally cool but lately she’s been pushing boundaries with my stuff, A bit of background I love cooking and baking as a hobby and over the years I’ve invested in some nice equipment like a high-end stand mixer good knives and specialty pans that I saved up for It’s not cheap stuff and I take care of it because it’s important to me Jen knows this I’ve mentioned it a few times when we’ve chatted about meals, About two months ago I started noticing my things were being used and not put back properly My mixer would have batter residue or my knives would be dull from being thrown in the dishwasher which I specifically said not to do At first I thought maybe I was forgetting but then I caught her using my cast iron skil...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 94,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 99
        },
        "total_judged": 99,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-19T05:53:12.519621"
    },
    {
        "id": "1r8jw7l",
        "title": "AITA for calling my grandparents after my mom ran away",
        "url": "/r/AmItheAsshole/comments/1r8jw7l/aita_for_calling_my_grandparents_after_my_mom_ran/",
        "body_summary": "so I (17F) was at a sleepover with my best friend (16M) and i texted my mom (39F) to pick me up early in the morning because i did not sleep well because homesickness and also because of how sleepovers get. \n\nWhen my mom went to go pick me up she was on a call on bluetooth speaker in the car in which she was arguing with my stepdad (43?M) which wasn't abnormal but i wasn't really paying a lot of attention as i was exhausted and just wanted to lay down. The call ended up getting very heated and my stepdad told my mom he was leaving and he hung up and left the house which was comfirmed by my brother (15M) who was still in the house with my sister (13F) aswell.\n\nSo my mom decided to rush home to see if she could still catch him and on our way we saw him walk around a park near a school area i...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 24,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-19T05:53:20.040083"
    },
    {
        "id": "1r8hkgz",
        "title": "AITA for telling my Russian grandfather not to critique how I spoke to a doctor while translating?",
        "url": "/r/AmItheAsshole/comments/1r8hkgz/aita_for_telling_my_russian_grandfather_not_to/",
        "body_summary": "For context, I (21M) am Russian American and have been living in the US since childhood. I speak perfect English and perfect Russian, which was my first language. My dad's parents  also moved here from our hometown in Russia, but barely speak the language. They can read and interpret some words, but cannot hold any meaningful conversation in English. My grandmother unfortunately has multiple health issues, so my father or I are frequently driving her to appointments and translating whenever the doctor isn't Russian-speaking. \n\nToday, I visited them as usual, to help my Grandmother with a video call. The doctor was American and obviously didn't speak a word of Russian, so I was the median. It went fine, but there were some connection issues. The doctor herself was this older matter-of-fact ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 43,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-19T05:53:27.727809"
    },
    {
        "id": "1r8nbe0",
        "title": "AITA for “accidentally” telling my parents about my sister’s pregnancy because I was tired of keeping the secret?",
        "url": "/r/AmItheAsshole/comments/1r8nbe0/aita_for_accidentally_telling_my_parents_about_my/",
        "body_summary": "I (24F) have a younger sister (21F). We’re not really close, but we’re not enemies either. We always had a competitive sibling dynamic.\n\nAbout two months ago, she told me she was pregnant. It wasn’t planned, and she was freaking out about how our parents would react. They’re pretty traditional and can be judgmental.\n\nShe made me promise not to tell anyone. Like full you cannot say a word until I’m ready serious. I agreed but I was hesitant about it.\n\nShe still lives at home, and I visit my parents pretty often. My mom kept making comments to me about how my sister has been “moody” and “gaining weight” and asked if I knew what was going on. Every time, I had to pretend I didn’t. I started getting tired of keeping this up quickly.\n\nI also felt weirdly left out of everything. She wouldn’t upd...",
        "reddit_judgments": {
            "YTA": 104,
            "NTA": 51,
            "ESH": 12,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 169
        },
        "total_judged": 169,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-19T05:53:37.655696"
    },
    {
        "id": "1r84s4v",
        "title": "AITA for leaving my porch light on at night?",
        "url": "/r/AmItheAsshole/comments/1r84s4v/aita_for_leaving_my_porch_light_on_at_night/",
        "body_summary": "For the past two months we’ve been dog watching some elderly dogs for my in-laws while they’re traveling, and keep the back porch light on so they can see when they go outside at night to use the bathroom since they’re both a bit blind. For context we live in a rural midwest town of \\~1k people, with mostly older folks and a few middle aged families.\n\nLast night my neighbor (a quarter acre behind us) flashed a very bright strobe light into our windows around 9pm. My husband went out to talk to them and my neighbor justified flashing the light because he wanted to get our attention and “never sees us”, when I’m home all day (working from home) and am outside with the dogs often. He then went on that he “moved out here to get away from lights” and “couldn’t see the stars anymore”. The dude w...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 101,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 116
        },
        "total_judged": 116,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-19T05:53:47.358600"
    }
]