[
    {
        "id": "1mqbll1",
        "title": "AITA for laughing when my wife fell and pooped her pants because I thought it was a prank ?",
        "url": "/r/AmItheAsshole/comments/1mqbll1/aita_for_laughing_when_my_wife_fell_and_pooped/",
        "body_summary": "I (33m) think my wife (31f) is genuinely funny but her love of pranks and toilet humor can be a bit much. One day, I was in the living room. My wife ran in holding her tummy. She slipped and fell. Then she said something like, crap I pooped my pants. \n\nEverything about it, seemed like a prank she would do. From the double meaning phrase, to the toilet humor, to the physical comedy. Despite the fact that I dislike most of her pranks, I found this one funny. But it wasn't pranking, when I realized, I tried to help her up. She told me not to touch her. \n\nShe sarcastically called me husband of the year for laughing at her. I explained but she said I should have known it wasn't a prank because she did a similar one before and she doesn't repeat the same pranks. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 91,
            "ESH": 2,
            "NAH": 9,
            "INFO": 2,
            "TotalJudged": 105
        },
        "total_judged": 105,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-15T05:12:56.205932"
    },
    {
        "id": "1mq29yb",
        "title": "Update: WIBTA if I kick my boyfriend's sister out of our house?",
        "url": "/r/AmItheAsshole/comments/1mq29yb/update_wibta_if_i_kick_my_boyfriends_sister_out/",
        "body_summary": "OP broke up with her boyfriend, Tom, due to realizing she was being mistreated by him and his sister, Emma. She used money sent by Tom and Emma's parents for Emma's expenses to cover those expenses & then booked a spa trip for herself and friends. AITA for using the remaining money this way?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 5,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 6
        },
        "total_judged": 6,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2025-08-15T05:12:57.492223"
    },
    {
        "id": "1mq6vkg",
        "title": "AITA for getting my colleague in trouble for calling me his work wife?",
        "url": "/r/AmItheAsshole/comments/1mq6vkg/aita_for_getting_my_colleague_in_trouble_for/",
        "body_summary": "OP, training a US colleague, felt uncomfortable due to his flirting and \"work wife\" comments. She asked him to stop, but he didn't. She reported him to her boss. He stopped, but became cold. AITA for reporting him, potentially overreacting due to cultural differences?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 144,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-15T05:12:59.455411"
    },
    {
        "id": "1mpx9ty",
        "title": "AITA for rearranging  the seats at my daughter’s class get together because I didn’t want a reoccurrence of an accident that happend the last time with  some kids been left out",
        "url": "/r/AmItheAsshole/comments/1mpx9ty/aita_for_rearranging_the_seats_at_my_daughters/",
        "body_summary": "OP's daughter planned a party. OP, recalling a past event, rearranged the seating to encourage mingling while the daughter was out. Daughter is upset, accusing OP of ruining her vision. OP wonders AITA for changing the setup without permission?\n...",
        "reddit_judgments": {
            "YTA": 179,
            "NTA": 0,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 180
        },
        "total_judged": 180,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-15T05:13:02.490687"
    },
    {
        "id": "1mpxnez",
        "title": "AITA for demanding my kids back immediately after my parents left them with \"strangers\" at a campground without telling me?",
        "url": "/r/AmItheAsshole/comments/1mpxnez/aita_for_demanding_my_kids_back_immediately_after/",
        "body_summary": "OP's parents watched their kids, then the grandfather had a medical emergency. Grandma left the kids with unknown friends. OP found out late & demanded their return, costing $300 in Uber fees. Parents guilted OP, calling them an overreactor. AITA for insisting on their kids' immediate return?\n...",
        "reddit_judgments": {
            "YTA": 77,
            "NTA": 52,
            "ESH": 8,
            "NAH": 2,
            "INFO": 7,
            "TotalJudged": 146
        },
        "total_judged": 146,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-15T05:13:06.914985"
    },
    {
        "id": "1mq7sv4",
        "title": "AITA- I called my sis SHADY for trying to sell a television that was still mounted to my wall - on marketplace.",
        "url": "/r/AmItheAsshole/comments/1mq7sv4/aita_i_called_my_sis_shady_for_trying_to_sell_a/",
        "body_summary": "OP's sister, facing financial issues, sold a TV she left at OP's house (now used daily by OP) on Facebook Marketplace without OP's consent. OP confronted her, calling her actions disrespectful. To resolve the conflict, OP's boyfriend paid her sister $85 to keep the TV. AITA?\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 52,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-15T05:13:08.868434"
    },
    {
        "id": "1mpxvux",
        "title": "AITA for \"pretending\" to be a Christian?",
        "url": "/r/AmItheAsshole/comments/1mpxvux/aita_for_pretending_to_be_a_christian/",
        "body_summary": "OP's boyfriend wants her to convert to Christianity. At his mom's dinner, OP participated in prayer and discussed a Bible passage. Her boyfriend then revealed she's not Christian and refuses to convert. OP argues she was respecting tradition, he says she was deceptive. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 132,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-15T05:13:11.791481"
    },
    {
        "id": "1mq326x",
        "title": "AITA? Son's gf's mom borrowed our car, brought it back empty. I told ds never to do that if you borrow a car. He told gf I said her mom was rude. Who is the AH?",
        "url": "/r/AmItheAsshole/comments/1mq326x/aita_sons_gfs_mom_borrowed_our_car_brought_it/",
        "body_summary": "OP invited DS & GF to vacation home; GF's mom tagged along. Mom borrowed OP's car, returned it empty after 5+ hours. OP complained to DS about Mom's behavior. Mom learned of this, confrontation ensued. AITA?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 60,
            "ESH": 9,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 76
        },
        "total_judged": 76,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-15T05:13:13.558402"
    },
    {
        "id": "1mq8qg0",
        "title": "AITA for including all three of my mom's husbands in my child's family tree project?",
        "url": "/r/AmItheAsshole/comments/1mq8qg0/aita_for_including_all_three_of_my_moms_husbands/",
        "body_summary": "OP's son made a family tree. He wanted to include \"John,\" his mom's ex, as \"grandpa.\" OP agreed, adding her current husband \"Jerry.\" Mom saw it, got angry, and feels OP made her look bad. AITA?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 45,
            "ESH": 1,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-15T05:13:14.797210"
    },
    {
        "id": "1mqihj0",
        "title": "AITA for saying no to babysitting after my sister insulted my job?",
        "url": "/r/AmItheAsshole/comments/1mqihj0/aita_for_saying_no_to_babysitting_after_my_sister/",
        "body_summary": "My sister asked me to watch her 3 kids last weekend so she could go to a wedding. I work from home and had a project deadline that same day, but I was still willing to rearrange my schedule to help her out.\nWhen I told her I’d just need a quiet space for a few hours to get my work done while watching the kids, she laughed and said my online job isn’t real work and that I sit around all day.\nThat comment really bothered me because I work hard and pay all my own bills. I told her if she didn’t respect what I do, then I wouldn’t be comfortable helping. She called me selfish and hung up.\nNow my parents are upset because she had to skip the wedding, but I feel like I was doing her a favor and she was the one who ruined it with the insults.\nAITA?\n",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 29,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-15T05:13:15.120548"
    }
]