[
    {
        "id": "1qpj13f",
        "title": "AITA for refusing to share my food with my girlfriend?",
        "url": "/r/AmItheAsshole/comments/1qpj13f/aita_for_refusing_to_share_my_food_with_my/",
        "body_summary": "The Lord of the Rings is doing a theatrical rerun in my city so me (27m) and gf (27f) decided to go watch the Two Towers (extended edition) last night. We do not currently live together.\n\nThere’s a bar that I really love right next to the theatre. I asked if we could go to this restaurant after the movie because I really wanted to get this specific dish - it’s lattice style fries that are fried in beef tallow, covered with green onions, bacon, house seasoning, and comes with the best hollandaise sauce I’ve ever tasted in my life. You can get fries for one (smaller portion) or fries for two (much larger portion) for a couple extra dollars.\n\nShe didn’t realize that the movie was nearly 4 hours long, and it ended at around 10pm. By this time she said she was tired and didn’t want to go to the...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 141,
            "ESH": 5,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 153
        },
        "total_judged": 153,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-29T05:36:21.647854"
    },
    {
        "id": "1qp2vpv",
        "title": "AITA for not covering my coworkers shift even tho she said it was an emergency?",
        "url": "/r/AmItheAsshole/comments/1qp2vpv/aita_for_not_covering_my_coworkers_shift_even_tho/",
        "body_summary": "ok so i (21m) work part time at a resturant while im in school. its already kinda alot balencing work + classes but i make it work. i usually work weekends and i almost never call in sick or ask for days off.\n\nlast week i finally had a saturday free. like actually free free. no work no school nothing. i even told my manager earlier in the week i wasnt avaliable just in case and he said it was fine.\n\nfriday night one of my coworkers (22f) texts me asking if i can cover her shift saturday. i ask why and she just says she has an “emergency” and really needs someone. i asked if it was family or medical (not details) and she just said “personal stuff”.\n\ni told her sorry but i couldnt because i already made plans and really needed the day off. she kept pushing and saying she *never* gets help fr...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 34,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-29T05:36:29.317993"
    },
    {
        "id": "1qpr6t6",
        "title": "AITA for ordering water at a restaurant?",
        "url": "/r/AmItheAsshole/comments/1qpr6t6/aita_for_ordering_water_at_a_restaurant/",
        "body_summary": "Some context my husband and I make good money and live below our means generally. We are currently enjoying a winter vacation in a mountain hotel (4000€ for the week approximately) hotel includes breakfast en dinner but not drinks at dinner. \n\nThe hotel charges 4 euro for a litre of water (just tap water but all the water in the mountain village comes from a spring). Although I think this is a little much from the restaurant it’s not something I let ruin my mood. \n\nI have astma so after a day of being outside in the mountains I’m generally extra thirsty. \n\nAt diner my husband made a remark about me drinking as much water yesterday at dinner as it costs to fill our pool at home.\n\nWe went ordered a bottle of wine and water when we sat down to dinner. and during the dinner I ordered another w...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 54,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 58
        },
        "total_judged": 58,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-29T05:36:37.258473"
    },
    {
        "id": "1qp9932",
        "title": "WIBTA for calling out my friend lying about making reservations",
        "url": "/r/AmItheAsshole/comments/1qp9932/wibta_for_calling_out_my_friend_lying_about/",
        "body_summary": "I, F35, have a friend, F35. Let's call her A. I've known A since grade school.\n\nHer birthday is coming up and she wanted to go to a restaurant for a group dinner. I asked if she made reservations at the restaurant and she said yes. She said it was x day at x time for party size of x under her name.\n\nFor context, last year for her birthday, A planned a group dinner thing but did not make reservations. She picked a place that does not do reservations. I had recommended to her then to pick a backup. A mentioned she would and she would pick a place that does take reservations. I took her word for this. The wait at the first restaurant (the one that doesn't do reservations) was over an hour wait. We then find out she did not make reservations at the back up restaurant. The back up was also more...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 8,
            "ESH": 4,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2026-01-29T05:36:44.938031"
    },
    {
        "id": "1qpkrei",
        "title": "AITAH for embarrassing my bf at his job?",
        "url": "/r/AmItheAsshole/comments/1qpkrei/aitah_for_embarrassing_my_bf_at_his_job/",
        "body_summary": "Yesterday I didn't have pockets so I gave my bf my card and he put it in his wallet. I hadn't really been out since so my boyfriend went to work with my card still in his pocket. I got a message from the electric company today saying that our account was passed due but it wasn't, I was unable to reach anyone, the system wouldn't let me make a payment online, Yada yada yada. \n\nI went up to his job when it wasn't busy (it was just him and another clerk) I ordered food from the other clerk and then asked my bf for my payment card, he handed me the card and asked me if I was going shopping in an upbeat sort of way. I said \"no unfortunately there's something wrong with the electric bill, I don't know. I'm trying to figure it out.\" He responded it in an angry way \"what did you do?\" I was taken a...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 34,
            "ESH": 2,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-29T05:36:52.731587"
    },
    {
        "id": "1qptthk",
        "title": "AITA for not moving my sons birthday party ?",
        "url": "/r/AmItheAsshole/comments/1qptthk/aita_for_not_moving_my_sons_birthday_party/",
        "body_summary": "AITA\n\nHi everyone !\n\nI f(32)have two children , a 5 year old daughter and a 3 year old son.\n\nHe will be 4 this summer in July .\n\nHis birthday this year falls on a Saturday so obviously in my head it’s an easy day to plan his birthday . It’s months away but in my mind it’s set.\n\nLast week. My brother in laws new girlfriend wrote me to tell me she was planning her daughters birthday that Saturday and wanted to «  save it for her «  .\n\nHer daughters actual birthday is a couple days later .\n\nShe’s been with my brother In law for about 5-6 months now .. she makes her daughter call him daddy and calls my nieces her daughters sisters … listen whatever works for you . For me that’s insane this early on .\n\nAnywho… I told her unfortunately I planned on doing my sons birthday that day and didn’t want...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 57,
            "ESH": 1,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-29T05:37:00.692536"
    },
    {
        "id": "1qpqzgq",
        "title": "AITA for not letting my mom give my brother my laptop",
        "url": "/r/AmItheAsshole/comments/1qpqzgq/aita_for_not_letting_my_mom_give_my_brother_my/",
        "body_summary": "i (19f) live at home with my mom and younger brother. today, she said shes going to give him my laptop. no asking, no ‘lemme run this by you first’, just straight up giving him my things. granted, i did not buy my laptop myself, she handed it down to me after she got herself a new one. my brother (young teenager) has most things in our home, he has his own xbox, nintendo switch, piano, laptop, phone, and collectables. he previously took my old ipad for his own hobbies as well as had his own TV in his room way younger than i did as a kid. i have my phone, headphones, and laptop. i told my mom i did not want her to give him my laptop since he has his own and is already constantly getting into trouble and getting his things temporarily taken away. she immediately called me greedy and selfish ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 15,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 19
        },
        "total_judged": 19,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-29T05:37:08.322967"
    },
    {
        "id": "1qpl9ds",
        "title": "WIBTA for informing a friend that the DJ from his wedding posted a video of his guest acting aggressively to him?",
        "url": "/r/AmItheAsshole/comments/1qpl9ds/wibta_for_informing_a_friend_that_the_dj_from_his/",
        "body_summary": "About 4 months ago a friend of mine got married. \n\nWhile doom scrolling on facebook I happend upon a short video from a DJ's point of view. In it a seemingly drunk and angry man (about 50-60ish years old) approaches him and threaten to spill liquids all over his electrical equipment if he won't play him a song he likes. In the video the face of the man is censored, not his voice, and it shows several times when the old man approaches him and get angrier. Until finally the dj finds the right moment to play the song he asked. After that the angry man comes to shake his hand and leaves.\n\nA moment of shock hit me when i realized i recognise the place, and the people in the background. A quick check of the photos from that friend's wedding  affirmed what i suspected, that this is my friends wed...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 3,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 7
        },
        "total_judged": 7,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-29T05:37:15.841368"
    },
    {
        "id": "1qpxyo1",
        "title": "AITA for calling the cops on my neighbors,and banning their kids from being on our property",
        "url": "/r/AmItheAsshole/comments/1qpxyo1/aita_for_calling_the_cops_on_my_neighborsand/",
        "body_summary": "Ok maybe I’m crazy,but my neighbors dog I’ve had to call animal control and the cops on…it gets in our trash throwing it all over our yard,attacked my sister and a door dasher and was constantly on our property.the last time a cop had to tell them they couldn’t have it on our property at all.its not a small dog either,its a Great Dane hound dog mix.Today..there’s a new dog,it’s friendly.but there are footprints all over our yard.dogs and kids included.their kids are sledding on our hill(ours is small they have a HUGE one on the opposite side.) where they are sledding…at the bottom is straight bricks (which they already played with and we told the owner.).we’ve warned them we didn’t want them on our property anymore because ontop of that they also left our hose on for 2 days.and it flooded ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 15,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 15
        },
        "total_judged": 15,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-29T05:37:23.304835"
    },
    {
        "id": "1qps6xe",
        "title": "AITA for not meeting my mom’s new boyfriend?",
        "url": "/r/AmItheAsshole/comments/1qps6xe/aita_for_not_meeting_my_moms_new_boyfriend/",
        "body_summary": "My (29m) mom(52f) and dad(57m) divorced about 2 years ago because she was having an affair with another man who is unknown to me. Im not sure how long the affair was happening but i believe it was for a while. The divorce was very ugly and my childhood home was sold. Me and mom , and dad to were close before this and now our relationship is strained. My mom wants me to meet her new boyfriend because they have announced there wedding and i told her i wont meet him and refuse to be at the wedding. AITAH?\n\nTLDR: my mom cheated on my dad and now wants me to meet her new boyfriend.",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 32,
            "ESH": 1,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-29T05:37:23.885109"
    }
]