[
    {
        "id": "1ndcvah",
        "title": "AITA for taking my boyfriend to a birthday dinner at a restaurant across from my sister’s apartment without inviting her?",
        "url": "/r/AmItheAsshole/comments/1ndcvah/aita_for_taking_my_boyfriend_to_a_birthday_dinner/",
        "body_summary": "OP's sister insists OP not frequent her neighborhood's amenities without her. OP went to a restaurant near her sister's apartment with her boyfriend (gifted by his sister), texting a heads-up but not inviting her. The sister is angry. AITA?\n...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 120,
            "ESH": 2,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-11T05:10:38.844160"
    },
    {
        "id": "1ndgc13",
        "title": "AITA for accidentally tricking my friend?",
        "url": "/r/AmItheAsshole/comments/1ndgc13/aita_for_accidentally_tricking_my_friend/",
        "body_summary": "OP's friend A snooped through his clearly labelled worldbuilding binder. A tried to buy a fictional pepper from the binder, embarrassing herself when her roommate looked it up. A called OP an AH, accusing him of setting her up. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 53,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-11T05:10:39.970040"
    },
    {
        "id": "1ndanxt",
        "title": "UPDATE: AITA for purposefully missing meeting my sisters biological family",
        "url": "/r/AmItheAsshole/comments/1ndanxt/update_aita_for_purposefully_missing_meeting_my/",
        "body_summary": "OP avoided family after a falling out. Dad's injury led to a visit, where OP broke down to his sister, revealing issues. This mended fences, leading to family bonding and a career opportunity. AITA for previously avoiding them?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 0,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 2
        },
        "total_judged": 2,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2025-09-11T05:10:41.368449"
    },
    {
        "id": "1ndpjjo",
        "title": "AITA I made my sculpture \"wrong\" so I walked out of class.",
        "url": "/r/AmItheAsshole/comments/1ndpjjo/aita_i_made_my_sculpture_wrong_so_i_walked_out_of/",
        "body_summary": "OP, an experienced textile artist/sculptor, designs a phoenix reliquary to burn. Instructor questions its 3D-ness & passport choice, doesn't understand the symbolism. OP defends their work, frustrated by the lack of clear instructions & perceived misunderstanding, then drops the class. AITA?\n...",
        "reddit_judgments": {
            "YTA": 20,
            "NTA": 15,
            "ESH": 9,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-09-11T05:10:43.643753"
    },
    {
        "id": "1ndfh2u",
        "title": "AITA for telling my friend that her making jokes about the cost of her home sounds spoilt and disconnected?",
        "url": "/r/AmItheAsshole/comments/1ndfh2u/aita_for_telling_my_friend_that_her_making_jokes/",
        "body_summary": "OP(17F), from a low-income family, called out her wealthy friend Emma(17F) for acting \"broke\" and joking about wealth. OP said Emma sounded spoiled & wouldn't understand struggle, leading to distance. AITA?\n...",
        "reddit_judgments": {
            "YTA": 53,
            "NTA": 7,
            "ESH": 6,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 70
        },
        "total_judged": 70,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-09-11T05:10:45.720807"
    },
    {
        "id": "1nd5sxf",
        "title": "AITA for refusing to fly out to visit my family this year?",
        "url": "/r/AmItheAsshole/comments/1nd5sxf/aita_for_refusing_to_fly_out_to_visit_my_family/",
        "body_summary": "OP(30F) always visits family in AZ/WI. This year, due to financial issues, OP can't travel. Family is upset. OP suggested they visit her instead. They declined, citing costs, despite other recent travel. OP feels she's the only one making an effort. AITA for refusing to visit and being upset no one visits her?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 61,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 64
        },
        "total_judged": 64,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-11T05:10:47.259579"
    },
    {
        "id": "1ndgew0",
        "title": "AITA for bringing an epoxy encased bat with me when I moved in with my boyfriend",
        "url": "/r/AmItheAsshole/comments/1ndgew0/aita_for_bringing_an_epoxy_encased_bat_with_me/",
        "body_summary": "OP (23F) brought a boxed, epoxy-encased bat to her new home shared with her boyfriend (33M) and his brother (27M). They were grossed out. They agreed she can keep it, but not display it. OP asks AITA for bringing taxidermy into a shared home when others are disgusted.\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 79,
            "ESH": 0,
            "NAH": 11,
            "INFO": 0,
            "TotalJudged": 92
        },
        "total_judged": 92,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-11T05:10:49.285830"
    },
    {
        "id": "1ndvpvv",
        "title": "AITA for declining to witness-sign my friend’s private sale paperwork because I wasn’t actually present at the exchange, and asking them to redo it with someone else?",
        "url": "/r/AmItheAsshole/comments/1ndvpvv/aita_for_declining_to_witnesssign_my_friends/",
        "body_summary": "So a  friend showed up with a stack of sale papers and a pen and asked me to be the witness. I was not present for payment or handoff. He wanted a quick signature to wrap it up. That puts my name on facts I cannot verify. I kept it short and said I would not sign. I pulled up the public library notary hours, sent the schedule, and told them to redo it clean. I left the pen on the table and stepped back.\n\nHe pushed the papers toward me, and listed favors I supposedly owe then guilt-tripped me saying other friend would sign without thinking.  Never in my life that I will attach my name to a deal that I did not witness. They grabbed the papers and left without a goodbye. I am willing to go with them to a notary at a set time, but I will not fake a witness. AITA?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 24,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 24
        },
        "total_judged": 24,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-11T05:10:49.588746"
    },
    {
        "id": "1ndxx1f",
        "title": "AITA for walking out of a pool party after people teased me when my bikini top slipped?",
        "url": "/r/AmItheAsshole/comments/1ndxx1f/aita_for_walking_out_of_a_pool_party_after_people/",
        "body_summary": "OP, insecure about her small chest, had a bikini malfunction at a party where guys made crude jokes. OP left angrily, calling them assholes. Boyfriend said OP overreacted & made it awkward. AITA for leaving?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 73,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 75
        },
        "total_judged": 75,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-09-11T05:10:51.029311"
    },
    {
        "id": "1nd7ckb",
        "title": "AITAH for telling my parents about my super religious friend's bf?",
        "url": "/r/AmItheAsshole/comments/1nd7ckb/aitah_for_telling_my_parents_about_my_super/",
        "body_summary": "OP confronted Z about avoiding her. Z revealed she hates OP for betraying her college secret (boyfriend) to OP's mom, risking Z's expulsion/disownment due to her religious parents. OP apologized then, but Z still resents OP. OP thinks Z is overreacting since nothing happened, and Z was irresponsible for dating. AITA?\n...",
        "reddit_judgments": {
            "YTA": 146,
            "NTA": 1,
            "ESH": 3,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 151
        },
        "total_judged": 151,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-09-11T05:10:54.044173"
    }
]