[
    {
        "id": "1r0wylc",
        "title": "AITA for wanting my Spanish teacher to stop calling me by the Spanish version of my name?",
        "url": "/r/AmItheAsshole/comments/1r0wylc/aita_for_wanting_my_spanish_teacher_to_stop/",
        "body_summary": "My name is John Paul, but I go by J.P. All my friends, teachers, and family members call me J.P. All that is, except for my high school Spanish teacher. In Spanish, J is pronounced as \"Hota/jota\" and P is pronounced as \"Pay/pe\". So my Spanish teacher always keeps calling me \"Hota Pay\" in class instead of my real nickname J.P. \n\nWhen he first said \"Hota Pay\", I found it a bit funny and laughed with the class. I thought it was a one off remark by my teacher. But he kept calling me \"Hota Pay\" even beyond the first day of class and it is getting annoying now. I once asked him after class if he could please call me J.P. But my teacher refused, saying this was Spanish class and that \"Hota Pay\" was the Spanish equivalent of my name. He said he wasn't calling me any rude words, he was just transla...",
        "reddit_judgments": {
            "YTA": 41,
            "NTA": 58,
            "ESH": 2,
            "NAH": 10,
            "INFO": 5,
            "TotalJudged": 116
        },
        "total_judged": 116,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-11T06:03:17.231058"
    },
    {
        "id": "1r1h0e6",
        "title": "AITA for asking my friend to pay me back for the wine he drank while house sitting??",
        "url": "/r/AmItheAsshole/comments/1r1h0e6/aita_for_asking_my_friend_to_pay_me_back_for_the/",
        "body_summary": "so i (26f) had my friend (27m) watch my place and my cat for the weekend. i told him he could \"help himself to whatever\" in the kitchen which i thought was just like... common sense for snacks and stuff?\n\ni get back and realize he opened this $120 bottle of vintage barolo i was saving for my promotion. he literally drank the whole thing alone while watching netflix. when i asked him about it he got all weird and said i \"gave him permission\" bc the wine was in the kitchen. like okay but who drinks a hundred dollar bottle of wine without asking first???\n\ni sent him a venmo for $80 (gave him a discount lol) and now hes calling me tacky and told our group chat im a bad host. i feel like there’s literally an unwritten rule of guest logic where u dont touch the most expensive thing in the house....",
        "reddit_judgments": {
            "YTA": 141,
            "NTA": 1,
            "ESH": 8,
            "NAH": 0,
            "INFO": 13,
            "TotalJudged": 163
        },
        "total_judged": 163,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-11T06:03:37.595110"
    },
    {
        "id": "1r10wvq",
        "title": "AITA for yelling at my neighbor over his constantly blaring car alarm?",
        "url": "/r/AmItheAsshole/comments/1r10wvq/aita_for_yelling_at_my_neighbor_over_his/",
        "body_summary": "I (36M) live with my wife in a suburb. Our neighbors Dan and wife (couples in their 40s) are nice. We’ve been next to each other for five years with no problems. They have a 10 year old boy.   \nIn the past three months every Saturday and Sunday morning at about 7:30AM their car alarm goes off. Full sirens, honking, the whole deal. It lasts exactly one minute. It was wrecking our weekend sleep.  \nAfter a few weeks I asked Dan about it politely when I saw him outside. He said “Oh that old thing? It’s sensitive to the morning dew I think. Sorry” That was it. No fix just an apology that changed nothing. Another month went by and same thing.  \n One Saturday I lost it. I was lying there waiting for it and when it started I marched straight over to their driveway in my sleep clothes. Dan was ther...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 106,
            "ESH": 2,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 114
        },
        "total_judged": 114,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-11T06:03:46.246162"
    },
    {
        "id": "1r10i7q",
        "title": "WIBTA for wearing headphones and sleeping for an entire 8-hour flight after agreeing to sit next to an acquaintance?",
        "url": "/r/AmItheAsshole/comments/1r10i7q/wibta_for_wearing_headphones_and_sleeping_for_an/",
        "body_summary": "I am using a new account because I don't want to make things awkward if this person uses Reddit.\nI (30m) have a long-haul flight (8+ hours) coming up. An acquaintance found out we are on the same plane and messaged me asking for my seat number so he could switch to sit next to me.\nSadly, I am a total \"yes\" person and rarely say no to people, so I panic-gave him the number. He successfully switched seats and is now sitting next to me.\nHe is a friend of a friend. We have hung out in group settings a handful of times (drinks, dinners, generic social stuff). He is a nice guy, but in my head, he is still just an \"acquaintance.\" We have never texted. Our first direct text conversation ever was him asking for my seat number.\nTo me, an 8-hour flight is to relax/sleep, watch movies, and zone out. I...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 35,
            "ESH": 2,
            "NAH": 8,
            "INFO": 0,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-11T06:03:54.539954"
    },
    {
        "id": "1r15hwh",
        "title": "AITA for not wanting to change bars because a friend doesn’t smoke",
        "url": "/r/AmItheAsshole/comments/1r15hwh/aita_for_not_wanting_to_change_bars_because_a/",
        "body_summary": "My some friends and I were out one night at a local dive bar where indoor smoking is allowed. We were having a good time, drinking beer, smoking, and just sitting and talking.\n\nAt some point, someone from a university group chat messaged asking if anyone was out. It wasn’t a planned group thing, just one person checking (very normal within the group). We replied that we were at this dive bar. They asked if they could join, and we said yes.\n\nAbout 10–15 minutes later, they messaged again asking if we were still at the same bar. We said we were. They then asked if we wanted to move to a different bar because they don’t smoke.\n\nFor some background: when we usually go out with people from uni, we almost always go to non-smoking bars, which is fine with me, I’ll just step outside when I want a ...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 122,
            "ESH": 8,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-11T06:04:04.197871"
    },
    {
        "id": "1r18iwx",
        "title": "WIBTA if I confronted my friends for buying me a bible for my birthday?",
        "url": "/r/AmItheAsshole/comments/1r18iwx/wibta_if_i_confronted_my_friends_for_buying_me_a/",
        "body_summary": "I’m a 24F. Last year for my birthday, my friends bought me a Bible.\n\nI’m not really religious, but I’m also not opposed to learning about other people’s beliefs. Last year, I went to church twice with two friends because they were going before our brunch plans, and I didn’t mind tagging along. After one of the services, my friend asked how I felt about the sermon, and I said it was good and interesting to hear.\n\nA few months later, one of my friends asked if I’d be interested in doing a Bible study with them. I said sure, but was clear that it’s not really my belief... I just knew it was important to them and I was open to participating. The Bible study was never scheduled.\n\nFast forward to my birthday (September 2025), my group of five friends bought me a single Bible as my birthday gift....",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 74,
            "ESH": 2,
            "NAH": 12,
            "INFO": 2,
            "TotalJudged": 95
        },
        "total_judged": 95,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-11T06:04:13.524106"
    },
    {
        "id": "1r17zz4",
        "title": "AITA for wanting the entirety of my own insurance payout?",
        "url": "/r/AmItheAsshole/comments/1r17zz4/aita_for_wanting_the_entirety_of_my_own_insurance/",
        "body_summary": "My fiancée and I inherited a new vehicle after the loss of his father; a brand new, fully paid off car that was much better than either of the vehicles that we were driving at the time. After some discussion, we decided to sell my car and keep his dad’s car, since it was paid off. My car was the oldest, (a 2020 Chevy Malibu) and I had paid off roughly 90% of the loan for it - so we figured we could also get some cash in our pockets from it.\n\nMy brother found out that we were selling my car, and he was currently trying to find one for himself, so he reached out and offered to take over the payments from me.\n\nI wasn’t fond of this idea, because my fiancée and I were hoping to get some money for the car to A) finish paying it off, and B) have some cash leftover to put toward our wedding.\n\nAft...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 20,
            "ESH": 8,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-11T06:04:21.378794"
    },
    {
        "id": "1r138ln",
        "title": "AITA for not giving up my seat to someone who was already at the bar?",
        "url": "/r/AmItheAsshole/comments/1r138ln/aita_for_not_giving_up_my_seat_to_someone_who_was/",
        "body_summary": "My date & I arrive at an almost full bar, but find 2 empty seats near the end. The seats aren’t next to each other, there is a man between them and another man to the left of them. (Think man > empty seat > another man > empty seat.) I take the furthest down stool and sit while my date stands, enjoying the company and patiently waiting for another spot to open up. The man I sit next to is on his phone, enjoying a cocktail, doesn’t look at or acknowledge us, simply minding his business.\n\nThe bar was very busy, we didn’t get service for about 20 minutes or so. Meanwhile, the other man on the end leaves his seat, but I see no checkbook. I decide to use the restroom, telling my date that I plan to take the now open 2 seats for us when I come back, given that the gentlemen isn’t returning. Well...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 16,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 18
        },
        "total_judged": 18,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-11T06:04:29.007470"
    },
    {
        "id": "1r11v53",
        "title": "AITA for not wanting to buy a house with my sister and live together?",
        "url": "/r/AmItheAsshole/comments/1r11v53/aita_for_not_wanting_to_buy_a_house_with_my/",
        "body_summary": "Hi guys, using a throwaway account so I don't get found out...\n\nMy twin sister and I (23F) just finished college and are moving out of home. My grandma and her sister have offered to help us buy a house together (I had some savings as I was planning to rent an apartment after college anyway).  We were both very grateful and excited, but internally I was wary.\n\nFor context, we grew up with a very abusive mother and a negligent father, to the point we lived with my grandma and her sister from 13 years old. We both consider them our maternal figures. Our teen years were pretty rough as we were dealing with a lot of mental health issues due to our childhood. So, when I finished HS I was determined to get my mental health under control and have been in therapy since I was 20. \n\nTherapy has help...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 37,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-11T06:04:36.834411"
    },
    {
        "id": "1r1dxz7",
        "title": "AITA for being mad at my husband for not cooking",
        "url": "/r/AmItheAsshole/comments/1r1dxz7/aita_for_being_mad_at_my_husband_for_not_cooking/",
        "body_summary": "I (26F) work the weekends, until 8P.M My husband (27M) watches our kids (9Y,5Y,5M). Anyway, I work Friday–Sunday, and he works every weekday. I make sure he and the kids have dinner, of course, but when I work on the weekends, I come home there’s no food made/being made, and he just gives the kids nuggets or pizza rolls. I typically cook a wellbalanced meal every night, so it always irritates me that he gives the kids junk.This last Sunday, I pulled out chicken to defrost for the morning and told him to use it for dinner. When I came home at almost 9 p.m., my 9-year-old came up to me and said he was hungry. My daughter was on a tablet in her room and was also hungry, and my husband was asleep on the couch. The chicken I pulled out for dinner was still in the package. He got up and said he ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 25,
            "ESH": 8,
            "NAH": 3,
            "INFO": 4,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-11T06:04:44.970209"
    }
]