[
    {
        "id": "1pf865e",
        "title": "UPDATE: AITA for showing up to my nephew’s birthday party without the cupcakes I said I would bake",
        "url": "/r/AmItheAsshole/comments/1pf865e/update_aita_for_showing_up_to_my_nephews_birthday/",
        "body_summary": "**Here's the link to the first post:** [https://www.reddit.com/r/AmItheAsshole/comments/1l48x0o/aita\\_for\\_showing\\_up\\_to\\_my\\_nephews\\_birthday\\_party/](https://www.reddit.com/r/AmItheAsshole/comments/1l48x0o/aita_for_showing_up_to_my_nephews_birthday_party/)\n\nHi, thanks for all of the comments before about me failing to bring the spiderman cupcakes to my nephew’s party. I think I have an ok update to share. I was sort of spiraling when I wrote my post before and that it happens very often to me. Yes I messed up but life goes on. I have not been able to find a good job, but I have been making ends meet with cleaning houses.\n\nLast week my family got together for Thanksgiving  and I surprised my nephew by bringing him a small batch of spiderman cupcakes and he was over the moon. My brother...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 5,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 5
        },
        "total_judged": 5,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2025-12-06T05:11:38.285921"
    },
    {
        "id": "1pf2i30",
        "title": "AITA for going out of town for a concert while my daughter is sick",
        "url": "/r/AmItheAsshole/comments/1pf2i30/aita_for_going_out_of_town_for_a_concert_while_my/",
        "body_summary": "Over 6 months ago, I bought tickets to a concert 5+ hours away from my city. The concert is tomorrow, and I planned to drive down tonight after work and after dropping my daughter off at her dad's. The ticket and my accommodations are already paid for and non refundable. I've been really excited for this trip since I found out about it. \n\nAll week my daughter (10) has been home sick. She has a dry cough, slight fever but nothing extreme, and a decreased appetite. I work from home and its slow season at work so I was able to be by her side all week to take care of her. She's slowly getting better but still not feeling great. I updated her dad on her condition so he could keep an eye on it, but now he's saying I'm being selfish and I should skip my trip so he doesn't catch whatever she has.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 158,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 159
        },
        "total_judged": 159,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-06T05:11:56.059247"
    },
    {
        "id": "1pf3esg",
        "title": "AITA? I accidentally ruined Secret Santa at school and now I feel awful",
        "url": "/r/AmItheAsshole/comments/1pf3esg/aita_i_accidentally_ruined_secret_santa_at_school/",
        "body_summary": "So today we were doing Secret Santa in my class, and the girl in charge of passing out the names let me choose mine. I walked back out to where everyone else was, and another girl asked me, “Did you pick yet?” I said yeah, and then she asked, “Who did you get?”\n\nI genuinely thought she was just asking normally and that it was fine to say… so I told her.\n\nThe moment I said the name, everyone got mad. They took all the papers back, called everyone to return theirs, and then told me to leave while they talked about me. I could hear them calling me stupid and saying how they were happy with their person and now it was ruined because of me.\n\nNow I just feel really dumb for answering the question at all. I wasn’t trying to ruin anything  I just misunderstood. But now I feel like everyone hates m...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 30,
            "ESH": 12,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 51
        },
        "total_judged": 51,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-06T05:12:12.011059"
    },
    {
        "id": "1pf74f3",
        "title": "AITA for telling my friend that it's a horrible idea for them to go into vet tech?",
        "url": "/r/AmItheAsshole/comments/1pf74f3/aita_for_telling_my_friend_that_its_a_horrible/",
        "body_summary": "So I was out for dinner with some friends over Thanksgiving break, and we were all talking about how the semester has been for us so far. I mentioned that I completed my transfer paperwork to change my major to Vet Tech, and that I'd be starting classes the next semester. My friend perked up and said \"I love animals and I really think I'd be good at vet tech! Should I do it?\" And having known this friend for years, there are an assortment of reasons as to why I think they shouldn't. The main one being: they cannot stand the idea of coming into contact with things like blood, feces, urine, etc. And when I say can't stand I mean they start screaming and crying, have to put what they're doing down IMMEDIATELY to wash up.\n\nThat's not inherently a bad thing! But that doesn't really synergize to...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 119,
            "ESH": 1,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 131
        },
        "total_judged": 131,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-06T05:12:28.598142"
    },
    {
        "id": "1pf1uc1",
        "title": "AITA for not selling my sister something that I already sold online?",
        "url": "/r/AmItheAsshole/comments/1pf1uc1/aita_for_not_selling_my_sister_something_that_i/",
        "body_summary": "A while back I bought a sort of rare gaming console online after finding it for a good price and using a coupon. It’s something I’ve wanted for years so I finally hopped on it. I ended up finding it in a like new condition elsewhere for around the same price. So I ended up with two of them. My sister knew I had both and planned on selling one and keeping the other to get some money back. Occasionally when she was reminded of me having it, she would casually say “I might want it” or “I like it. It looks good, you could sell me it instead” and I would tell her, “If you’re willing to buy it from me it can be yours”. But it never went further than that. I did linger on this for months, but I finally decided to post a listing online a few days ago. I even told her that I did this that day, and ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 34,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 35
        },
        "total_judged": 35,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-06T05:12:44.169982"
    },
    {
        "id": "1pf4u08",
        "title": "AITA for not wanting to host my husbands family last minute",
        "url": "/r/AmItheAsshole/comments/1pf4u08/aita_for_not_wanting_to_host_my_husbands_family/",
        "body_summary": "We were supposed to spend the weekend in a couple cabins but ended up cancelling due to bad weather.  My husband then invited everyone to our house instead without asking with me first with less than 24 hours notice.   We have all been sick for a week so the house is a mess, also he works so won’t be able to help clean and get ready.   Also my kid has surgery next week that I’m trying to mentally stay ready for to be there for her best I can because it’s a lot and I’m nervous about it, we booked camping months before we knew she would need a double eye surgery the following week after camping.  I also sleep on my daughters floor when we have company because I want to keep her safe and had a traumatic childhood so basically cannot sleep unless I’m next to her keeping her safe with overnight...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 44,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-06T05:12:59.868955"
    },
    {
        "id": "1pezqgs",
        "title": "AITAH for refusing to go somewhere my wife wanted to go and she is 2 hours late",
        "url": "/r/AmItheAsshole/comments/1pezqgs/aitah_for_refusing_to_go_somewhere_my_wife_wanted/",
        "body_summary": "Very frustated husband here.\nA group of people we seldomly hang out with has a small get together.\n\nI really did not want to go. Not because I dont like them but they are not the type of people I really enjoy hanging out with.\n\nI made this clear and was told we have to go. Its the last one of the year etc.\n\nI yielded and thought sure.\n\nShe phoned me and asked me that I need to arrange a time with them and buy drinks to bring. She is busy at work and will be late.\n\nAfter I asked to rather cancel it was expected that I must go on my own she will meet me and the kids there.\n\nAm I the A Hole for saying how frustrated I am and did not want to go. And refusing to go until she is home and ready for us to go?",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 12,
            "ESH": 0,
            "NAH": 1,
            "INFO": 7,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-06T05:13:00.419521"
    },
    {
        "id": "1percni",
        "title": "AITA for not helping my coworker?",
        "url": "/r/AmItheAsshole/comments/1percni/aita_for_not_helping_my_coworker/",
        "body_summary": "I work remotely on a small team. My boss is also a childhood friend, but I don’t get special treatment and I’m well-liked at work. A few months ago we hired “Cat\".. She was supposed to help take on some of the recurring projects that normally bury me, including a monthly report (“Project X”). So I trained her for months, and we connected really well outside of work. We became definitive friends, and she called me \"her person\".\n\nThe important parts: we became close, and she became well versed on Project X.\n\nOne week, leadership gave us new requirements for X and wanted a demo by Friday. After the meeting, my boss pulled us into a post-meeting meeting to recap the plan in a more actionable sense. Afterward, Cat DMed me asking for more clarity. I recapped the steps in another way.. But before...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 16,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 19
        },
        "total_judged": 19,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-06T05:13:15.868840"
    },
    {
        "id": "1pf8m5g",
        "title": "WIBTAH if I stopped co-parenting with my mother?",
        "url": "/r/AmItheAsshole/comments/1pf8m5g/wibtah_if_i_stopped_coparenting_with_my_mother/",
        "body_summary": "I’m a college freshman (18f). I go to school about 3 hours away from home. The past 3 years I’ve been parentified by my mom. After she left my dad, she wants to treat me like a husband not as her kid. She’d complain about all her issues to me instead of confiding in a more age appropriate person. TMI but she literally told me that my dad gave her stds from cheating on her.\n\nAlong with this I also did a lot of parenting while she worked. I have 2 younger siblings that I put to bed, took to school, made sure they did homework, and sometimes cooked meals. I was also expected to take care of the house. Which meant I was cleaning and having to parent my siblings so they’d actually help.\n\nThis was all fine and dandy until the summer before I left. About a year ago my older brother (who is our el...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 14,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 15
        },
        "total_judged": 15,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-06T05:13:31.402369"
    },
    {
        "id": "1peqcfe",
        "title": "AITA for asking my partner’s brother to pay my cat’s vet bill after he lied to me and that lie caused the cat to get sick in the first place?",
        "url": "/r/AmItheAsshole/comments/1peqcfe/aita_for_asking_my_partners_brother_to_pay_my/",
        "body_summary": "My partner’a brother (25) lives with us currently and since he was out of work for awhile and unable to pitch in for rent(he now has a job but has yet to pay any rent), he agreed to certain chores around the house including but not limited to; taking out the trash and recycling, changing the litter bag in the automatic cat litter box, cleaning out the cat’s water fountain weekly and changing the filter monthly, and letting me know when food was running low in the automatic feeders so I could order more… for the last two months, he has gone out of his way to tell me how he deep cleaned the cat’s water fountain and changed the filter and filled it and everything was good- even adding how gross it was and how it “took a long time” well last night the fountain stopped working and I took it apa...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 19,
            "ESH": 7,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-06T05:13:47.090366"
    }
]