[
    {
        "id": "1qvtd87",
        "title": "AITA for refusing to translate on the spot after my friend keeps using me as his proof he speaks the language?",
        "url": "/r/AmItheAsshole/comments/1qvtd87/aita_for_refusing_to_translate_on_the_spot_after/",
        "body_summary": "i'm (19M) fluent in another language because of my family, my friend \"jake\" (19M) has been \"learning\" it forever, he knows a few phrases but he's not conversational. the problem is jake likes people he *speaks* and then when someone actually starts talking to him, he immediately looks at me to save him.\n\nit started out kind of harmless, we'd be out somewhere, he'd hear someone speaking it and he'd jump in with a sentence. they'd respond normally and he'd just stare at me like \"help\". i\"d translate a bit to keep it from getting awkward for the strangers.\n\nafter it happened a few times i told him please stop doing that like if you want to practice just say you're learning, dont tell people you speak it and then make it your interpreter, he laughed and acted like i was being dramatic. he said...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 63,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-05T05:47:35.405510"
    },
    {
        "id": "1qvo5oe",
        "title": "AITA for yelling at my mom who is grieving my deceased brother for 30 yrs",
        "url": "/r/AmItheAsshole/comments/1qvo5oe/aita_for_yelling_at_my_mom_who_is_grieving_my/",
        "body_summary": "Hey guys. I didn't expect this many replies. I am trying my best to reply back  but it's kinda hard since English isn't my first language and I'm new to Reddit system. But I'll try my best to reply back even if it takes time. Thank you so much for various opinions.\n\n=====================\n\nHi. I live in East Asia and this is my first time writing in Reddit. I yelled at my mom today and I want to know if I am the asshole for doing this.\n\nI have been the only child since my brother passed away of disease about 30 years ago. I (38f) live with my parents (in their 70s) and one elderly cat (17m). The family cat is having serious aging problems requiring meds and fluids everyday, which I am the only one who can give these to him since my parents are somehow scared to do so. This is the biggest re...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 38,
            "ESH": 8,
            "NAH": 12,
            "INFO": 1,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-05T05:47:44.103840"
    },
    {
        "id": "1qvi3kq",
        "title": "AITA for opening the curtains and eating breakfast in a shared room?",
        "url": "/r/AmItheAsshole/comments/1qvi3kq/aita_for_opening_the_curtains_and_eating/",
        "body_summary": "So for context I am living in a university residence. I share my bedroom with one other guy (two beds in a room). We also share the bathroom, but the kitchen is outside of the room and shared between all residents. Our room has a huge window, that let's in lots of sunlight, but we also have very thick curtains that practically make the room pitch black if closed.\n\nNow, the problem is that my roommate and I have very different sleep schedules. I want to sleep between 10:30 and 11.30 pm and wake up between 7:30 and 8:30 am. He on the other hand, goes to sleep around 6 am! To his credit, he doesn't make any noises or disturb me in anyway during my sleep hours. I try to do the same, but it's impossible!\n\nHe expects the room to be pitch black, absolutely no light. This makes it very hard for me...",
        "reddit_judgments": {
            "YTA": 42,
            "NTA": 42,
            "ESH": 2,
            "NAH": 8,
            "INFO": 4,
            "TotalJudged": 98
        },
        "total_judged": 98,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-05T05:47:54.201286"
    },
    {
        "id": "1qvuyp7",
        "title": "AITA for saying my sister crossed a line even though everyone says I’m overreacting?",
        "url": "/r/AmItheAsshole/comments/1qvuyp7/aita_for_saying_my_sister_crossed_a_line_even/",
        "body_summary": "I am (29F) married to my husband (30M). We’ve been together for years and I’ve never had reason to doubt our relationship.\n\nMy sister (26F) is very involved in our lives. She comes over often, talks to my husband a lot, and has always said how much she “feels safe” around him. I didn’t think much of it until recently, when she told me she feels a very strong emotional connection to him and that she wanted to be honest with me.\n\nShe insisted she meant nothing inappropriate and said I should take it as a compliment that she trusts my husband so much. But after that conversation, I couldn’t unsee certain things. She seeks his validation constantly, downplays my opinions, and acts hurt if I interrupt their conversations or set boundaries.\n\nI eventually told her that her behavior makes me uncom...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 95,
            "ESH": 0,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 101
        },
        "total_judged": 101,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-05T05:48:02.329417"
    },
    {
        "id": "1qvzyjf",
        "title": "AITA For telling a lady that put a pee pad down for her dog inside the mall that that’s disgusting and not okay?",
        "url": "/r/AmItheAsshole/comments/1qvzyjf/aita_for_telling_a_lady_that_put_a_pee_pad_down/",
        "body_summary": "I was walking through the (indoor) mall when I saw a woman putting a pee pad down for her dog right in the main hallway.  I asked if she was serious and she smiled and said yes.  I said that’s disgusting and she started waving around the unused (yet) pad saying it’s fine.  I insisted, no, it’s disgusting.  For the record, I have a small dog that’s pee pad trained only, so I understand the function of the pads.  I would also never bring my dog inside a mall, grocery store, restaurant…\n\nAITA?  Or is she? I’m just wondering where the majority stands on this.",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 58,
            "ESH": 7,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 87
        },
        "total_judged": 87,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-05T05:48:04.220460"
    },
    {
        "id": "1qvjbjn",
        "title": "AITA Two people say I’m hard to live with am I missing something?",
        "url": "/r/AmItheAsshole/comments/1qvjbjn/aita_two_people_say_im_hard_to_live_with_am_i/",
        "body_summary": "I’m a 20-year-old international student in Australia. I usually trust my decisions, but after two difficult living situations in a row, I’m questioning whether I’m overreacting or if I’ve just been unlucky.\n\nFirst situation:\nThree months after I arrived, a friend from my home country moved in with me because she said she knew no one else. We shared a room. I work night shifts and sleep during the day. She was disturbed by my schedule, so I tried to be very quiet and even started eating at work to avoid noise.\n\nLiving together showed our differences. She’s extremely neat (even a single hair on the floor bothered her). I’m clean but not obsessive. I always cleaned shared spaces like the kitchen and bathroom, but she mostly focused on her own area. Problems escalated when she received two hug...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 45,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 46
        },
        "total_judged": 46,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-05T05:48:11.836226"
    },
    {
        "id": "1qw97w8",
        "title": "AITA for not wanting to say hi to my boyfriend’s family during quick visits?",
        "url": "/r/AmItheAsshole/comments/1qw97w8/aita_for_not_wanting_to_say_hi_to_my_boyfriends/",
        "body_summary": "My boyfriend lives with his parents. Every time I go over, even if it’s just to pick something up or drop something off, I’m expected to hug his parents, say hi, and have a conversation. I get that this is normal when we’re staying for a while, but sometimes it’s just a 5-minute stop.\n\nRecently, we stopped by their house for something, and I told him I just wanted to stay in the car and not say hi. (I was feeling irritable and wasn’t having a great day).He scoffed, sighed, and said I needed to “get over it and figure it out.” I feel like he’s dismissing my feelings I’m not rude to his family, I just don’t have the energy to perform this social”dance” for every single visit.\n\nEdit:\n\nHe lives with his parents .. I meet them almost daily and say hi to them every day ..today I was just not fee...",
        "reddit_judgments": {
            "YTA": 53,
            "NTA": 70,
            "ESH": 2,
            "NAH": 8,
            "INFO": 11,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-05T05:48:21.189761"
    },
    {
        "id": "1qvxgu5",
        "title": "AITAH for giving my friend a much-needed reality check?",
        "url": "/r/AmItheAsshole/comments/1qvxgu5/aitah_for_giving_my_friend_a_muchneeded_reality/",
        "body_summary": "My mate and I are both in our mid-30s. We’ve known each other for over 20 years and, realistically, we’ve been each other’s main support system for most of that time. He’s the only person I speak to regularly and I’m the same for him. Let’s call him Dave.\n\nI recently moved to another city for work, so we don’t get to hang out in person anymore. We still call every few days, and despite everything, I genuinely love the guy like a brother. I don’t see us ever not being in each other’s lives. I could go on about his best qualities. \n\nBut respectfully… Dave has all my worst traits, but turned up to 100. I struggle with depression and social anxiety too, but I’ve been putting in the effort to turn things around: I’ve been exercising, getting outside, forcing myself into small social situations,...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 29,
            "ESH": 4,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-05T05:48:28.769873"
    },
    {
        "id": "1qw0lem",
        "title": "AITA for refusing to pay anything after my roommate asked me to move out because they moved their partner in without telling me?",
        "url": "/r/AmItheAsshole/comments/1qw0lem/aita_for_refusing_to_pay_anything_after_my/",
        "body_summary": "Last year I moved out of the apartment I shared with a roommate and till now she’s asking me to pay for the last two months I she claims I was still at the apartment.\n\nSo I opened up a studio for my work September last year and for the first time I missed giving my part of the rent for October on the day I was supposed to cus I spent money prepping my studio. I discussed this with her and she told me she had paid. I thanked her cus I thought she sympathized with me, I didn’t know she was planning to kick me out.\n\nDuring that period I spent a lot of time away from home, I was still setting up my studio and sometimes I finished late so I just spent the night there and start again the next morning. The first two days I stayed away from home when I got back I met her and her boyfriend, I said ...",
        "reddit_judgments": {
            "YTA": 48,
            "NTA": 1,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-05T05:48:36.349261"
    },
    {
        "id": "1qw3vw2",
        "title": "AITA for asking my boyfriend to leave the apartment while I take online therapy?",
        "url": "/r/AmItheAsshole/comments/1qw3vw2/aita_for_asking_my_boyfriend_to_leave_the/",
        "body_summary": "Hey guys! Boyfriend and I are genuinely torn on this, Im going to say my side and try to be fair and tell his side of the story as well.\n\nOnce a week for an hour, I have to take work assigned EMDR therapy. Its for PTSD, but to be fair I dont completely believe in it. Still, once a week I have to sit there with my eyes closed, tapping myself and the therapist basically brings up the \"traumatizing incident and I have to tell her how I feel etc. Its not pleasant, its kind of embarrassing and I really dont want my boyfriend to overhear any of it. Boyfriend works from home and has a completely flexible schedule, so he's usually ok with leaving for that hour- he goes to a coffee shop, what have you. Last night however, he told me he feels that its unfair that he has to leave the place because he...",
        "reddit_judgments": {
            "YTA": 58,
            "NTA": 55,
            "ESH": 3,
            "NAH": 22,
            "INFO": 4,
            "TotalJudged": 142
        },
        "total_judged": 142,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-05T05:48:45.794736"
    }
]