[
    {
        "id": "1mw42hz",
        "title": "AITA for refusing to split the dinner bill because my dish was half the price of the others?",
        "url": "/r/AmItheAsshole/comments/1mw42hz/aita_for_refusing_to_split_the_dinner_bill/",
        "body_summary": "OP went to dinner with coworkers. They ordered less expensively than others, but coworkers wanted to split the bill equally. OP refused, only paying for their portion. Now, coworkers are upset. AITA for not splitting the bill?\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 119,
            "ESH": 3,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-22T05:11:30.994345"
    },
    {
        "id": "1mw4h6h",
        "title": "AITAH for not seperating drinks in a cooler",
        "url": "/r/AmItheAsshole/comments/1mw4h6h/aitah_for_not_seperating_drinks_in_a_cooler/",
        "body_summary": "OP hosted a BBQ and a child grabbed a beer from the cooler. OP took it away, leading to a dispute with the child's parent who blamed OP for making alcohol accessible. OP thinks the parent should have been watching the kid. AITA for not securing the beer?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 122,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 127
        },
        "total_judged": 127,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-22T05:11:33.942427"
    },
    {
        "id": "1mwbyon",
        "title": "AITA for telling my brother to spend more time with his kids and less time doing things like taking his Yoga teacher to Japan?",
        "url": "/r/AmItheAsshole/comments/1mwbyon/aita_for_telling_my_brother_to_spend_more_time/",
        "body_summary": "OP's brother is taking his yoga instructor to Japan but telling his kids it's a work trip. He asked OP to cover for him by taking his son to football. OP called him a bad dad, saying he should spend time with his kids instead. Brother said OP can't judge since they don't have kids. AITA for speaking up?\n...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 86,
            "ESH": 3,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 103
        },
        "total_judged": 103,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-22T05:11:36.265357"
    },
    {
        "id": "1mwmi6g",
        "title": "AITA for snapping at my neighbor after she kept trying to make me her free maid babysitter and pet sitter all in one?",
        "url": "/r/AmItheAsshole/comments/1mwmi6g/aita_for_snapping_at_my_neighbor_after_she_kept/",
        "body_summary": "OP's neighbor increasingly asks for favors (mail, petsitting, childcare). OP snapped when asked to do multiple tasks simultaneously, telling her she's not a maid/sitter. The neighbor retaliated by gossiping. OP asks: AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 68,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 70
        },
        "total_judged": 70,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-22T05:11:37.756330"
    },
    {
        "id": "1mw8jfd",
        "title": "AITA for refusing to let my mom bring her boyfriend to my wedding even though she says I’m “punishing her for being happy”?",
        "url": "/r/AmItheAsshole/comments/1mw8jfd/aita_for_refusing_to_let_my_mom_bring_her/",
        "body_summary": "OP (28F) excluded her mom's boyfriend, Mark, from her wedding invite due to disliking him. Her mom is upset, calling OP cruel and threatening to skip the wedding. OP asks AITA?\n...",
        "reddit_judgments": {
            "YTA": 85,
            "NTA": 63,
            "ESH": 4,
            "NAH": 7,
            "INFO": 11,
            "TotalJudged": 170
        },
        "total_judged": 170,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-08-22T05:11:42.041070"
    },
    {
        "id": "1mwkmv2",
        "title": "AITA for using the term \"fat fingered\"?",
        "url": "/r/AmItheAsshole/comments/1mwkmv2/aita_for_using_the_term_fat_fingered/",
        "body_summary": "On a Teams call presenting an Excel file to 10+ people, mostly clients. I apologized to the group for a formula error, exact words were \"Sorry everyone, I must have fat fingered the keys.\" This was met with a brief, but stern reprimand from one of the clients who said my phrasing was \"denigrating to overweight people\". I quickly apologized and moved on, but later in the day was irritated that this person felt the need to discuss this in front of the wider group of clients, rather than speaking to me after the call. What do you think?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 125,
            "ESH": 0,
            "NAH": 9,
            "INFO": 0,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-22T05:11:44.009934"
    },
    {
        "id": "1mwggty",
        "title": "AITA for putting my foot down with my mother in law.",
        "url": "/r/AmItheAsshole/comments/1mwggty/aita_for_putting_my_foot_down_with_my_mother_in/",
        "body_summary": "OP's religious in-laws, especially MIL, disrespect OP's home by performing unwanted religious rituals (oils, salt, etc.) during pet-sitting. OP asked MIL to stop, but she does it secretly, and OP's husband denies it. After finding oil in daughter's room, OP wants to board the dogs & revoke MIL's key. AITA for doing so?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 70,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 74
        },
        "total_judged": 74,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-22T05:11:45.836013"
    },
    {
        "id": "1mwp6wp",
        "title": "AITA for not canceling plans to be there for the birth of a “friend’s” baby?",
        "url": "/r/AmItheAsshole/comments/1mwp6wp/aita_for_not_canceling_plans_to_be_there_for_the/",
        "body_summary": "OP helped a pregnant acquaintance new to the city. The acquaintance became overly reliant and demanding, expecting OP to move in after the birth & provide childcare. OP is traveling for a wedding. The acquaintance & OP's mom are angry. AITA for going on the trip instead of fulfilling the acquaintance's expectations?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 144,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-22T05:11:48.556225"
    },
    {
        "id": "1mwdcfi",
        "title": "AITA for not waking up my partner when it was his turn to watch the baby?",
        "url": "/r/AmItheAsshole/comments/1mwdcfi/aita_for_not_waking_up_my_partner_when_it_was_his/",
        "body_summary": "OP, the breadwinner WFH parent, is frustrated their SAHP partner expects them to constantly help with the baby, disrupting work. Partner naps without informing OP, who took the baby to allow rest. OP is upset about the lack of communication; partner thinks needing \"permission\" to nap is unfair. AITA?\n...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 57,
            "ESH": 9,
            "NAH": 4,
            "INFO": 2,
            "TotalJudged": 84
        },
        "total_judged": 84,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-22T05:11:51.333138"
    },
    {
        "id": "1mwiv5a",
        "title": "AITA for not having over my friend’s daughter who steals?",
        "url": "/r/AmItheAsshole/comments/1mwiv5a/aita_for_not_having_over_my_friends_daughter_who/",
        "body_summary": "OP declined friend's request to bring her daughter (history of stealing) to girls' night, citing discomfort and daughter's absence. Friend was upset. OP's other friends think she was too harsh. AITA?\n...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 84,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 92
        },
        "total_judged": 92,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-22T05:11:52.934939"
    }
]