[
    {
        "id": "1p9joq9",
        "title": "AITA for refusing to financially support my parents and explaining why when my brother asked?",
        "url": "/r/AmItheAsshole/comments/1p9joq9/aita_for_refusing_to_financially_support_my/",
        "body_summary": "I (38F) have been living in a different state from my family for over 10 years. I’ve supported myself the entire time and rarely asked anyone for help. I didn’t grow up with my parents, my grandmother supported and raised me, and I never had a close relationship with them.\n\nLast year, I went on vacation with my siblings. During the trip, I found out that my youngest brother (29M), who makes the most money out of all of them, has been paying the mortgage and most of our parents’ living expenses. He asked me why I wasn’t helping financially.\n\nSince he asked directly, I answered honestly. I told him that our parents didn’t support me growing up, and that I still remember when my grandmother asked me to write them a letter requesting financial support for my education. My mom wrote back to my ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 141,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 144
        },
        "total_judged": 144,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-30T05:11:57.755622"
    },
    {
        "id": "1p9zep9",
        "title": "AITA for refusing to cover a shared cost after my coworker wouldn’t show me the break of what the money had gone towards so far?",
        "url": "/r/AmItheAsshole/comments/1p9zep9/aita_for_refusing_to_cover_a_shared_cost_after_my/",
        "body_summary": "I (24F) recently started my first full time job after graduating. My company has an optional team social fund where each member of our small department contributes a set amount every month to cover birthday treats, team lunches, and small surprises. It sounded harmless, so I joined when my coworker Liam asked.\n\nHe manages the fund and everyone just sends him their contribution directly. Not that i suspected anything but last month, I asked if he could give me a breakdown of what the money had gone towards so far, because I’m trying to be better about tracking my spending. My mom drilled into me that I should always know where my money is going.\n\nHe said, Yeah, I’ll get it to you later. He didn’t.\n\nFew days later, he didn't send anything but he reminded me that my monthly contribution was d...",
        "reddit_judgments": {
            "YTA": 18,
            "NTA": 83,
            "ESH": 2,
            "NAH": 3,
            "INFO": 7,
            "TotalJudged": 113
        },
        "total_judged": 113,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-30T05:12:15.751548"
    },
    {
        "id": "1p9siqg",
        "title": "AITA for not giving my sister the \"family\" nativity?",
        "url": "/r/AmItheAsshole/comments/1p9siqg/aita_for_not_giving_my_sister_the_family_nativity/",
        "body_summary": "I put this in the wrong subreddit.  Hope I have it right here.  So this actually happened a few years ago but as I was decorating for Christmas I began to wonder if AITA. My grandmother's hobby was making ceramics. She always had a beautiful set that she made before my sister or other siblings were born. When I married, over 20 years prior to this interaction, I picked it up from her house and took it with me to my new home.\n\nOne Christmas, a few years back, my sister and her husband were over at my house visiting my kids. My sister said she wanted to talk to me.\n\nSister: Look I think we should take turns with the nativity. It was the family nativity that Grandmother made and its not fair that only you get to display it. I want to take it next year. (BIL was nodding in agreement)\n\nMe : Oh,...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 100,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 104
        },
        "total_judged": 104,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-30T05:12:32.507611"
    },
    {
        "id": "1p9t814",
        "title": "AITA for telling my stepdad he’s no longer allowed in my car which ends up with a huge argument?",
        "url": "/r/AmItheAsshole/comments/1p9t814/aita_for_telling_my_stepdad_hes_no_longer_allowed/",
        "body_summary": "I, 19F was driving my mom and stepdad in my car to go get groceries. Mid drive I accidentally took a turn too early and immediately my mom began freaking out on me, genuinely sounding like she was going to have a mental breakdown in the backseat of my car. \n\nI’ve told them before not to yell at me when Im driving because it makes me defensive and stressed out, and if it continues my defensiveness/stress turns into anger.\n\nSo I turned the car around and we were now back on track to the store, but they were still yelling at me and hounding me for answers about why I turned early(??? Idk, ppl make mistakes-), so I told them to shut up(which I admit was rather rude of me but I struggle to articulate myself when upset and just wanted the fight to stop before it worsened) because whenever this h...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 74,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 80
        },
        "total_judged": 80,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-30T05:12:48.672218"
    },
    {
        "id": "1p9q8bh",
        "title": "AITA for not wanting to give up my bed for guests?",
        "url": "/r/AmItheAsshole/comments/1p9q8bh/aita_for_not_wanting_to_give_up_my_bed_for_guests/",
        "body_summary": "My (30F) fiancé (32M) and I have been living together since February (10 months). When we moved in together, I brought my queen bed and we put it in a spare room for guests. Since then, we've had a couple friends and my sister visit and each time they've stayed in the guest room. \n\nFiancé's parents are staying one night for the holiday, and he had planned to have us move over and sleep in the guest room and give his parents our room. \n\nHis logic is simple: his parents are older (late 50s), would have easy access to the en suite and it's what he's always done for their visits. \n\nThe one difference is that whenever they've visited in the past, it was at his old place with no guest room/bed, so he offered them his room, he slept on the couch, and I would be at my place. \n\nWe recently got a ki...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 106,
            "ESH": 0,
            "NAH": 7,
            "INFO": 2,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-30T05:13:05.543677"
    },
    {
        "id": "1p9yknf",
        "title": "AITA for refusing to go to my student-organized graduation ceremony?",
        "url": "/r/AmItheAsshole/comments/1p9yknf/aita_for_refusing_to_go_to_my_studentorganized/",
        "body_summary": "I (22F) am in a conflict with my mother because I refuse to attend a diploma ceremony for my university major this Monday, they won't give us the degree, it's just a diploma stating our generation ended. This ceremony was organized by students, not the university, though it will be held on campus\n\nIt's important to note that this student-organized ceremony is the only event for receiving our diplomas. There is no separate, official university ceremony. The only other related activity is going to the administration office on a designated day with your family to pick up the physical degree and paperwork, but that is not a ceremonial event.\n\nNOTE: This diploma ≠ the official degree for my major. As I said before this diploma is only a statement that our generation's period ended.\n\nThe reason ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 19,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-30T05:13:21.211182"
    },
    {
        "id": "1p9id5t",
        "title": "AITA for letting my son take a poster to his mom’s house?",
        "url": "/r/AmItheAsshole/comments/1p9id5t/aita_for_letting_my_son_take_a_poster_to_his_moms/",
        "body_summary": "I’m 31 male. My wife is 29F, my ex wife is 31F. My ex wife and I have a 12 year old son together. He was with us for the first half of his Thanksgiving break, he lives with his mom. I’m not sure of the exact (edit here for spelling) percentage of time split but he lives with her primarily. \n\nMy son asked me if he could take a poster he had in his room (a Harry Potter poster) to his mom’s for his room. I said yes, because I didn’t think it was that big of a deal since I bought the poster at Five Below. It was cheap. \n\nHe took it home, and later I found out my wife was mad that I said he could take it since “we” bought it, and “we” should decide what leaves our home. She’s really mad about this poster leaving the home and called me an asshole for not talking to her about it because it’s “not...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 50,
            "ESH": 0,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-30T05:13:37.546296"
    },
    {
        "id": "1pa6z63",
        "title": "AITA for telling my husband he can watch the show I'd been recommending by himself after he only agreed to watch it when his cousin recommended it",
        "url": "/r/AmItheAsshole/comments/1pa6z63/aita_for_telling_my_husband_he_can_watch_the_show/",
        "body_summary": "Hi, just looking for a quick judgment, this might sound petty and if it is and if I'm behaving like an AH I'll drop the issue and apologize.\n\nI've been recommending Gilmore Girls to my husband for something to watch, since we started dating really, I even showed him some clips and he said he'd pass, which was fine with me. I've loved it since I was a teenager and I also understand it's not for everyone. Since I've known him I've probably watched the show twice over, by myself.\n\nYesterday we were at a family dinner, where a lot of his extended family were as well, and a cousin he's close to. Anyway today after dinner, as we were watching TV he put on Netflix, searched up Gilmore Girls with full intent and then said his cousin had told him his wife got him hooked to this show it's become a g...",
        "reddit_judgments": {
            "YTA": 16,
            "NTA": 47,
            "ESH": 7,
            "NAH": 8,
            "INFO": 2,
            "TotalJudged": 80
        },
        "total_judged": 80,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-30T05:13:53.929169"
    },
    {
        "id": "1pa1qwl",
        "title": "AITA because I didn’t have a reaction",
        "url": "/r/AmItheAsshole/comments/1pa1qwl/aita_because_i_didnt_have_a_reaction/",
        "body_summary": "My (24f) fiancé (28m) decided that for my birthday, he would get a hotel room for me. We’re not having sex, but just sit and relax. I personally wouldn’t have gotten it on my own for that reason, but I’m not going to stop him from doing what he wants to do for me. It took over an hour of driving through a mild snow storm (that I did) to get here and I honestly just wanted to decompress. \n\nSo we get to the room, and it’s decorated. And as I’m turning around to thank him for putting the effort in, he’s recording me. I’m EXTREMELY self conscious about my appearance. I had no make up on, no cute clothes, and I’m exhausted from driving. I’m literally not in the mood to be recorded. So instead of telling him thank you like I was going to, I asked why are you recording me. \n\nApparently that ruine...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 31,
            "ESH": 0,
            "NAH": 3,
            "INFO": 3,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-30T05:14:09.806677"
    },
    {
        "id": "1pa2gbn",
        "title": "AITA for not booking a getaway for my wife's birthday because she showed no enthusiasm?",
        "url": "/r/AmItheAsshole/comments/1pa2gbn/aita_for_not_booking_a_getaway_for_my_wifes/",
        "body_summary": "My wife's birthday is in a couple weeks and she said she wants spend some time in a hotel or somewhere away from the house. She also wanted to do something with her twin sister. I was thinking going abroad (we're in the UK for context) but she didn't want to travel. We have children, which we won't/can't part with when on holiday and her sister has children too. \n\nPart of the problem is when it comes to me suggesting a holiday, a place to go etc. she shows no enthusiasm or engagement at all.  A couple nights in a hotel is going to cost at least £500 so I want to make sure she's onboard etc. I arranged a call with her sister and she didn't even bother get involved just walked off. I try and talk to her about suggestions and I get the typical short answers, \"whatever you want\" etc. \n\nNow, I ...",
        "reddit_judgments": {
            "YTA": 43,
            "NTA": 9,
            "ESH": 9,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 67
        },
        "total_judged": 67,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-30T05:14:26.349831"
    }
]