[
    {
        "id": "1r0g8wd",
        "title": "AITA for not moving back in with my dad just because he got divorced",
        "url": "/r/AmItheAsshole/comments/1r0g8wd/aita_for_not_moving_back_in_with_my_dad_just/",
        "body_summary": "My mom died when I (16f) was a baby. My aunt (my mom’s sister) stepped in and became like a 2nd mom to me. When I was 8 she moved for work so I went from seeing her every day to her flying me out 1-2 times a month plus 1 week of winter break, spring break, and 50/50 over the summer. \n\n  \nWhen I was 12 my dad married Judy and they kept saying she was my new mom and I don’t need to keep visiting my aunt because I have Judy. He also gave my room to Judy’s kids since it was bigger and I refused to share and told my aunt that they decided that I couldn’t fly alone so she either had to fly out to get me or drive all day there and back.\n\n  \nI decided to stay with my aunt a few months after my dad married Judy because it was pretty obvious that he cared about his new family more than me. \n\n  \nMy d...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 157,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 157
        },
        "total_judged": 157,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-10T06:05:45.675799"
    },
    {
        "id": "1r0i0p4",
        "title": "AITA for seeking a new bank account without telling my mom after a significant loss of money?",
        "url": "/r/AmItheAsshole/comments/1r0i0p4/aita_for_seeking_a_new_bank_account_without/",
        "body_summary": "Hi guys. I'm using a throwaway account for this, and I've never posted here so please forgive me for my inexperience. \n\nA couple of years ago, I (19M) received around $7,000 from my grandmother. I was looking to start college soon, and she wanted to put me in the right direction. I didn't work during high school, because my parents wanted me to focus on school (which paid off, as I graduated valedictorian of my class.) Because of this, I never had access to my personal bank accounts. When I had enough cash and checks that I wanted to deposit, my mom (49F) would just deposit it into a joint savings account that she said belonged to me. \n\nFast forward a year later and I am ready to open a checking account to pay for my own things. My mom comes with me and proposes to the bank employee that w...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 80,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 86
        },
        "total_judged": 86,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-10T06:05:54.724244"
    },
    {
        "id": "1r0cxoa",
        "title": "AITAH for saying no after my sister’s fiancé invited himself on our family trip?",
        "url": "/r/AmItheAsshole/comments/1r0cxoa/aitah_for_saying_no_after_my_sisters_fiancé/",
        "body_summary": "My husband, son, sister, and I are planning a short Florida trip. My sister’s fiancé wants to come but my husband and him don’t get along. I will be 5 months pregnant by then and don’t want tension on a trip that’s supposed to be fun and relaxing.\nWe’re also part of the same religion and since they aren’t married yet my husband and I would be responsible for chaperoning which we’re not comfortable with. I also don’t feel like that’s a sibling responsibility. I think it should be up to theparents not us. Mind you you he doesn't even live in the same state its a long distance relationship. I even told him it would probably be different if the whole family went but he didnt care.\n\nMy sister already told him my husband wouldn’t be okay with it and asked him not to bring it up but he messaged m...",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 53,
            "ESH": 6,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 76
        },
        "total_judged": 76,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-10T06:06:04.699800"
    },
    {
        "id": "1r003iq",
        "title": "WIBTA for requesting a room change 4 days into university because my flatmates are men?",
        "url": "/r/AmItheAsshole/comments/1r003iq/wibta_for_requesting_a_room_change_4_days_into/",
        "body_summary": "I am a first year university student who has just moved into my flat to start the school year (I am in New Zealand, where the school year starts in February).\n\nAt my uni we have halls for students to live in. One of these \"halls\" are actually several blocks of flats with a commom room and shared laundry area. This is the hall I am in.\n\nI am in a 3 bedroom flat. I am female, and my other two flatmates are male. This is just how we were allocated.\n\nWhy I want to change my flat:\n\nOne woman placed with two men... need I say more?\n\nI feel isolated because I am the only woman in the flat, and I wouldn't be surprised if the guys felt like they had to walk on eggshells to make me not uncomfortable, even though the guys themselves are fine.\n\nI am living in a flat with two men who are currently pret...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 42,
            "ESH": 0,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-10T06:06:13.344549"
    },
    {
        "id": "1r04yvu",
        "title": "AITA for giving away a military funeral flag that didn't belong to Me.",
        "url": "/r/AmItheAsshole/comments/1r04yvu/aita_for_giving_away_a_military_funeral_flag_that/",
        "body_summary": "Ok long story short I ended up with a military flag that an ex had left at my house for almost 3 years. I have repeatedly contacted him and his sister to try and return the flag to them since it was thier Dads funeral flag and he was a retired military vet and he has since passed away. The last time i had contacted the sister was probably about a year ago. I asked for her address because I was going to send her the flag. I was tired of holding onto it. Well she never got back to me. A year has passed since the last time I tried to make contact.  Well I didn't know exactly what to do with the flag so I got ahold of a friend who is also retired from the military and I asked them for advice on what to do with it. He said to give it to him, he would be able to take care of it for me and so I d...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 61,
            "ESH": 0,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 67
        },
        "total_judged": 67,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-10T06:06:21.179179"
    },
    {
        "id": "1r04tjv",
        "title": "AITA for getting annoyed about my towel being used as a bathmat",
        "url": "/r/AmItheAsshole/comments/1r04tjv/aita_for_getting_annoyed_about_my_towel_being/",
        "body_summary": "Just to warn you that this is a really petty argument but I would like an external opinion.\n\nYesterday I put the bathmat in the wash just before we were heading out.\n\nMy partner went to shower before me this morning and could not find a new bathmat when looking in the cupboard (he didn’t put the light on and there was certainly one in there as I got it out after).\n\nWhen I got up to go in the shower I saw that he had used one of my nice soft towels as his bathmat when getting out of the shower.\n\nI was annoyed and complained at him to please not use my towel in this way. I didnt shout but I was clearly annoyed by it in my tone. I went into the cupboard and got a new bathmat.\n\nHe then flipped out at me and said it was 100% my fault because I had not replaced the bathmat when I put the old one...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 41,
            "ESH": 18,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-10T06:06:29.196362"
    },
    {
        "id": "1qzzwrh",
        "title": "AITAH for refusing to go back to my natural hair colour to be in a wedding?",
        "url": "/r/AmItheAsshole/comments/1qzzwrh/aitah_for_refusing_to_go_back_to_my_natural_hair/",
        "body_summary": "So backstory first, I (19F) have naturally dark brown hair. I have not had my natural hair colour since before my freshman year of high school. Currently my hair is blonde and purple (the purple is temporary). I was asked to be a bridesmaid for my family members wedding and I said yes. I was told that the non natural hair colour (purple) would not be allowed at the wedding which I was ok with. Today I was told I have to go back to my natural hair colour or not be involved in the wedding (not by the bride yet). I was immediately shocked and argued about it. I said no almost immediately. No one is calling me an a-hole but I feel like I’m going crazy. For context, I will never go back to my natural hair colour, it reminds me of my past trauma, even if it means I’m out of the wedding party. I’...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 23,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-10T06:06:36.892860"
    },
    {
        "id": "1r0pv4s",
        "title": "AITA for not telling a high school friend of my dad’s i ran into that he’d died?",
        "url": "/r/AmItheAsshole/comments/1r0pv4s/aita_for_not_telling_a_high_school_friend_of_my/",
        "body_summary": "this is a short one. \n\nbasically i went to pick a prescription and the pharmacist almost immediately asked me if i was my dad’s kid (i don’t think we’ve met before, me and my dad just really look alike) and so of course i was like yeah and then she asked a bunch of questions about what he was up to these days and talked about how they used to be friends in high school. \n\nfor some reason i just made stuff up instead of being like well actually he died a few years ago because 1) i was truly the sickest i’ve ever been in my life at the time (strep and mono 👎) and 2) me and my dad had a really complicated relationship so the whole sorry for your loss ritual doesn’t feel fitting and it was like 8 am so just overall i was in a weird mood and i didn’t want to deal that. and so she was like tell h...",
        "reddit_judgments": {
            "YTA": 25,
            "NTA": 49,
            "ESH": 7,
            "NAH": 4,
            "INFO": 7,
            "TotalJudged": 92
        },
        "total_judged": 92,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-10T06:06:45.275963"
    },
    {
        "id": "1r0hde7",
        "title": "AITA for uninviting my cousin from my wedding?",
        "url": "/r/AmItheAsshole/comments/1r0hde7/aita_for_uninviting_my_cousin_from_my_wedding/",
        "body_summary": "For the story, call me Ellie (32F). My cousin is Melanie (36F). When I got engaged, Melanie, who is a hairstylist, was thrilled. She kept insisting she wanted to do my hair and all of my bridesmaids’ hair. I was hesitant at first because mixing family and vendor roles can get messy, but she kept saying she really wanted it to be my wedding gift.\n\nSo I said yes… and asked her to be a bridesmaid too. She bought the dress, and everything seemed fine. A few months later, she flew into town to party with friends and told me that while she was in town, she’d swing by and do a trial run of my hair. She never showed. Later, she told me not to worry; she’d practice the weekend of the wedding.\n\nMeanwhile, around my wedding, she somehow managed to plan multiple vacations and schedule a BBL for the we...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 15,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 17
        },
        "total_judged": 17,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-10T06:06:52.814597"
    },
    {
        "id": "1r0brdz",
        "title": "WIBTA to force my friend to have a difficult conversation over something that isn’t an issue anymore",
        "url": "/r/AmItheAsshole/comments/1r0brdz/wibta_to_force_my_friend_to_have_a_difficult/",
        "body_summary": "I became friends with Alex over a year ago. I invited him to join our pool team with my close friends, and he became an active member of our group. He’s admitted without that invite, he would still be struggling to make friends.\n\nThere are a few things about Alex that makes me question if IATA in this situation:\n\n1.\t⁠He has major trauma around being rejected; he constantly makes statements about how we all will be done with his friendship soon.\n\n2.\t⁠He avoids difficult conversations at all costs.\n\n3.\t⁠Instead of being emotionally able to have conversations, his friendship style is to do over the top but very kind actions.\n\nBack in November, Alex invited a new woman to our pool team without asking. She then invited her friends to join. Those of us who started the team have felt uncomfortabl...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 30,
            "ESH": 1,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 35
        },
        "total_judged": 35,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-10T06:07:00.555913"
    }
]