[
    {
        "id": "1pr8aef",
        "title": "AITA for having my phone on DND at night?",
        "url": "/r/AmItheAsshole/comments/1pr8aef/aita_for_having_my_phone_on_dnd_at_night/",
        "body_summary": "So, earlier in the day, my mom told me to call her to wake her up so she doesn’t oversleep for her overnight job. She had been drinking. She needed to be awake by 11:45pm. I was at work when we had this conversation. I called twice at 11:30, no answer. After a while, I (28F) checked her ring camera to see if she was still there, she was. So I called again at 11:50. She didn’t answer. \n\nI forgot my phone goes into bedtime/dnd at 10:00 pm, I honestly didn’t think anything of it because I was working & my mind wasn’t on that. I got off at 12:05 am. My coworker gave me a ride, we’re talking the whole way. I get home at 12:35, I see 7 missed calls from my mom and 8 missed calls/2 voicemails from my dad. \n\nApparently my mom called my dad because I didn’t answer her calls. Which led to him callin...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 117,
            "ESH": 1,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 125
        },
        "total_judged": 125,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-21T05:13:52.033122"
    },
    {
        "id": "1pr6kdv",
        "title": "AITA for not picking up that my husband hates my “ambient” audio?",
        "url": "/r/AmItheAsshole/comments/1pr6kdv/aita_for_not_picking_up_that_my_husband_hates_my/",
        "body_summary": "I (32F) was reading in one room of our house  when my husband (33M) came in from another room to chat about something. I was playing one of those “ambient” soundtracks on YouTube. This particular one sounds like typing. I get it’s not for everyone, but I find it relaxing. My husband asked what the audio was, and I told him. He seemed to think it was strange, but we moved on and kept chatting. \n\nI didn’t notice anything amiss, but a few minutes later, he eventually gets a really concerned look on his face. I asked him what was wrong, and he said that the audio was extremely annoying, and asked me to turn it off, which I did. Now, he’s mad at me because he says he glanced repeatedly at the speaker, expecting me to “get the hint” that the audio was bothering him. I really didn’t notice. AITA?...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 118,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 120
        },
        "total_judged": 120,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-21T05:14:08.307665"
    },
    {
        "id": "1pr8je3",
        "title": "UPDATE: WIBTA if I told our parents what my brother has been telling me in confidence?",
        "url": "/r/AmItheAsshole/comments/1pr8je3/update_wibta_if_i_told_our_parents_what_my/",
        "body_summary": "*Link to prior post:*\n\n[https://www.reddit.com/r/AmItheAsshole/comments/1iql2t0/wibta\\_if\\_i\\_told\\_our\\_parents\\_what\\_my\\_brother\\_has/](https://www.reddit.com/r/AmItheAsshole/comments/1iql2t0/wibta_if_i_told_our_parents_what_my_brother_has/)\n\nLet me start off with an apology for waiting ten months to update. I (*now 24*) am in school, wrapping up a degree, suffered a myriad of health problems (blew out a shoulder twice, two kidney stones, etc), took over my lease solo, and more, over the year that completely wiped this post from the forefront.\n\n**The update:**\n\nI never ended up saying anything to our parents, as I *did* agree with many of the comments on the original post that I would've been the A-hole if I said anything. I did start asking more pointed questions about how he was doing...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 0,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 0
        },
        "total_judged": 0,
        "reddit_verdict": "No Judgments Found",
        "fetched_utc": "2025-12-21T05:14:23.847700"
    },
    {
        "id": "1prfeah",
        "title": "AITAH for not folding my son's boyfriend's laundry?",
        "url": "/r/AmItheAsshole/comments/1prfeah/aitah_for_not_folding_my_sons_boyfriends_laundry/",
        "body_summary": "I (48f) and a single mom of two adult men (ages 20 and 24). My eldest's boyfriend (21m) lives with us.  My son and his boyfriend often do their laundry together.  My son's boyfriend prefers that their laundry be folded right out of the dryer, where I usually put mine back in my laundry basket and fold it in my room.  I work from home, so I do my laundry when I'm on a break and fold it when I'm on another break.  I don't really have the time to fold it right out of the dryer.\n\nIf my laundry is still in the dryer when the boys need to put theirs in, my son's boyfriend will fold my clothes and hang up my t-shirts, though my skirts and dresses are put in a pile on the dryer (I'm guessing he doesn't know what to do with them).  I hate when he does this because 1. I don't like my t-shirts hung u...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 106,
            "ESH": 0,
            "NAH": 3,
            "INFO": 4,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-21T05:14:40.810336"
    },
    {
        "id": "1pr9bd6",
        "title": "AITA for telling my cousin the truth when she asked for my opinion?",
        "url": "/r/AmItheAsshole/comments/1pr9bd6/aita_for_telling_my_cousin_the_truth_when_she/",
        "body_summary": "AITA for being honest when I was asked for my opinion?\n\nThis happened about a month ago, and I’m still thinking about it.\n\nI have a cousin who is very close to me, like a best friend. She has been married for a little over a year. Some time ago, she left her husband’s home and went back to her parents because of ongoing family problems and feeling constantly disrespected. This situation caused a lot of tension between the families.\n\nLater, there was a family discussion about what happened. During that conversation, my cousin’s mother asked me directly:\n“If you were in her place, would you stay or would you leave?”\n\nI didn’t bring this topic up myself and I wasn’t trying to give advice. I was asked a direct question, so I answered honestly. I said that I personally would leave, because I wo...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 32,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-21T05:14:56.543026"
    },
    {
        "id": "1prhg92",
        "title": "AITA for moving out of my apartment 2 weeks before christmas?",
        "url": "/r/AmItheAsshole/comments/1prhg92/aita_for_moving_out_of_my_apartment_2_weeks/",
        "body_summary": "I (22M) live in an apartment with 5 other men in a college town apartment. 2 of the guys who i’ll call Travis (21M) and LLFF (19M) actually are on the lease while the four of us just pay our 1/6th of the rent. The office is aware of us, so we’re not doing anything not allowed. i’ve lived with them for probably 3 years now. \n\nI barely spend any time in the apartment as i’m usually at class or work. the last year and a half actually i’ve had work that i have to travel sometimes for, so i’ll be out of the house for sometimes 3-4 days straight. Over these years that i’ve lived with them i haven’t had many issues with any of them. i’d actually consider most of them to be good friends.  Most of the time im not even in the apartment so there’s no way for us to really argue. The one guy LLFF is a ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 9,
            "ESH": 4,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-21T05:15:12.266959"
    },
    {
        "id": "1prh33f",
        "title": "AITA for not buying my 12 year old cousin a gift ?",
        "url": "/r/AmItheAsshole/comments/1prh33f/aita_for_not_buying_my_12_year_old_cousin_a_gift/",
        "body_summary": "so for context, i am taking a gap year and working. but since its the winter, my job slashed my hours in half. i don’t have as much money and i’m saving for college. with that in mind, i bought people little things. i bought my other cousin a bigger gift, but nothing at all for my other cousin.\n\nmy reasoning is that i’m not close with him. he’s spoiled and get everything he wants. for the past few years he’s gotten really big gifts. why does he need a 40$ pair of boxing gloves to open on christmas from me ? my aunt sent me a ton of links and things that he wants so he can have something to open on christmas because his big gift isn’t arriving in time. but, i have not had a conversation with this kid for like 2 years. he doesn’t hug me or say goodbye when we leave other family gatherings, w...",
        "reddit_judgments": {
            "YTA": 33,
            "NTA": 16,
            "ESH": 2,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-21T05:15:28.221050"
    },
    {
        "id": "1pr9r2v",
        "title": "AITA for buying my SO a cheap Xmas present",
        "url": "/r/AmItheAsshole/comments/1pr9r2v/aita_for_buying_my_so_a_cheap_xmas_present/",
        "body_summary": "My partner and I \\[27 and 28\\] have been together almost 4 years and in that time I have gotten them some of the best gifts they've ever gotten in their life, I'm talking suprise trips, obscure underground records, etc. including a cool gift I got them for their birthday 2 weeks ago\n\nTheir Christmas present got delivered in the mail today and they kept asking me for hints about what it was and how much it was. I was honest and said not very much and I had been panicking trying to figure out what they wanted, so when I saw this I bought it. I warned them it's not super exciting. Telling them that really upset them and they said it felt like I wasn't really thinking of them and they feel unappreciated because they \"splurged\" on me, I spent a lot on family and friends, but I didn't spend a lo...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 19,
            "ESH": 3,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 24
        },
        "total_judged": 24,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-21T05:15:43.831878"
    },
    {
        "id": "1prc6kt",
        "title": "AITA For asking family and guests to be a little quieter",
        "url": "/r/AmItheAsshole/comments/1prc6kt/aita_for_asking_family_and_guests_to_be_a_little/",
        "body_summary": "Edit: this isn't his house—it's my mom's. She just wasn't home. \n\nMy (17M) step dad (53M) and two other people (family friends) were downstairs last night watching a football game, cheering and screaming really loudly. I had a flight to catch early the next morning and I couldn't sleep. It was 10:30 and the game wouldn't have stopped until midnight. I went and asked them very politely if they could be a little quieter because I had to wake up really early. The guests were pretty chill about it, but afterwards I overheard my stepdad, who has a history of being a bit of a manchild and going ape shit when told what to do, continuing to be loud out of spite. The guests urged him to be quieter, but he fought back and refused. The guests then said they were uncomfortable being here and invited h...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 17,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 21
        },
        "total_judged": 21,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-21T05:15:59.628401"
    },
    {
        "id": "1prgerb",
        "title": "AITA for not wanting my flatmate to use his phone on speaker late at night?",
        "url": "/r/AmItheAsshole/comments/1prgerb/aita_for_not_wanting_my_flatmate_to_use_his_phone/",
        "body_summary": "Last night my flatmate came in about 00:30 and proceeded to take a phone call on speaker. This got me up from my sleep up as my bedroom is literally next to the living area. On top of this he had entered my room earlier without permission to borrow something of mine so I told him he had interrupted my sleep and to stop. I can’t remember the tone or what I said being so late but I could have maybe been calmer. However, he thinks I was unreasonable saying he shouldn’t make calls on speaker right outside my room so late. His justification was he had been out all day and this was his only opportunity to make the call. AITA?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 7,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 8
        },
        "total_judged": 8,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2025-12-21T05:15:59.876873"
    }
]