[
    {
        "id": "1qjw09t",
        "title": "AITA for telling my family they need to get over my father walking me down on my wedding day and I am not uninviting him.",
        "url": "/r/AmItheAsshole/comments/1qjw09t/aita_for_telling_my_family_they_need_to_get_over/",
        "body_summary": "My father was absent for most of my childhood. I am the second oldest and he split when I was around 7 years olds. I have three other siblings ( my older brother, my younger brother and my youngest sister). Growing up everyone in the family hated him ( that includes me ) especially my mother and youngest sister.\n\n\n\nMy mother was not the best parent, she would be very verbally cruel. My trust in her is also gone due to her lying habit.\n\n\n\nMy father reached out to me when I turned 18 to get coffee.  He apologized to me and wanted to fresh start. I was hesitant at the beginning but decided to forgive and move on. He reached out to the other kids when they turned 18 and they wanted nothing to do with him. ( that’s their choice and right) \n\n\n\nHe did explain why he left my mother and I confirmed...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 124,
            "ESH": 2,
            "NAH": 6,
            "INFO": 2,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-23T05:20:30.584958"
    },
    {
        "id": "1qjyvsa",
        "title": "AITA for not giving my sister money I’ve been saving, even though she already told our parents I would?",
        "url": "/r/AmItheAsshole/comments/1qjyvsa/aita_for_not_giving_my_sister_money_ive_been/",
        "body_summary": "I’m 24F and still living at home. I’ve been saving money for a few years so I can eventually move out. I don’t make a lot, so it’s been slow and I’ve had to say no to a lot of things to build it up. My family knows I’m careful with money. My sister is 29 and has been having money problems for a while. She quit her job last year and has been picking up random work here and there, but nothing consistent. A few days ago she came to me saying she needed help paying some bills. I told her I didn’t really have money to spare. She then said she already told our parents that I’d help her. I was honestly caught off guard. When I said no again, she got upset and said I’m the only one with savings and that I can “always save again later.” Now my parents keep bringing it up. They aren’t forcing me, bu...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 134,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-23T05:20:48.426906"
    },
    {
        "id": "1qjw8x2",
        "title": "AITA For not letting my child have a sleepover with his step-siblings at my place?",
        "url": "/r/AmItheAsshole/comments/1qjw8x2/aita_for_not_letting_my_child_have_a_sleepover/",
        "body_summary": "(Customary: Throwaway + English is not my first language)  \n  \nI (33f) have a son (6) with my ex (35m). We split up over two years ago. We didn't end our relationship on good terms and we only communicate about child-related things. I don't know much about his personal life outside of basic info- he's dating a woman I only met once. She has three kids I've never met. I only know their names thanks to my child's stories and a single birthday card they'd signed for my child. I don't even know their exact ages, all I know is that they're in primary school, but are older than my kid (so they're between 7-11y/o). I am more than happy with this arrangement too. That's why I am very confused by their request to have two of the stepsiblings over for a sleepover. \n\nBackground- my child just had his...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 107,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 116
        },
        "total_judged": 116,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-23T05:21:05.180859"
    },
    {
        "id": "1qjrz8t",
        "title": "AITA for not seeing my parent’s country as home?",
        "url": "/r/AmItheAsshole/comments/1qjrz8t/aita_for_not_seeing_my_parents_country_as_home/",
        "body_summary": "I (28m) have lived in the UK since I was 5 when my father got  offered a job here with his company. This was meant to only be for a few years but we ended up living here for most of the next 13 years, with my family moving “home” when I was 18. I’d already applied to university here so I stayed in the UK and then got a job here when I graduated.\n\nI never thought this was overly strange, I have my British passport, don’t have an accent and culturally feel British. I occasionally visit my parents home country, more so at the start but covid and work have got in the way of visiting more than once a year, normally for Christmas or a family event. \n\nThis year my girlfriend flew out for a couple of weeks after Christmas, to meet my parents for the first time. We’ve been dating for 4 years but th...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 77,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 80
        },
        "total_judged": 80,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-23T05:21:21.633970"
    },
    {
        "id": "1qjs5w7",
        "title": "AITA for \"calling out\" a coworker's kimchi in the office fridge ?",
        "url": "/r/AmItheAsshole/comments/1qjs5w7/aita_for_calling_out_a_coworkers_kimchi_in_the/",
        "body_summary": "Hi everyone ! Long time lurker, rarely poster, but this has been bothering me for a few days. Apologies for any English mistakes, as it is not my first language. \n\n  \nStraight to it: me and my colleagues share an office fridge, and there have rarely been any issues up until recently. A coworker brought in, a few days ago, a bag of kimchi – it is not homemade, as it is stored in the bag it is sold in, one that my coworker has then closed with a little claw clip thingy. You know, those things they sell at IKEA? It will be relevant, as well, it is not hermetic at all. \n\nNow, to preface: I have nothing against \"cultural\" foods (because this is what I've been getting in terms of criticism) and I absolutely love Korean food, kimchi included. \n\nThe issue is that that godforsaken kimchi bag has be...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 61,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 64
        },
        "total_judged": 64,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-23T05:21:37.723683"
    },
    {
        "id": "1qjxzmk",
        "title": "AITA for going to a store that carries XS/S sizes even though my M/L told me not to?",
        "url": "/r/AmItheAsshole/comments/1qjxzmk/aita_for_going_to_a_store_that_carries_xss_sizes/",
        "body_summary": "Me (22F) and my (22F) friend were out shopping last week. I usually don’t like shopping much, because I rarely find anything my size. Due to my height and body shape, finding clothes is really difficult. I’m short and thin but curvy if that makes any sense. It’s not that I never find anything my size, it’s just that on the off chance that I do, it’s not really my style. So whenever my friend and I go out shopping, I kind of just tag along wherever she wants to go. Mostly because I don’t really expect to find anything.\n\nThe other week, however, we came across a new store that had just opened (I’m not going to name said store for privacy purposes). The window to it clearly showed sizes that were for smaller and thinner people, so I thought I’d give it a go. But my friend said it’d be a waste...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 109,
            "ESH": 1,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 124
        },
        "total_judged": 124,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-23T05:21:55.329993"
    },
    {
        "id": "1qk4by7",
        "title": "AITA for telling my mom I'll never have kids out of spite?",
        "url": "/r/AmItheAsshole/comments/1qk4by7/aita_for_telling_my_mom_ill_never_have_kids_out/",
        "body_summary": "My (18F) mom (58F) had me when she was 40, as she was always busy working in her 20s-30s. She loves children, and always wanted at least 2, but was unable to due to her age.\n\nEver since I turned 12, my mom would always make comments about how she's \"so excited to hold her grandchildren\".\n\nWhen I turned 16, she told me that I should freeze my eggs in my early 20s in case I don't have children by then. I understand where she's coming from, but it felt extremely uncomfortable for my mom to be talking about grandchildren when I myself was a child. I asked her if she wanted me to get pregnant at 16, and she said she would take care of the baby if I did.\n\nTo add to that, we are East Asian, and the East Asian beauty standard is basically European features (big eyes, tall nose bridge, light hair, ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 80,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 82
        },
        "total_judged": 82,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-23T05:22:11.284789"
    },
    {
        "id": "1qkb4ub",
        "title": "AITA for spending $350 on winter clothing",
        "url": "/r/AmItheAsshole/comments/1qkb4ub/aita_for_spending_350_on_winter_clothing/",
        "body_summary": " I(43f) am @ odds with both my husband (45m) & our 3rd of 4 kids (18f) over having bought $350 of winter clothing. 3 years ago I started losing weight & couldn’t figure out why for nearly a year. I got down to 100lbs before they removed the malfunctioning body part. I’m back to 130. I hadn’t gone out & bought new winter things before this because I was hoping to get back up a higher number. So I didn’t have a coat or boots or anything. \n\n So today I went out & spent $350 @ my favorite clothing store (I have a store credit card) because they are having their end of year sale still. I got a pair of boots, thermal pants & a long sleeved thermal shirt, 4 sweaters, & a winter coat rated for -15C. \n\n My husbands issue is the amount of money spent though he admitted that I got great deals (the co...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 121,
            "ESH": 1,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 129
        },
        "total_judged": 129,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-23T05:22:28.477797"
    },
    {
        "id": "1qjytof",
        "title": "WIBTA If I told my roommates gf the truth about what it's like to live with him?",
        "url": "/r/AmItheAsshole/comments/1qjytof/wibta_if_i_told_my_roommates_gf_the_truth_about/",
        "body_summary": "Okay so I (32f) have been having an issue with my roommate, lets call him Joe (35m). We moved in together last year as we were both looking for a pet friendly home (I have cats and a dog, he has an extra large breed dog) and since we had be friends for a while figured it was a good idea. We were supposed to split housework evenly but so far that hasnt happened. When it's his turn to do dishes he puts dirty dishes back into the cabinet for me to find (he claims he \"doesn't see it\", despite me talking to him about it no less than 3 times a week for the last 11 months), in the last 11 months he's cleaned the bathroom a whopping total of 5 times, and each time I had to go back and reclean the sink, toilet, mirror, and shower because they were not done and were still visibly dirty, and that was...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 51,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-23T05:22:45.268736"
    },
    {
        "id": "1qjr11b",
        "title": "AITA for not wanting to share my username on a book app with my girlfriend?",
        "url": "/r/AmItheAsshole/comments/1qjr11b/aita_for_not_wanting_to_share_my_username_on_a/",
        "body_summary": "I (20M)  was on a call with my (20F) girlfriend recently talking about books. A long time ago, I recommended her a book on an app we both use because it matched her interests. She read it, liked it, and asked me for more recommendations.\n\nI said I’d look for more books for her, but she suggested that we just exchange usernames so she could directly browse my library on the app. The thing is, I felt embarrassed because more than half of the books in my library are guilty-pleasure reads that I don’t really want to share. I told her I could just recommend books manually instead of sharing my username.\n\nAfter that, she went quiet and started scrolling on her phone. I asked what was wrong, and she kept saying “nothing,” but the mood was clearly off. I kept asking, got frustrated, and eventually...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 48,
            "ESH": 25,
            "NAH": 5,
            "INFO": 5,
            "TotalJudged": 91
        },
        "total_judged": 91,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-23T05:23:03.744059"
    }
]