[
    {
        "id": "1qlfoan",
        "title": "AITA for making my dad and 13-year-old brother cook for themselves for the first time ever?",
        "url": "/r/AmItheAsshole/comments/1qlfoan/aita_for_making_my_dad_and_13yearold_brother_cook/",
        "body_summary": "Update: My brother apologised and promised to make meals and help out with chores. And somehow even dad agreed to help out. Thank you all for your insights and I really appreciate it.\n\nSo I need an outside perspective because my dad says I was cruel, but I honestly feel relieved.\n\nFor context:\nMy dad is in his 50s and has never cooked a meal in his life. My mom does all the cooking, and when she gets angry because she is tired of doing chores all day with cooking  he taunts her or complains instead of helping. I’ve been cooking since I was 12, so when my mom doesn’t feel well or is busy, I usually step in.\n\nMy brother is 13 and also expects either my mom or me to cook for him. My mom does sometimes tell them to cook, but she always gives in and ends up doing it herself, so nothing ever cha...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 146,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 147
        },
        "total_judged": 147,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-25T05:21:56.544745"
    },
    {
        "id": "1qlx4ir",
        "title": "AITA for not wanting to eat my parents’ meals while pregnant even though they’re trying to help save money?",
        "url": "/r/AmItheAsshole/comments/1qlx4ir/aita_for_not_wanting_to_eat_my_parents_meals/",
        "body_summary": "I(28F) am pregnant and my husband (31M) and I live in our own house right next to my parents. To help us save money, my parents often buy groceries and cook dinners for all four of us, which I appreciate.\n\nThe problem is my dad is extremely controlling and picky about food. He only likes a few very basic meals (like plain chicken and rice, pork chops with a ton of butter, canned vegetables, etc). When he finds something he likes, he will make it multiple times a week, so we eat the same four or five meals on rotation constantly. If I suggest something different (like not having green beans 3 days in a row), he shuts it down with “nah, nah, nah, it’s better this way.” He also complains or claims food makes him sick if it isn’t done exactly how he wants, unless he doesn’t know what’s in it, ...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 57,
            "ESH": 11,
            "NAH": 9,
            "INFO": 2,
            "TotalJudged": 93
        },
        "total_judged": 93,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-25T05:22:14.806475"
    },
    {
        "id": "1qlnz6v",
        "title": "AITA for coming home late from the gym and waking my niece, and refusing to compromise?",
        "url": "/r/AmItheAsshole/comments/1qlnz6v/aita_for_coming_home_late_from_the_gym_and_waking/",
        "body_summary": "I (f23) rent a place together with my mother. Around one night a week she has my sister's daughter (f6) round for a sleepover, normally on a Friday or Saturday to give my sister a break.\n\nI work full-time. My only day off is a Monday. After work I always go straight to the gym. I finish work at 9pm and I'm normally home from the gym around 10.30ish depending on traffic.\n\nMy mother has asked me to skip the gym on Fridays and Saturdays because when I come home late, her dog barks (he always barks when someone comes through the door) and this wakes up my niece. If I notice my niece has been awoken I always tell her it's just me so she doesn't get frightened and she goes back to sleep.\n\nI told my mother I don't think it's reasonable to ask me not to go to the gym just because she might have my...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 99,
            "ESH": 0,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 110
        },
        "total_judged": 110,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-25T05:22:31.637600"
    },
    {
        "id": "1qlpecd",
        "title": "AITA for not changing my routine so my roommate can sleep?",
        "url": "/r/AmItheAsshole/comments/1qlpecd/aita_for_not_changing_my_routine_so_my_roommate/",
        "body_summary": "&#x200B;\n\nI (21M) share an apartment with my roommate “Ben” (22M). We split rent evenly. No written rules beyond basic stuff like cleaning shared areas and not blasting music late at night.\n\nI wake up at 5:30 AM on weekdays for school + a part-time job. Ben doesn’t work mornings and usually sleeps around 2–3 AM gaming or watching videos.\n\nI try to be quiet, but realistically I still make some noise: alarm goes off once, I shower, make coffee, and leave by 6:15. I don’t play music, I don’t talk loudly, and I prep most of my stuff the night before.\n\nRecently Ben started complaining that I’m “ruining his sleep” and said I should either: • change my alarm to vibrate only\n\n• stop showering in the morning\n\n• or wait to make coffee until I leave\n\nI told him I’m already being reasonable and that i...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 84,
            "ESH": 2,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 96
        },
        "total_judged": 96,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-25T05:22:47.756191"
    },
    {
        "id": "1qlv93v",
        "title": "AITA for wanting to keep my personal space? Friend called me selfish for not letting her crash.",
        "url": "/r/AmItheAsshole/comments/1qlv93v/aita_for_wanting_to_keep_my_personal_space_friend/",
        "body_summary": "I’m a 25-year-old guy, and I finally managed to get my own small apartment after saving up for ages. I’m definitely not rolling in cash, so I have to be really strict with my budget just to keep up with rent and bills. My friends all know I’m the type of person who needs order and isn't a fan of last-minute changes.\nRecently, one of my close friends (26F) went through a breakup and has been couch-surfing. She asked if she could crash at my place 'for a while.' I was honest with her and said I wasn't comfortable with that because I really value my privacy and space. She seemed okay with it at first, but then I found out she’d already told our group of friends that I was her 'backup plan' and she was moving in.\nWhen I stood my ground, she flipped. She called me selfish, saying that since I l...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 70,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-25T05:23:03.469361"
    },
    {
        "id": "1qls37u",
        "title": "AITA For wanting to Travel alone during our second japan trip to enjoy japan more instead of taking care of my friend",
        "url": "/r/AmItheAsshole/comments/1qls37u/aita_for_wanting_to_travel_alone_during_our/",
        "body_summary": "i (25M) have been friends with another (25m) about 12 years,we went to same school and staed close into adulthood. he's the only son living with parents ahd got no financial resposiblities , During covid he became extremly into anime and VTUBERS, spends almost all his income on merch. \n\n  \nhis mother often asked me and other friends look out for him because we are more independent and outspoken, So i tried to help him turns his hobby into something healthier , encouraging him to do art commision and sell anime figures at conventions and helping him to meet more people , I don't even like anime or Vtubers, But i just forced myself to learn and participate to support him during all these time.\n\n  \nHis Dream was to go japan, so we went together for the first time. During that trip, almost eve...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 36,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 38
        },
        "total_judged": 38,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-25T05:23:19.147180"
    },
    {
        "id": "1qlq6fh",
        "title": "WIBTA if I moved to my dad because I have to share a room with my sister",
        "url": "/r/AmItheAsshole/comments/1qlq6fh/wibta_if_i_moved_to_my_dad_because_i_have_to/",
        "body_summary": "I (17f) am thinking about moving to my dads.Ii currently live with my mom, stepdad and sister (23f) in a 4-bedroom house where we rent 2 bedrooms and the other 2 are unoccupied. My mom can't afford to rent another room for me and my sis to have our own.   \nMy sister recently moved back in because she is pregnant and the commute from where she used to live before is very long. So we are now sharing a very small room. I understand that she has nowhere also to go but it is also very inconvenient. I have my A Level exams this year and I normally stay up late studying, doing homework or talking with friends etc but because she is here, I can't do that because she has work the next morning. She also snores very loudly which keeps me up at night and is very irritable which is probably because she...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 24,
            "ESH": 0,
            "NAH": 5,
            "INFO": 2,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-25T05:23:34.792734"
    },
    {
        "id": "1qlmpxc",
        "title": "AITA for refusing to do everything for my younger sister?",
        "url": "/r/AmItheAsshole/comments/1qlmpxc/aita_for_refusing_to_do_everything_for_my_younger/",
        "body_summary": "I (20F) am the oldest of four, and my sister the youngest 10F. I’ve been babysitting and taking care of my siblings since I was very young, so I grew up with a lot of responsibility. Now that I’m older, I’m trying to live my own life, but my parents keep pulling me back into that role, which has caused tension between me, them, and my sister.\n\nWhenever I go out with friends, my parents insist I take my sister along. If I say no, I’m called selfish. I don’t mind taking her sometimes, especially if my friends have siblings her age, but it always feels like I’m babysitting and can’t enjoy myself. When I want to spend time alone with my adult friends, I decline because it doesn’t make sense to bring a 10 yr old.\n\nStill, my sister clings to me, and I’m often pressured into taking her, which men...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 26,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-25T05:23:50.314155"
    },
    {
        "id": "1qlg66e",
        "title": "WIBTA if I confront my neighbour about her shouting at our visitors?",
        "url": "/r/AmItheAsshole/comments/1qlg66e/wibta_if_i_confront_my_neighbour_about_her/",
        "body_summary": "I live in a quiet cul-de-sac in UK. There’s only 16 houses on the street and we have a friendly WhatsApp group. Everyone knows everyone and I’ll always say hello to anyone I bump into.\n\nWe have two small children who often spend the day with my mother in law, their grandmother. When she brings them back, one of us is obviously in so there’s always one of our cars on the drive meaning she would park across our drive to drop the kids off as safely as possible.\n\nOur drive is directly opposite the one across the road to us and one day after MIL dropped the kids off she went back to the car to find the woman who lives opposite very irate, let’s called this woman, Charlotte. Charlotte is angry at MIL as she couldn’t easily get her car into her own drive and demands that MIL never parks there aga...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 16,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-25T05:24:05.923035"
    },
    {
        "id": "1qlry8t",
        "title": "AITA for locking my room because my family keeps using my stuff?",
        "url": "/r/AmItheAsshole/comments/1qlry8t/aita_for_locking_my_room_because_my_family_keeps/",
        "body_summary": "I (24M) live with my parents and my younger brother (20M). Over the past year, my family has gotten into the habit of using my things without asking. This includes my clothes, headphones, snacks, and even my phone charger. Every time I bring it up, they brush it off and say things like, “We’re family, it’s not a big deal.”\n\nThe breaking point for me was when I bought an expensive pair of headphones with my own money. I keep them in my room because I don’t want them damaged or lost. A few days later, I found them on my brother’s desk with scratches on them. When I confronted him, he said he just borrowed them and didn’t think it mattered.\n\nI told him that borrowing without asking wasn’t okay, especially for things I paid for myself. He got defensive and said I was being selfish and overprot...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 32,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-25T05:24:21.439598"
    }
]