[
    {
        "id": "1p1y9t2",
        "title": "AITA for refusing to keep covering my coworker’s shifts when she still owes me $700?",
        "url": "/r/AmItheAsshole/comments/1p1y9t2/aita_for_refusing_to_keep_covering_my_coworkers/",
        "body_summary": "I, 23F work at a coffee shop with Kayla 26F. 15 months ago she was sobbing about vet bills and rent so I lent her $800 cash. We wrote it down, both signed it, she promised to pay back. But I’ve gotten exactly $100 total since then. Meanwhile she’s out getting new tattoos, Uggs, concerts, the usual. I’ve covered at least 14 of her shifts this past year due to hangovers, dates, I’m tired, babysitter issues etc. Never once complained. She has never covered for me, not even when I’ve asked in advance. Last night she texted begging me to take her opening shift today because she’s exhausted. I’d just worked a double and was scheduled to close again. I told her no, that I’m done covering until she pays back the $700 she still owes me. She freaked out, called me heartless played the single-mom car...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 118,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 122
        },
        "total_judged": 122,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-21T05:12:21.393995"
    },
    {
        "id": "1p2bwpz",
        "title": "AITA for not allowing my DIL to join a camping trip and doubling down on it",
        "url": "/r/AmItheAsshole/comments/1p2bwpz/aita_for_not_allowing_my_dil_to_join_a_camping/",
        "body_summary": "Edit I think some people are confused. We kayak to the first campsite, sleep, kayak to the next sleep and kayak to the final spot and head home . \n\nI am an outdoors person, and before the weather gets too cold I do a camping trip. We kayak down the the river make camp on the bank. It is a lot of fun and is a two night trip. \n\nI have done this with all of my kids and have started to invite their spouses, some show up and some don’t. (Not everyone likes camping). The river we kayak on can get a fast and choppy in places. I have a strict no kids under 10 rules and that they have to good swimmers. \n\nThis bring me to my sons wife (Jane- fake name) Jane can not swim at all. She never learned as a child and she still hasn’t learned as an adult. The most I have ever seen her do is go into the shal...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 150,
            "ESH": 1,
            "NAH": 4,
            "INFO": 4,
            "TotalJudged": 162
        },
        "total_judged": 162,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-21T05:12:40.434677"
    },
    {
        "id": "1p2cys4",
        "title": "AITA for expressing my surprise that my fiancée didn't know who Muhammad Ali was?",
        "url": "/r/AmItheAsshole/comments/1p2cys4/aita_for_expressing_my_surprise_that_my_fiancée/",
        "body_summary": "Hi, the other day my fiancée and I were watching baseball, and the infographic and commentary were showing some stats of Babe Ruth. So I told her (she doesn't really watch that much baseball), that Babe Ruth was like the Muhammad Ali of baseball. She asked me who Muhammad Ali was and I said you know, Muhammad Ali. She was still confused and I realized she didn't know who Muhammad Ali was so I said how do you not know who Muhammad Ali is. And I told her about him.\n\nI noticed she was quite afterwards, so I asked if she was good, and she said she was hurt at the way I had been surprised at her not knowing who Muhammad Ali was. I said he wasnt just a boxer, he was a cultural icon so it just took me by surprise that she didn't know who he was. \n\nThen yesterday she came across something on her I...",
        "reddit_judgments": {
            "YTA": 44,
            "NTA": 63,
            "ESH": 11,
            "NAH": 8,
            "INFO": 5,
            "TotalJudged": 131
        },
        "total_judged": 131,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-21T05:13:01.299329"
    },
    {
        "id": "1p1wgs5",
        "title": "AITA For calling my roommate out for not washing his hands after using the bathroom?",
        "url": "/r/AmItheAsshole/comments/1p1wgs5/aita_for_calling_my_roommate_out_for_not_washing/",
        "body_summary": "I notice my roommate doesn’t wash his hands after he uses the restroom, I’ve noticed this every time.  I said to him while he walked out of the bathroom “You gotta wash your hands after you piss that’s nasty”  was I too forward? I just feel like it’s gross!  I feel like it’s basic hygiene. I’m just worried I was too direct. I don’t know, let me know.",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 37,
            "ESH": 0,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-21T05:13:01.875499"
    },
    {
        "id": "1p2f9tw",
        "title": "AITA for mocking my parents after they horribly botched the death of our first ever family pet",
        "url": "/r/AmItheAsshole/comments/1p2f9tw/aita_for_mocking_my_parents_after_they_horribly/",
        "body_summary": "I'm in my early 20s. My dad had fish in a fishtank when I was young (they kept jumping out and killing themselves until the entire tank exploded). I had to beg my parents to get a pet, since I have LOVED dogs since I was little.\n\nEventually, my constant whining was enough that they half-caved and got us a snake when I was 8 (we still got a dog when I was 10, because I was an extremely stubborn brat when I was little). The snake was an Albino Milksnake, which is a 4ft long nonvenemous snake whose patterning loosely resembles a candy cane. Because I was 8, I named the snake \"Red\". Red was our first family pet, and we loved her to death (even though my Dad did try to convince us to get rid of her a few times when I was in high school).\n\nFlash forward to when I'm in college on the other side o...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 32,
            "ESH": 6,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-21T05:13:18.018818"
    },
    {
        "id": "1p2gejw",
        "title": "AITA For Accidentally Bumping into Someone?",
        "url": "/r/AmItheAsshole/comments/1p2gejw/aita_for_accidentally_bumping_into_someone/",
        "body_summary": "So some context, we have this employee (mid20s M, we'll call him Tod) at work who tends to not be aware of his surroundings and doesn't pay attention.\n\nSo today at work I (33F) was walking towards a desk when Tod was walking around the area. I noticed if I continued on the current path we were going to walk into each other, so I moved towards to the side and continued walking. At the last moment, Tod ended up changing directions and we very gently bumped into each other.\n\n  \nHe then says to me, \"An excuse me would be helpful to know you're there.\"\n\nI responded, \"I already moved out of the way to avoid bumping into each other, but it's no big deal, it's all good.\"\n\nThen Tod said, \"You need to say excuse me still.\" \n\nI shrugged and decided to let it go, wasn't worth arguing about and it wasn...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 17,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 18
        },
        "total_judged": 18,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-21T05:13:33.507051"
    },
    {
        "id": "1p2i7g3",
        "title": "AITA for only training the puppy things that are convenient to me?",
        "url": "/r/AmItheAsshole/comments/1p2i7g3/aita_for_only_training_the_puppy_things_that_are/",
        "body_summary": "I have a dog who is trained. My sister (who is also my roommate) also has a \"puppy\" who is not really a puppy anymore and isn't trained at all. I made it clear I wouldn't train the puppy and she shouldn't get it, and I haven't made any effort to train it. So this puppy doesn't know basic commands like sit, stay, recall, or anything really. However I have \"trained\" it to \"leave it\" (meaning leave my dog alone) when I am training/playing with my own dog, and to leave my dog alone when I give my dog puzzles/enrichment toys. \n\nMy sister thinks that if I have enough time to do this I should help her out and actually train her puppy. I don't think i'm the asshole because it's not my puppy and I told her before she got it that I wouldn't do that. She thinks i'm the asshole because I have experien...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 52,
            "ESH": 22,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 82
        },
        "total_judged": 82,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-21T05:13:49.587371"
    },
    {
        "id": "1p254bi",
        "title": "AITA for stepping on a stranger's novelty collectible at the movie theatre last night?",
        "url": "/r/AmItheAsshole/comments/1p254bi/aita_for_stepping_on_a_strangers_novelty/",
        "body_summary": "My partner and I decided to catch an early screening of Wicked:For Good last night. I live in Canada (weed is legal here), so we had a quick smoke before heading in. I don't love being stoned in public as I'm prone to getting anxious, so I smoke a very modest amount. We head into the theatre. Our assigned seats are in the middle of a row. I tend to avoid these seats since I hate shuffling past people, but there weren't many open seats remaining when we got the tickets. We were going to a big theatre where the walking space in each row is quite spacious, so I thought it'd be fine.\n\nWe walk into our row (my partner in front), and one of the other attendees sitting two seats away from us has a large, brown paper bag sitting on the ground perpendicular to the seats. It's taking up the entire w...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 55,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-21T05:14:05.424727"
    },
    {
        "id": "1p27oa8",
        "title": "AITA for tell my sister she isn't a parent",
        "url": "/r/AmItheAsshole/comments/1p27oa8/aita_for_tell_my_sister_she_isnt_a_parent/",
        "body_summary": "My (f26) sister (f22) got a new boyfriend (m34) earlier this year. They've been together around 7 months after about two months of dating the new BF moved sister into his house. The thing with BF is he has three kids from previous relationships but only has custody of the youngest (m3). I've met BF and his son and I have no problem with them. I have two kids of my own (f4,m2) and another on the way. My problem comes with how sister has been acting. Ever since she moved in she has immediately started acting like this boys mom and to me and other parents I know bio and step alike are confused by this behavior. I've tried to talk to her about it respectfully but she hasn't listened. I think it's great that she cares about this kid and wants to be there for him especially because in the past s...",
        "reddit_judgments": {
            "YTA": 108,
            "NTA": 14,
            "ESH": 10,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-21T05:14:22.723738"
    },
    {
        "id": "1p1z9bc",
        "title": "AITA for not inviting my brother to my daughter's birthday party",
        "url": "/r/AmItheAsshole/comments/1p1z9bc/aita_for_not_inviting_my_brother_to_my_daughters/",
        "body_summary": "I (37m) have PTSD from a rough childhood that involves my older sister. I opened up about it roughly 1.5 years ago and have been dealing with the fallout since. I've had a lot of therapy and am doing a bit better, I just still have a long way to go. But as a result, I have trust issues, and I've never really felt connected to anyone except for my wife and daughter.\n\nWhen I opened up, my parents and brother were in panic mode, and understandably so. However, my family has completely failed to support me. My parents have trivialized the trauma and basically don't want to know anything about it. They have made zero effort of supporting me. They are completely closed about everything and prefer to stick their heads in the sand.\n\nMy brother had a ton of questions in the first few weeks, but it ...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 9,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 15
        },
        "total_judged": 15,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-21T05:14:38.255073"
    }
]