[
    {
        "id": "1qr6ive",
        "title": "AITA for not sending coworker my template after he basically used my stuff in a meeting and didn't mention I helped?",
        "url": "/r/AmItheAsshole/comments/1qr6ive/aita_for_not_sending_coworker_my_template_after/",
        "body_summary": "I (28M) work on a small team and there's a newer guy on our team (I'll call him Joe). We sit near each other and our work overlaps a lot so I've helped him out here and there.\n\nA few weeks ago he asked me how I put together this weekly report we have to do. Over the years I've made my own template and a routine that makes it way faster.\n\nHe asked if I could send him my template file. I told him I'd happily walk him through how I do it and explain the steps but I didnt really want to just hand over my exact file. It's basically my personal workflow and I've tweaked it forever.\n\nSo I stayed after work and spent about 45 minutes showing him everything. I shared my screen, explained where I pull the numbers, order I do things, what to watch out for, ALL of it. He took notes, thanked me, seemed...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 110,
            "ESH": 11,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 127
        },
        "total_judged": 127,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-31T05:32:12.290768"
    },
    {
        "id": "1qrmrdz",
        "title": "AITA for not allowing my ex to see sonogram photos of his child?",
        "url": "/r/AmItheAsshole/comments/1qrmrdz/aita_for_not_allowing_my_ex_to_see_sonogram/",
        "body_summary": "I (32f) dated my ex (33m) for two years. During that time, our relationship was very difficult. One weekend, he was mad at me because he thought that a man was trying to flirt with me when we were at a store. So he refused to speak to me the entire weekend. We did not live together full time. That Saturday, I found out I was expecting but also losing said expectation at the same time. I tried to call him from the hospital and he ignored my call so my best friend called him and he did answer for her. She told him what was going on. She lives out of state. He didn’t reach out to me or come to the hospital. I did not hear from him until the following Tuesday. Needless to say, I never got over that and we broke up shortly thereafter. He never apologized and said the “problem took care of itsel...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 86,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 90
        },
        "total_judged": 90,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-31T05:32:20.121675"
    },
    {
        "id": "1qr2q1g",
        "title": "WIBTA if I went on a mom strike",
        "url": "/r/AmItheAsshole/comments/1qr2q1g/wibta_if_i_went_on_a_mom_strike/",
        "body_summary": "My husband and I both work full time and have three teens (18, 16, and 14) at home. The kids are good kids. Good grades, no trouble at school, and my oldest is even taking college courses in high school. We don’t have chores and don’t pay for them. We call them contributions because everyone contributes to the household since they live here. We’ve done this since they were young.\n\nI handle making appointments, getting everyone to them, keeping track of schedules, who needs money and when, making the grocery list, shopping (husband goes with me), meal planning, cooking four nights a week with three fend-for-yourself nights, and making sure they have rides to activities. I don’t complain much because this is my part. Everyone does their own laundry and makes their own food three nights a wee...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 31,
            "ESH": 1,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-31T05:32:28.185250"
    },
    {
        "id": "1qradwe",
        "title": "AITA for insisting on sharing a bed with my boyfriend?",
        "url": "/r/AmItheAsshole/comments/1qradwe/aita_for_insisting_on_sharing_a_bed_with_my/",
        "body_summary": "Some time ago, I went on a quick weekend trip to NYC with my partner and 2 of our closest friends. The four of us have all been friends for about 5 years. The cast is as follows:\n\nMyself, 27M\n\nKyle, my boyfriend, 28M\n\nLiz, 26F\n\nJosh, 27M\n\nLiz's boyfriend Aaron, 27M (not present on the trip, and not really part of our shared circle of close friends)\n\n\n\nAt the time of the trip, Josh was single, and Liz was dating Aaron, who was unable to attend the trip. Liz was also struggling financially, while for the rest of us this trip wasn't particularly expensive. Kyle and I did not live together, and in fact lived just far enough apart that we were only seeing eachother maybe once a month.\n\n  \nDuring planning, we took a few measures to make the expense easier on Liz. The rest of us were proactive on...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 34,
            "ESH": 5,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-31T05:32:36.171247"
    },
    {
        "id": "1qrdxt4",
        "title": "AITA for threatening to press charges on my roommate?",
        "url": "/r/AmItheAsshole/comments/1qrdxt4/aita_for_threatening_to_press_charges_on_my/",
        "body_summary": "I (27 m) let my ex girlfriends little brother (20 m) move in because I found out he was homeless. He has been staying here for the past year for free. He has constantly told me he had a job lined up and he never winds up working or actually starting the job. And he just lives here rent free. He eats the food thats in the apartment and has full access to the wifi in the house and he destroyed a blow up mattress I let him use. And he now sleeps on the couches. Last week I went on a trip out of state and while I was gone I get a text from his sister saying \"my brothers been staying here and when I saw that your other ex girlfriends profile was on the xbox I almost died laughing\" I proceeded to ask her what she meant and she tells me that he brought the Xbox to their house and has been using i...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 21,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-31T05:32:43.567989"
    },
    {
        "id": "1qr8y7a",
        "title": "AITA for not begging my mother to talk to me?",
        "url": "/r/AmItheAsshole/comments/1qr8y7a/aita_for_not_begging_my_mother_to_talk_to_me/",
        "body_summary": "Hi there! So, last June I moved out of my moms house and into my bio-dads house. I hadnt known him for long but I was not being treated right at my moms (not important information though)\n\n  \nI had been speaking to her over the months and kept a decent relationship with her. However, early December she decided that my cat (that was still at her house and she was not bothered by that) needed to be put down because he had a tumor on his back leg and couldn't walk well. This wasn't an issue, but she didn't tell me until AFTER they had put him down and told me AT SCHOOL. \n\n  \nAbout 2 weeks later my grandmas dog (who I grew up with as well) needed to be euthanized because his health declined very fast. I was on the phone with her and she referred to my stepdad as 'Dad'. My father is a very prot...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 34,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-31T05:32:51.054021"
    },
    {
        "id": "1qrn9m1",
        "title": "AITA for beating my eight year old niece in connect four 7 times.",
        "url": "/r/AmItheAsshole/comments/1qrn9m1/aita_for_beating_my_eight_year_old_niece_in/",
        "body_summary": "I beat her seven times in a row. Then she started to get depressed and called herself a loser and then she started cheating so I stopped playing. Should I have let her win to make her more confident? Or is it better to teach her to be resilient. She's eight by the way and I'm thirty five.",
        "reddit_judgments": {
            "YTA": 58,
            "NTA": 38,
            "ESH": 0,
            "NAH": 3,
            "INFO": 3,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-31T05:32:52.194969"
    },
    {
        "id": "1qrpb7d",
        "title": "AITA for leaving a baby shower my sister planned",
        "url": "/r/AmItheAsshole/comments/1qrpb7d/aita_for_leaving_a_baby_shower_my_sister_planned/",
        "body_summary": "So me (50) went to my cousins baby shower that my sister (36) planned. The baby shower started at 2. I pulled up at the baby shower and saw my Aunt Janice. As I was getting the huggies out of the car my younger cousin (13m) came out to help because I had about 10 packs of huggies.  We (me, aunt and cousin) all walked up the stairs to the event. We reached the top of the stairs, im looking to see where to put all the huggies and yes, im asking where to put them. As im asking, my sister asked  little cousin, didn't I tell you not to let anyone up the stairs. I ignore her because whatever, im still trying to find a place to put the huggies. She said the exact same thing to little cousin again. As he is over there talking to her, I was directed to put down the huggies.  She then asked cousin a...",
        "reddit_judgments": {
            "YTA": 20,
            "NTA": 21,
            "ESH": 4,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-31T05:33:00.080329"
    },
    {
        "id": "1qr2gwc",
        "title": "AITA for kicking my brother out of my home?",
        "url": "/r/AmItheAsshole/comments/1qr2gwc/aita_for_kicking_my_brother_out_of_my_home/",
        "body_summary": "AITA?  My brother (41) and I (f, 47) have never been close.  We can get along for short periods of time, but after a week, game over.  We were raised very different.  I had 3 jobs my senior yr in HS, paid for my own college, etc.  He on the other hand has always been coddled and saved despite losing job after job and spending his time gaming, dropping out of HS.  For the last 25yrs, we have lived many states apart.  I went off, got married, divorced and now have a fantastic 14yr old daughter who lives with me full time.  He has been taken care of by my dad for most of that. \n\n About a year ago, he decided to change his life, get out of the gaming world and become part of society (not speaking bad about gamers, but he won't leave his room for a week or more).  He got a job in my town that o...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 21,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-31T05:33:07.496441"
    },
    {
        "id": "1qrd0do",
        "title": "AITA for not covering my coworker’s shift even though she had a family emergency?",
        "url": "/r/AmItheAsshole/comments/1qrd0do/aita_for_not_covering_my_coworkers_shift_even/",
        "body_summary": "I work part-time at a small restaurant. I usually work weekends, and my manager is pretty strict about scheduling because we’re understaffed lol.\n\nlast saturday, about an hour or so before my shift, my coworker texted me asking if I could cover her shift that night. She said her mom had to go to the ER and she needed to be with her. (I understand that thats very serious and i do feel bad and hope shes better)\n\nMy problem is that I had already told my family I’d be going to my cousin’s birthday dinner that night. It wasn’t anything huge but it was planned for weeks and I was the only one who was supposed to drive my younger siblings there. If I didn’t go, the thing would’ve fallen apart.\n\nI explained this to Anna and apologized, saying I couldn’t cover. She didn’t respond until later, she s...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 48,
            "ESH": 0,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-31T05:33:15.124926"
    }
]