[
    {
        "id": "1p7i24k",
        "title": "AITA for blocking a car in that was parked in my tandem parking spot and pressing charges when the person keyed my car.",
        "url": "/r/AmItheAsshole/comments/1p7i24k/aita_for_blocking_a_car_in_that_was_parked_in_my/",
        "body_summary": "I have a tandem parking spot for more apartment. The other day, I came home to find someone in the inner spot of the tandem. when I tried to call a tow for the car, the tow company said they need authorisation from the complex manager, but it was a Sunday, so he wasn’t in office. so I parked in the other spot, blocking the other car in. \n\n  \nWhen I went to head  to work the next day I found my car heavily keyed. Despite the complex manager advising against it, and not wanting to tow the car, I called the cops to report the vandalism and they made the property manager tow the car that was in my spot. \n\n  \nToday, i met with the  complex manager, one of my neighbors (who I had never met), and her friend whose car I had towed. I was berated for towing the car and then pressing charges for the ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 121,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 126
        },
        "total_judged": 126,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-27T05:12:45.076371"
    },
    {
        "id": "1p7brm2",
        "title": "Update: AITA for telling my wife she was being difficult due to a seating issue at the restaurant",
        "url": "/r/AmItheAsshole/comments/1p7brm2/update_aita_for_telling_my_wife_she_was_being/",
        "body_summary": "Last post: https://www.reddit.com/r/AmItheAsshole/s/V00xxT0Ezt\n\nHi, I had received an AH judgement on my post which made me reevaluate how I behaved then. On Sunday we were going to go out again. I took care of the reservation at a nice restaurant and stressed that we really need a window table. When we got there, we had to wait a few minutes but we got a window table. My wife joked that we got a good seat without any difficulties. I'm not 100% about this, but it seemed that comment of mine was still on her mind. So I took that opportunity to apologize again for my remark. She said it was all good, she knew and liked that I was easygoing but she just liked looking outside as well while eating, it was weirdly important to her. We had a great night.\n\nThanks to all those who commented on my l...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 0,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 3
        },
        "total_judged": 3,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2025-11-27T05:13:01.564577"
    },
    {
        "id": "1p7itlm",
        "title": "AITA for not Inviting My Brother In Law to Our House for Thanksgiving after he got back together with his Ex and Unleashed a Tsunami of Family Dysfunction?",
        "url": "/r/AmItheAsshole/comments/1p7itlm/aita_for_not_inviting_my_brother_in_law_to_our/",
        "body_summary": "I’m honestly worn out and trying to figure out if I handled this wrong.\n\nMy husband (32M) and I (33F) were planning a quiet Thanksgiving this year. It was supposed to just be us and our two young children at home. Nothing big, nothing dramatic.\n\nMy husband is the middle child of three children.  A couple weeks ago, his sister( “SIL”) 29, mentioned she didn’t have anywhere to go for Thanksgiving, so I invited her. No intention behind it, just trying to make sure she wasn’t alone.\n\nThen earlier today, we invited my father-in-law (“Dad”) because we found out his wife would be out of town. Again, it wasn’t planned. It was just one of those “hey, you’re welcome to join us if you want” things.\n\nHere’s where it gets messy.\n\nMy brother-in-law (“BIL”) 34, recently got back together with his ex (“GF...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 77,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 79
        },
        "total_judged": 79,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-27T05:13:17.640025"
    },
    {
        "id": "1p7adt0",
        "title": "AITA for telling my mom she’s replacing my little brother?",
        "url": "/r/AmItheAsshole/comments/1p7adt0/aita_for_telling_my_mom_shes_replacing_my_little/",
        "body_summary": "I (16f) and my sister (14f) are full siblings. Our younger brother (8m) is our half-brother.\n\nBackground: When my brother was born, I was only 8, but I still ended up doing a lot of caretaking and it was this way until we no longer lived together. So for about 5 years.\n\nWhen I was 10–11, my mom and stepdad got fully into drugs. My biological dad wasn’t around. She sobered up for about a year, relapsed, and we all ended up living at my grandfather’s house. During that time she treated all of us terribly, including my grandfather. She was also involved with both my stepdad and another guy at the same time\n\nWhen I was 13, me and my sister went to live with a foster relative. My little brother went into foster care. My mom didn’t fully get sober until I was 15. By that point, my brother had be...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 14,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 17
        },
        "total_judged": 17,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-27T05:13:33.313257"
    },
    {
        "id": "1p7if8b",
        "title": "AITA for asking my mom on vacation for the ebt card because we ran out of food",
        "url": "/r/AmItheAsshole/comments/1p7if8b/aita_for_asking_my_mom_on_vacation_for_the_ebt/",
        "body_summary": "I (17m) have currently been living alone for the past month while my mom (40f) took a trip to our homeland where she’s staying with my aunt. I just ran out of food in the fridge. Eggs, bread, milk, cheese, fruits, other things. I tell my mom who took the ebt card with her so I couldn’t use it because she is for some reason very protective of it, that we ran out of food. She tells me to buy it with my own cash. Now I can buy a haul of groceries but my bank account would take a hit. I have a job but work little hours and make 500-700 a month. My mom also lied and said the ebt card has no money but she doesn’t know I have access to seeing the balance which is 500 dollars right now. My argument is that it would be unwise to spend the little money I have on groceries my mom is supposed to be le...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 64,
            "ESH": 0,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 71
        },
        "total_judged": 71,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-27T05:13:49.473881"
    },
    {
        "id": "1p7o059",
        "title": "AITA for not letting my best friend’s fiancé move in with us?",
        "url": "/r/AmItheAsshole/comments/1p7o059/aita_for_not_letting_my_best_friends_fiancé_move/",
        "body_summary": "\nMy fiancé (26F) and I (27F) own our home in Philadelphia and we live there with our two cats. My best friend (28F) is in a long-distance relationship with her fiancé (31M), who lives near Albany, NY. When they first started dating six years ago, he lived in a apartment with a roommate, worked 12-hour warehouse shifts, and didn’t have a car. After two years the job became too strenuous, he quit, and moved in with his aunt rent-free. For the next four years he didn’t work and spent most of his time with his friends, smoking weed and gaming 3–4 times a week. His excuse for not finding another job was that his aunt’s car broke down (which he used to get to his warehouse job ) and the city was an hour away.\n\nTwo years ago my best friend got a job opportunity in Connecticut, got to move closer ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 55,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 60
        },
        "total_judged": 60,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-27T05:14:05.475902"
    },
    {
        "id": "1p7dd2h",
        "title": "WIBTA For Not Contributing to My Sister's Rent?",
        "url": "/r/AmItheAsshole/comments/1p7dd2h/wibta_for_not_contributing_to_my_sisters_rent/",
        "body_summary": "A few years ago I moved to Boston for grad school. Since my sister lives there too and my university gave me a studio apartment that I can pay with student loans, she secretly stayed in this apartment with me for free until the end of my grad program. Independent of that, she also owes me \\~$15k over the span of several years because she didn't make enough money to cover her rent while in medical school. I feel like this context is important to understand why I think I'm not in the wrong.\n\nOnce I graduated we needed to get a new apartment, and my sister purposely went for a 2 bedroom fancy high-rise that was near the hospital she works at that I could TECHNICALLY afford with my meager salary, but not by much. Still, we signed the lease in May 2024 and lived there for a year, splitting the ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 43,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-27T05:14:21.124411"
    },
    {
        "id": "1p7rsg2",
        "title": "AITA for not allowing my mom to bring her boyfriend to thanksgiving?",
        "url": "/r/AmItheAsshole/comments/1p7rsg2/aita_for_not_allowing_my_mom_to_bring_her/",
        "body_summary": "My wife and I are hosting our first Thanksgiving in our new house, and we are having some conflict surrounding my mom's boyfriend \"Rick\" and if he should attend or not. My mom has been with Rick for a few years and he has always been polite to us though a bit standoffish and clingy with my mom.\n\nI thought everything was good until over the summer, right after out wedding, my mom called my wife while she was in the car with Rick. She was using CarPlay and seemed to think she hung up when she didn't. My wife overheard Rick as my mom if I made a lot of money. IDK if it is relevant but Rick and my mom are both loaded. My mom asked why and he said he thought my career usually paid well, and then he was like \"I'm a dick for saying this, but his wife is not pretty. I'd think he could afford bette...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 76,
            "ESH": 1,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 80
        },
        "total_judged": 80,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-27T05:14:37.252992"
    },
    {
        "id": "1p7f011",
        "title": "AITA for not wanting to move back to India?",
        "url": "/r/AmItheAsshole/comments/1p7f011/aita_for_not_wanting_to_move_back_to_india/",
        "body_summary": "I was born in the United States to immigrant parents who’ve both moved from India. They’ve both lived here for around 20 years but recently my mom has been wanting to go back. She feels like she hasn’t been able to fit in and misses her old lifestyle and friends. She’s stopped working and is know almost in a depressive state and always crying whenever there is something going on in India like a wedding without her. However, I can’t see myself moving to India. I’ve only been two times and in both times I got really sick and almost hospitalized. I also only speak Hindi and can not write or read it whatsoever. I feel like I’ve worked so hard in school and it’s almost unfair to uproot me and take me across the world. I’m top of my class in a very competitive school, president of our biggest cl...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 52,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-27T05:14:52.953884"
    },
    {
        "id": "1p7ly8i",
        "title": "AITA for informing my wife that she should inform about the guests before the fait accompli",
        "url": "/r/AmItheAsshole/comments/1p7ly8i/aita_for_informing_my_wife_that_she_should_inform/",
        "body_summary": "Hello! \n\nEverytime my wife is inviting guests to our house she informs me after the fait accompli. Everytime it is like \"this weekend my friend or parents will visit\". She never tells me she has such plans first so I don't even have opportunity to react. It's not like I am against guests but I would like to participate in planning as I could have different plans. \n\nToday after I heard that parents will be coming on Sunday I broke. I told her that I would like to know before plans are made. She got angry and told me that she don't need my permission to invite someone. And I agreed but I told her that it is not about permission but we are living togather so she needs to take into consideration my opinion. It only made things worse and made me wondering if maybe I am wrong. So AITA?",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 45,
            "ESH": 0,
            "NAH": 0,
            "INFO": 6,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-27T05:14:53.698409"
    }
]