[
    {
        "id": "1oyi1ad",
        "title": "AITA for not paying house utilities until I get the receipts",
        "url": "/r/AmItheAsshole/comments/1oyi1ad/aita_for_not_paying_house_utilities_until_i_get/",
        "body_summary": "I'm 21 and still new to living life outside of college. Last month I asked my housemate if he could send me the utility bills statements before I pay him over Venmo. I got the idea from my grandma who said I should have receipts for everything I buy, so I wanted to give that a try.\n\nSo I get the Venmo for the bill and there is no statement, and I think \"maybe he just forgot\". This seems like a reasonable excuse since I did ask him over a month ago. So I DM  him \"Please send receipts for the bills so I can pay you 👍\" and I get no response. I think that's weird so the next day I message him the same thing, and I get no response. Yesterday I tried calling him on Messenger, Discord, and over the phone and got no response.\n\nAm I the asshole for refusing to pay bills when I don't see the bill st...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 101,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 105
        },
        "total_judged": 105,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-17T05:12:50.169812"
    },
    {
        "id": "1oyeclw",
        "title": "AITA for telling my dad that I don’t care about making him proud?",
        "url": "/r/AmItheAsshole/comments/1oyeclw/aita_for_telling_my_dad_that_i_dont_care_about/",
        "body_summary": "I(17) am an affair baby. Dad and I only see each other one day a month. He said it was difficult enough to get his wife to agree to that and that he didn’t want to push it. He told me when I’m married I’ll understand compromise.\n\nOne of the two worst things that happened to our relationship was when his wife said I seem quite well read ‘for a waitress’ son.’ Have my grandpa to thank for buying me books, I suppose. My dad didn’t say anything. I could understand her disdain given that Dad did cheat on her with my mom but his silence stung. The other was when I came out and he said maybe I was ‘just confused’ and should try dating his friend’s daughter. He did give up on the idea but things just haven’t been the same. I just don’t know what to say or how to act around him.\n\nHe said he wants m...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 84,
            "ESH": 0,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 88
        },
        "total_judged": 88,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-17T05:13:06.791230"
    },
    {
        "id": "1oytfwz",
        "title": "AITA for telling my SIL to walk her daughter to school?",
        "url": "/r/AmItheAsshole/comments/1oytfwz/aita_for_telling_my_sil_to_walk_her_daughter_to/",
        "body_summary": "I (f23) am a university graduate and live at home with my mother. She owns the house with a mortgage that's been fully paid off. I pay her rent (around half of the market rate for our area) and do most of the housework. Me and my mother both work a lot, I work in healthcare and work irregular shift patterns and my mum is self-employed and occasionally has to travel for work.  \n  \nMy brother (m31), his wife \"Rose\" (f31) and their daughter (f6) moved back into our mum's house on Friday. They got a mortgage on a home but it turned out to have a lot of maintenance issues, the biggest ones being with their toilet and shower not functioning. Also their heating doesn't work. It's estimated to take at least a month to fix everything so in the meantime they're staying here.  \n  \nRose came to me and...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 152,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 152
        },
        "total_judged": 152,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-17T05:13:26.324734"
    },
    {
        "id": "1oyewcd",
        "title": "AITAH? My mum asked me to send a picture of my 16 y/os birth certificate so she could open him a bank account, I said no.",
        "url": "/r/AmItheAsshole/comments/1oyewcd/aitah_my_mum_asked_me_to_send_a_picture_of_my_16/",
        "body_summary": "She can not be trusted. She said she wants to open him a bank account to put money in for him.\nHe already has a savings account I opened for him when he was a baby that he can’t touch until he’s 18. \nWhat banks in England let you open an account with a picture of a birth certificate?!\nI said no and to give me the cash so I can pay it into my account and transfer to his account (has to be a papertrail and no cash can be paid in directly and I wouldn’t want her having the account details anyway)\n\nNow my mother and siblings are bad mouthing me that I won’t let them open a bank account for him to use. I’m pretty sure they only want his birth certificate for the registration number to try and commit fraud because why else would they want just a picture of it and not the actual thing.",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 62,
            "ESH": 1,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-17T05:13:27.666064"
    },
    {
        "id": "1oyh0jt",
        "title": "AITA for refusing to take home leftover food from a trivia night",
        "url": "/r/AmItheAsshole/comments/1oyh0jt/aita_for_refusing_to_take_home_leftover_food_from/",
        "body_summary": "My (M23) girlfriend (F22) and our parents went to a trivia night together last night. Her parents brought a lot of food, which was very welcome and appreciated by everyone at the table. There were other drinks and some snacks that were available to all guests, but her parents brought enough to have a whole meal, of which I ate more than my fair share. It was overall a good night, and our parents get along very well together when we all go out. \n\nSkip to the end of the night, and her parents are deliberating on how much food they have leftover and what to do with it. Her mom offers me a leftover charcuterie platter, which I accept gladly. However, she continues to offer me other food items that we either do not want or that my girlfriend and I do not have the fridge space for. I first try t...",
        "reddit_judgments": {
            "YTA": 81,
            "NTA": 42,
            "ESH": 13,
            "NAH": 3,
            "INFO": 4,
            "TotalJudged": 143
        },
        "total_judged": 143,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-17T05:13:47.677755"
    },
    {
        "id": "1oylwni",
        "title": "AITA for letting my teenage son attend 'Dads night' for his youngest sibling?",
        "url": "/r/AmItheAsshole/comments/1oylwni/aita_for_letting_my_teenage_son_attend_dads_night/",
        "body_summary": "My 8yo Sams school regularly has 'special person days' for grandparents, father figures and mother figures.\nIt's extremely inclusive, stepdads /grandfathers/uncles attend as well. For example one of my son's friends is raised by his aunty and uncle, who attend the mother/father figure days. An older friend of mine attends the grandparent days with my kids, because my parents are 6 hours away.\n\nA few weeks ago they had a 'escape room' themed night for father figures. It's sponsored by local mens organisations, and very popular in our community.\n\nMy older son attended with Sam, when Sam asked him too because Sam wanted to do the escape room.\n\nHe was not the only older sibling there.\n\nThe school posted photos to the Facebook page, and my ex husband saw. He is claiming alienation and that I'm ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 46,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 51
        },
        "total_judged": 51,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-17T05:14:03.566996"
    },
    {
        "id": "1oyv8ou",
        "title": "AITA for telling people who live near me they can’t use my side gate as a cut through?",
        "url": "/r/AmItheAsshole/comments/1oyv8ou/aita_for_telling_people_who_live_near_me_they/",
        "body_summary": "Here’s a summary:\n\nI’ve been renting this place for 6 months\n\nIt’s a back to back house\n\nI’m facing the main road \n\nThe back of the house is on a  cul de sac street\n\nNo driveway at the front and can’t park on the main road, so my designated spot is on the driveway round back\n\nSame situation for my detached neighbour, so we share a side gate which we use to get to our vehicles\n\nMany of the residents who live on the cul de sac use the side gate as a cut through when walking to the shops, as it saves them about 1 minute walking this way as opposed to walking the main pathway up the cul de sac and around\n\nWhen they cut through they walk through my front garden, and sometimes stare in at me while I’m sat in my living room\n\nI’ve never spoken to these residents so they’re basically strangers\n\nWhe...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 26,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 29
        },
        "total_judged": 29,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-17T05:14:19.342339"
    },
    {
        "id": "1oytvyt",
        "title": "AITA for not saying that I love kids?",
        "url": "/r/AmItheAsshole/comments/1oytvyt/aita_for_not_saying_that_i_love_kids/",
        "body_summary": "UPDATE: I'm convinced I'm actually NTA after reading all these comments. Thanks y'all this was extremely helpful.\n\n~~~~~\n\nYesterday, we were at a local brewery having a beer after just having been at a different competing brewery in town. I'm a regular at the 2nd place and the 1st place just opened so me and a friend were checking it out. I was chatting with the lady pouring the beer and asking questions like \"have you checked out the new place?\" and \"can we look forward to a Collab beer between you two?\". All friendly stuff, I've been a long time faithful customer and feel comfortable talking with them and giving them feedback. Anyways, I then mentioned that I think I know what would give them a competitive edge, if they kept 21+ only spaces.\n\nSome background: I've been going to that brew...",
        "reddit_judgments": {
            "YTA": 83,
            "NTA": 32,
            "ESH": 1,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 120
        },
        "total_judged": 120,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-17T05:14:36.380385"
    },
    {
        "id": "1oyzxc4",
        "title": "AITA for telling my husband that I like the way he looks now",
        "url": "/r/AmItheAsshole/comments/1oyzxc4/aita_for_telling_my_husband_that_i_like_the_way/",
        "body_summary": "So I (30f) have always been into staying fit and working out, it’s just my hobby. And my husband (31m) was super into that when we got married and when we dated. He was super built which I loved but ever since kids and desk job he has put on a big beer belly.( used to weigh 180 now 250) but here’s the thing, I don’t hate it, I love it. It’s comfy and warm and i like having a lil more to grab on to. Hes still handsome still has really big arms he just has a belly and butt, which I’m into. But basically last night he said he felt bad that he’s heavy and I’m skinny(120 average) basically long story short I told him I’m “into bigger bellies”. Now I realize that sounds mean but I didn’t mean it like that. I was tired. But he got mad and is still hurt so how should I apologize. And AITA\n\nUpdate:...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 8,
            "ESH": 0,
            "NAH": 7,
            "INFO": 0,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-17T05:14:52.046174"
    },
    {
        "id": "1oyv127",
        "title": "AITA for letting my nanny have a YouTube channel that’s mostly about my kids?",
        "url": "/r/AmItheAsshole/comments/1oyv127/aita_for_letting_my_nanny_have_a_youtube_channel/",
        "body_summary": "My husband and I have 3 kids (2f, 5f, 8m). My husband and I both work 50-60 hours a week, my 2 year old and 5 year old get out of school/daycare at 12 and my 8 year old gets out at 1:30. We don’t usually get home until anywhere between 6:30 and 9 so we have a nanny to fill in the gaps. \n\n  \nLast year our nanny started a YouTube channel. It started as her recording herself making lunches while talking about life, stories from when she was a teacher, managing her chronic illness, and cracking jokes. Then she started posting videos of her packing bags for my kids swimming class, gymnastics, ballet, tee ball, etc. while also talking to the camera about whatever she had on her mind. Then I asked her for help with my daughter’s hair since my daughters have curly hair that seems to have appeared ...",
        "reddit_judgments": {
            "YTA": 42,
            "NTA": 46,
            "ESH": 0,
            "NAH": 3,
            "INFO": 4,
            "TotalJudged": 95
        },
        "total_judged": 95,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-17T05:15:08.145889"
    }
]