[
    {
        "id": "1osg40m",
        "title": "AITA for locking my roommates cat out of my room at night?",
        "url": "/r/AmItheAsshole/comments/1osg40m/aita_for_locking_my_roommates_cat_out_of_my_room/",
        "body_summary": "I am 20 and share a place in Melbourne with two roommates. One of them has a cat named Noodle. He is very sweet during the day. At night he becomes a menace.\n\nNoodle has decided that my room is actually his room. He knows how to push the door open. At three in the morning he sprints inside and jumps on my chest. He knocks my water over. He yells for food even though he has already eaten. I wake up terrified every time.\n\nI am in uni and I also work mornings. I need sleep. I asked my roommate to keep him out of my room at night. She laughed and said that I should feel honoured that he picked me. I do not feel honoured at all.\n\nSo I started locking my door before I sleep.\n\nNow Noodle sits outside my door and screams like he is being tortured. My roommate got angry and said I was being cruel t...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 121,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 121
        },
        "total_judged": 121,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-10T05:13:10.478207"
    },
    {
        "id": "1osthm7",
        "title": "AITA for wanting to keep girls night girls only, even now that some friends are in relationships with men?",
        "url": "/r/AmItheAsshole/comments/1osthm7/aita_for_wanting_to_keep_girls_night_girls_only/",
        "body_summary": "I’m part of a tight friend group of women I’ve known for years. We’ve always had \"girls nights,\" just us hanging out, no partners. Over time, my partner (also a woman) became close with everyone, so she’s usually included too.\n\nA while back, one friend asked if her boyfriend could come to one of these nights. Another friend said she preferred to keep it girls only, and that led to some tension because her boyfriend felt excluded and it caused drama between them.\n\nMy partner and I planned another girls night and invited a lesbian couple we’ve become friends with. The friend is upset about this, saying it’s hypocritical to include them but not her boyfriend.\n\nFrom my perspective, it’s about having a women-centered space, not a couples event or anything romantic. It’s just the vibe we’ve alwa...",
        "reddit_judgments": {
            "YTA": 75,
            "NTA": 53,
            "ESH": 4,
            "NAH": 10,
            "INFO": 6,
            "TotalJudged": 148
        },
        "total_judged": 148,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-10T05:13:29.607440"
    },
    {
        "id": "1osthr5",
        "title": "AITA for being angry that my MOH dropped out of duties and won't attend my wedding due to a sidegig?",
        "url": "/r/AmItheAsshole/comments/1osthr5/aita_for_being_angry_that_my_moh_dropped_out_of/",
        "body_summary": "I (32F) am getting married next June. I sent Save-The-Date cards in early February, and invites went out three weeks ago. We have a location, have a venue, and we are figuring about 200 people will be there (my fiance has a large family).\n\nI asked my best friend Cara (33f) to be my Maid of Honor. We've been best friends for about 11 years now, and I was the MOH at her wedding. I did all the duties and such (this was 5 years ago). Cara said yes, and was really excited and was all in. We spent a few months planning everything and it all seemed normal.\n\nA bit of background on Cara.  She has a sidegig job of wedding photographer. It isn't her main job, and she does it as a bit of extra money to fund her travel lifestyle. She usually blocks the dates of important events where she is busy or is ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 131,
            "ESH": 1,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 138
        },
        "total_judged": 138,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-10T05:13:46.901931"
    },
    {
        "id": "1osm4sn",
        "title": "AITA For pointing out my Husband bought the wrong medicine.",
        "url": "/r/AmItheAsshole/comments/1osm4sn/aita_for_pointing_out_my_husband_bought_the_wrong/",
        "body_summary": "I'm pretty sick right now, I believe it's strep. This morning my husband had to go to the store and offered to pick up some medicine. When he gets home there a bottle of liquid cough syrup on the counter. (For context I'm sick somewhat often and I never take liquid medicine, it absolutely grosses me out and makes me throw up. I've told him this before and we already have bottles of liquid in our medicine cabinet, he'll drink it but I won't.) He comes in the kitchen and I can barely talk and I just point at the bottle and was like uuuuuhhhhhh and he said what's wrong. I told him I don't drink the liquid stuff and I've told him this before. I asked if he remembered that and he said no. I was just disappointed and went to sit on the couch. He kinda blew up at me and raised his voice and accus...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 52,
            "ESH": 5,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 69
        },
        "total_judged": 69,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-10T05:14:03.908012"
    },
    {
        "id": "1osevkx",
        "title": "AITA for telling this joke?",
        "url": "/r/AmItheAsshole/comments/1osevkx/aita_for_telling_this_joke/",
        "body_summary": "I (19M) am a university student. I was chatting with a group of friends, and one of my closest friends mentioned that next year they would be studying abroad. I said: \"Study abroad? I think the polite thing to say is 'study a dame.'\" This got a pretty good laugh from everyone, and the conversation continued normally.\n\nLater, my roommate (20M) confronted me, saying that he didn't like how the joke used the word \"broad\" in an outdated sense, and that it could be construed as offensive to women. I argued that since the word was outdated, it was clear that it was a joke; and that the joke's punchline was that I misheard a word, not that I was being demeaning to women.\n\nEither way, I'd like to think that I'm respectful to women. I need to know whether it's a good idea to tell this joke in the f...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 98,
            "ESH": 0,
            "NAH": 6,
            "INFO": 0,
            "TotalJudged": 112
        },
        "total_judged": 112,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-10T05:14:20.209267"
    },
    {
        "id": "1oslojj",
        "title": "AITA for ordering nothing at a family restaurant dinner?",
        "url": "/r/AmItheAsshole/comments/1oslojj/aita_for_ordering_nothing_at_a_family_restaurant/",
        "body_summary": " Last evening me and my family went out for dinner at a restaurant. While at the restaurant everybody was having a hard time deciding on what to order and every choice me and my brother were discussing with my mother were turned down by her, as in every food chosen by us would make my mother tweak out and she would try to convince us not to get that.\n\n In the time being my father was js searching the menu and chose his order. The waitress came and even tho i told her that we werent't early to order my father said \"yea we are\" and rushed everyone at the table. (context being that we ate at a restaurant that weve previously eaten at and the staff isnt really active, like they might come to us once every half an hour but another 5 minutes for us to decide wouldnt've been so bad). My brother e...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 23,
            "ESH": 21,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-10T05:14:36.299939"
    },
    {
        "id": "1osp8ma",
        "title": "AITA for calling my sister an attention whore because she’s making my grandmas death all about her",
        "url": "/r/AmItheAsshole/comments/1osp8ma/aita_for_calling_my_sister_an_attention_whore/",
        "body_summary": "My grandma died a little over a week ago. My sister (19) was supposed to stay the night with her in the hospital. We were all there until around 9:30 and she was fine. She was sitting up and talking. At 2:30 some cop was knocking on our door to tell us that she was dead and to take us to the hospital. She had a heart attack. \n\n  \nIn my culture, when someone dies you open their house so anybody can pay their respects. Like my mom and aunt seriously posted her address on social media with dates and times. \n\n  \nI just have to say that my sister is the “perfect“ one and that role is very important to her. She has a tiny body, great skin, piercing blue eyes, and springy blonde curls. She literally looks like a Disney princess. Nobody in our family even has blonde hair or blue eyes or curly hair...",
        "reddit_judgments": {
            "YTA": 140,
            "NTA": 1,
            "ESH": 3,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 147
        },
        "total_judged": 147,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-10T05:14:53.906841"
    },
    {
        "id": "1osycsn",
        "title": "Update: AITA for telling my husband I'll go on vacation with the kids and my best friend if he's too busy with work",
        "url": "/r/AmItheAsshole/comments/1osycsn/update_aita_for_telling_my_husband_ill_go_on/",
        "body_summary": "https://www.reddit.com/r/AmItheAsshole/s/4JqBCKzzgh\n\nHi, thanks a lot for the feedback on my first post. I had decided to suggest he do his tutoring classes online while we were in Spain as a compromise and thats what I was planning on doing.\n\nMy husband caught a cold on Thursday though and had been really down and out the last couple of days. He had taken these two days off work (from his day job). Despite my insistence that he rest, he tried to do his tutoring class as scheduled but literally couldn't get through it and canceled those as well. I didn't want to have the conversation while he was this sick so I postponed it. It was great (maybe not the best choice of words as a wife talking about my husband getting sick lol) to kind of just have him do nothing for these two days. He spent ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 1,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 1
        },
        "total_judged": 1,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2025-11-10T05:15:09.576198"
    },
    {
        "id": "1osy8ya",
        "title": "AITA for not letting my in-laws lock themselves in their room with my daughter?",
        "url": "/r/AmItheAsshole/comments/1osy8ya/aita_for_not_letting_my_inlaws_lock_themselves_in/",
        "body_summary": "I (19yo F) and my husband (19yo M) got married after I got pregnant. We were happy but faced financial struggles, leading us to live alternately with my parents and my in-laws. This sparked competition between the two grandmothers over who could spoil our baby more, causing stress for us. The grandmothers showed jealousy and entitlement, often taking the baby without permission and posting her pictures online. This situation contributed to me experiencing postpartum depression. \n\nFor two months, I felt overwhelmed until my father noticed my struggles and apologized for their behavior, prompting a change. We began setting boundaries with both families, though it was met with some resistance. Recently, when my mother-in-law tried to take the baby into another room, my husband stood firm agai...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 30,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-10T05:15:25.509269"
    },
    {
        "id": "1oslp1f",
        "title": "AITA for refusing to pick up food for my boyfriend when I was already out all day and he was home playing video games?",
        "url": "/r/AmItheAsshole/comments/1oslp1f/aita_for_refusing_to_pick_up_food_for_my/",
        "body_summary": "I (27F) and my boyfriend (29M) have been living together for 11 months. Today I went out around 11 a.m. to get my nails done, do some shopping for myself, and then get groceries. By the end, I was pretty tired from running around all day.\n\nWhile I was out, he texted me asking if I could stop by a restaurant to pick up food. I told him no because I was exhausted. Then he told me to grab something near the house, and I replied that he could do it since he was home doing nothing  literally just playing video games. He got upset and said it “didn’t make sense” because I was already out.\n\nWe live on the 4th floor with no elevator. When I got home, I had to carry all the groceries upstairs by myself. He saw me but didn’t help. I’m honestly just so tired. He even sees when the trash can is full, ...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 43,
            "ESH": 5,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-10T05:15:41.622997"
    }
]