[
    {
        "id": "1pe45fq",
        "title": "AITA for locking my bedroom door after my roommate kept going to my stuff even after I asked her not to do that?",
        "url": "/r/AmItheAsshole/comments/1pe45fq/aita_for_locking_my_bedroom_door_after_my/",
        "body_summary": "\nI F27 share an apt with my roomie, \"Jaska\" F25. When we moved in together, I made it very clear that I'm private about my personal things like journals, gadgets, especially my SKINCARE. She agreed and said she was the same. expect she isn't!!!\n\n\nLast few months, things started happening:\n\nMy makeup would be moved around\n\nMy chargers kept disappearing \n\nShe even borrowed the dress my mom gave before she passed and put it back in my closet with wrinkles and a man's perfume smell. 😡😡\n\nMy skincare was used way way way faster than I could ever used it.\n\nI confronted her kind and nicely and at first. She denied everything.. then I caught her literally in my room when she thought I was at work. she laughed at me and said \"Girl, chill, we're roomies... it's shared stuff\"\n\nI said no it is not!\n\naf...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 140,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 141
        },
        "total_judged": 141,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-05T05:12:44.845233"
    },
    {
        "id": "1pdtr4d",
        "title": "AITA for allowing my bf to cook at my apartment",
        "url": "/r/AmItheAsshole/comments/1pdtr4d/aita_for_allowing_my_bf_to_cook_at_my_apartment/",
        "body_summary": "My (22f) room mate (23f) is a hijabi. Because of this whenever my bf (23m) comes over I make sure to tell her and we stay in my room 99% of the time. She has a lot of hair so I assume tucking it into her hijab can be annoying and I understand her wanting to not have to have it on all the time.\n\nI have a cyst on one of my ovaries and it ended up being ruptured and my ovary twisted and there was other stuff because of that and it was just a lot and I was in a lot of pain, and my bf came over to help me out. I hadn’t ate in a while and had vomited anything I did eat back up and I didn’t feel like getting up and cooking at all, so I texted my room mate, and made sure she knew my bf would be in the kitchen, telling her that I was in a lot of pain and that my bf would be in the kitchen making me...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 125,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 127
        },
        "total_judged": 127,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-05T05:13:01.968904"
    },
    {
        "id": "1peal1j",
        "title": "AITA for asking a woman to be quiet in the silent area of the library and ruining her presentation?",
        "url": "/r/AmItheAsshole/comments/1peal1j/aita_for_asking_a_woman_to_be_quiet_in_the_silent/",
        "body_summary": "I really need a reality check here because I'm freaking out and feeling really guilty; I don't know if I'm just exhausted and grumpy or I actually was horrible for this. I'm a STEM college student and I get most of my work done (when in-between classes) in the library. I'm AuDHD, and get irritated at small noises far more than most people on a good day, but I have only gotten 5 hrs sleep and I'm feeling like shit today (unable to sleep from ptsd/anxiety, I'm responsible with time)\n\nI ALWAYS work in the silent area of my uni's library since I'm easily distracted/irritated by noise. This is a blocked off area with multiple \"No Talking,\" and \"Silent Area\" signs around, with private desks. There are other parts of the library with large areas for group work, and another area for independent wo...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 115,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 119
        },
        "total_judged": 119,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-05T05:13:18.402890"
    },
    {
        "id": "1pe0aou",
        "title": "AITA for getting annoyed that my coworker keeps correcting the way I pronounce simple words during meetings",
        "url": "/r/AmItheAsshole/comments/1pe0aou/aita_for_getting_annoyed_that_my_coworker_keeps/",
        "body_summary": "i (18f) have a coworker who, every time I speak in a meeting, jumps in to “fix” my pronunciation on random normal words. not major mistakes, just tiny things like where I put emphasis. she’ll literally interrupt mid-sentence to do it.\n\ntoday I finally said, “can you pls stop correcting me while I’m talking?” not rude, just tired of being cut off. she got super offended and said I embarrassed her in front of the team. now she’s telling ppl I “snapped at her for helping.” I honestly just wanted to finish a full sentence without grammar police popping up.",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 70,
            "ESH": 2,
            "NAH": 3,
            "INFO": 4,
            "TotalJudged": 80
        },
        "total_judged": 80,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-05T05:13:19.944351"
    },
    {
        "id": "1pdv54j",
        "title": "AITA Roommate Messaged me to \"Take it somewhere else\"",
        "url": "/r/AmItheAsshole/comments/1pdv54j/aita_roommate_messaged_me_to_take_it_somewhere/",
        "body_summary": "I live in a apt with this girl (who is a producer) and when I was interviewed for the room, I was asked if it would bother me to hear music at late hours (due to the rooms being right next to each other) to which I said I didn't because I myself play guitar and sometimes like to stay until late listening to music. She works during the week and wakes up early, meanwhile I work weekends and get two days off during the week. She makes music on the weekends, which I can hear even though both our doors are closed, but I personally don't make a big fuss (because I agreed to these terms) and just close my eyes until I pass out. I play guitar almost everyday during different times, but my favourite is to do it before I go to sleep, since it helps me wind down and sleep better, mind you I use a nyl...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 13,
            "ESH": 1,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 18
        },
        "total_judged": 18,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-05T05:13:35.626204"
    },
    {
        "id": "1pe61vx",
        "title": "AITA for dropping my mother off at the country club like she asked?",
        "url": "/r/AmItheAsshole/comments/1pe61vx/aita_for_dropping_my_mother_off_at_the_country/",
        "body_summary": "My parents are both chain smokers. They go through half a packet to a full one daily. My sister and I used to be fine with this, we were used to it and my parents only really smoke in the kitchen for our sake do that the whole house doesn’t smell like smoke.\n\nI think my body has gotten used to clean air again seeing as i’m at university for majority of the year because since coming back for recess i’ve had intense hay fever and i’ve been sick like a dog. It gets worse every time I enter the kitchen. \n\nI’ve asked them to stop long before this for their own health’s sake and i’ve given up but now that it’s affecting me I can’t take it anymore.\n\nSo this morning mother and I went on a trip to the town where my uni is at to go fetch the last of my stuff for the recess. If it was my choice, I wo...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 41,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-05T05:13:51.477635"
    },
    {
        "id": "1pe5muz",
        "title": "AITA for my reaction? - Co-worker said I smelled edible",
        "url": "/r/AmItheAsshole/comments/1pe5muz/aita_for_my_reaction_coworker_said_i_smelled/",
        "body_summary": "\\*\\*Long time judger/lurker. First time poster. :)\n\nToday at work, I (35F) was told by my coworker (40ishM) that I \"smelled edible\". As someone who has no poker face, my reaction immediately showed, and I may have slightly flinched/moved back a little before handing him the paperwork I'd come to give him for an order and walking back inside our office from our warehouse.\n\nAbout 30 minutes after the interaction, he came inside the office to my desk and said he was \"offended by my reaction because he didn't mean it in a suggestive/sexual way and not every man thinks like that.\" He also added that I needed to stop overthinking. I don't feel like I did anything wrong in this situation, but just to be sure...AITA for my reaction to this?\n\n\\*\\*Edit to add - I did have on a body spray though not ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 149,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 150
        },
        "total_judged": 150,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-05T05:14:09.030735"
    },
    {
        "id": "1pei9ek",
        "title": "AITA? Sister’s Boyfriend Peels the Skin Off the Thanksgiving Turkey",
        "url": "/r/AmItheAsshole/comments/1pei9ek/aita_sisters_boyfriend_peels_the_skin_off_the/",
        "body_summary": "AITA? So, long story short, my sister has been with her boyfriend since 2012 and they usually host holidays. I’ve offered, because I like to cook, but I get turned down. So the turkey is always terrible, it’s always just dried out white meat that is offered to us and it’s been this way for years. This past Thanksgiving I asked for a piece of dark meat and my sister got really flustered. You’d have thought I asked to be served her first born on a platter. She was like “my boyfriend likes the dark meat,” and then she tried to give me this shriveled gonad looking thing and I said “I just want a piece of dark meat that some skin on it,” and I went into the kitchen to get it myself. The boyfriend had literally PEELED the turkey and put all the skin aside for himself along with the dark meat. Th...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 47,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-05T05:14:25.434222"
    },
    {
        "id": "1pefvvx",
        "title": "AITA for not taking off work for my gf's birthday",
        "url": "/r/AmItheAsshole/comments/1pefvvx/aita_for_not_taking_off_work_for_my_gfs_birthday/",
        "body_summary": "I (31F) and my gf (29F) have been dating for about a year. Her birthday was last month and it landed on a Tuesday.Tuesdays are typically busy work days for me. My plan was to go to work, maybe sneak out around 4 if i could manage it, then meet up with her for birthday dinner at a restaurant she likes. \n\nWhen I asked her what she planned to do, she didn't really have much of a plan. Mostly it was \"hang out, do whatever i want, maybe do this, maybe do that\"; nothing concrete. \n\nSo I then asked if she knew where she wanted to go for dinner after work. She got upset because she had expected me to take the day off and spend it with her doing whatever.\n\nI told her that I didn't want to do that and felt uncomforable. I'd recently had some life events and health issues that effectively burned thro...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 123,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 126
        },
        "total_judged": 126,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-05T05:14:42.051314"
    },
    {
        "id": "1pdvyp9",
        "title": "AITA for not letting my cousin use my scholarship laptop for her project?",
        "url": "/r/AmItheAsshole/comments/1pdvyp9/aita_for_not_letting_my_cousin_use_my_scholarship/",
        "body_summary": "I have a laptop provided by my scholarship program. It’s strictly for academic use. My cousin, who studies at another school, asked to borrow it over the weekend because hers is broken. I told her I couldn’t lend it due to the scholarship rules.\n\nShe said rules are flexible and I should help because we’re family. I still said no. She messaged relatives saying I didn’t want to help her even when she needed it. I felt cornered but still stuck to the rules because I could face consequences.\n\nMy family said it was only for a short time, but the risk isn’t worth it.\n\nAITA for refusing?",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 50,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-05T05:14:42.854845"
    }
]