[
    {
        "id": "1p5ay1j",
        "title": "AITAH for keeping a \"Family\" cookbook that was previously thrown away",
        "url": "/r/AmItheAsshole/comments/1p5ay1j/aitah_for_keeping_a_family_cookbook_that_was/",
        "body_summary": "More than 10 years ago my SIL's MIL passed away. The family cleaned out her house, took what they wanted, then decided to toss the rest. Before it was tossed, my SIL said to see if there was anything I wanted. All I could find was an old cookbook, which was in plain sight on the kitchen table. Fast forward to this year when I posted a photo of my island with cookbooks all over it (I was looking for a certain recipe). My BIL saw the photo and his mother's cookbook, then demanded it's return. I refused. The whole family is in an uproar. Half are on my side, half on his. I've had to block quite a few from being able to contact me, as they were getting REALLY rude. AITAH for not returning it? If I hadn't taken it, it was going to be thrown away. ",
        "reddit_judgments": {
            "YTA": 89,
            "NTA": 32,
            "ESH": 2,
            "NAH": 4,
            "INFO": 8,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-25T05:12:10.873469"
    },
    {
        "id": "1p5l2f6",
        "title": "AITA for telling my girlfriend I won’t play with her until she learns to accept losing?",
        "url": "/r/AmItheAsshole/comments/1p5l2f6/aita_for_telling_my_girlfriend_i_wont_play_with/",
        "body_summary": "I'm an experienced chess player, playing this game for as long as I can remember, probably since I was 4 or 5 years old. My extended family loved chess, so I grew up in an environment where I could very easily learn and practice it. My current rating is 1950+.\n\nMy girlfriend is at a lower intermediate level. She learned chess from me during the lockdown, but then took a long break. She started playing regularly a couple of months ago. She mostly plays online against opponents at her level, but she plays with me almost daily on a physical board. The problem (for her) is, I always win.\n\nWhen she was a beginner, I used to give her wins and tips to help her build the concepts, but now I don’t do that. I believe she should play fairly now, and chess is a game that requires focus, time, and ment...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 64,
            "ESH": 42,
            "NAH": 3,
            "INFO": 8,
            "TotalJudged": 131
        },
        "total_judged": 131,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-25T05:12:29.869482"
    },
    {
        "id": "1p5heyh",
        "title": "AITA my(55M) daughter(27F) asked me to stop treating her boyfriend(31M) like he is \"one of my idiot clients who never know what they are doing\"",
        "url": "/r/AmItheAsshole/comments/1p5heyh/aita_my55m_daughter27f_asked_me_to_stop_treating/",
        "body_summary": "My daughter's boyfriend has always seem a very cautious, hard-working person. He owns his own house, his own car, no debts when it comes to any of this whatsover. He is very minimal and likes to save, not a spender at all. He has a stable good-earning job, not the greatest salary but a good, medium salary that certainly allows him to pay the bills and to save up his own money. \n\nI am an accountant, when I found out through conversation over lunch that he indebted himself for a business deal, I was sort of taken aback because I didn't take him for such a reckless behaviour. I do think he was a bit reckless especially if for some reasons things take a turn for the worst in the future when it comes to real estate business. He should have at least waited a few years, to save up so he wouldn't ...",
        "reddit_judgments": {
            "YTA": 142,
            "NTA": 12,
            "ESH": 0,
            "NAH": 1,
            "INFO": 6,
            "TotalJudged": 161
        },
        "total_judged": 161,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-25T05:12:49.200884"
    },
    {
        "id": "1p5p8z9",
        "title": "AITA for not accepting this birthday gift?",
        "url": "/r/AmItheAsshole/comments/1p5p8z9/aita_for_not_accepting_this_birthday_gift/",
        "body_summary": "i’m turning 21 soon and found out my mom applied for and got approved for a credit card in my name. my initial reaction was “oh! um.. okay?” i told her i recently applied to one and she was disappointed that i did that because she already did it for me. she basically said i ruined her “surprise.” \n\nthe next day, i told her to not do it again. she got really upset and blew up on me. immediately started yelling, calling me ungrateful, disrespectful and said how she’s not the “enemy.” she had said how all her friends and even her boyfriend said it was a good gift too. i tried to defend myself, saying how that’s not a good gift and she told me to shut up. it’s been a long week tbh. she never apologizes and i can’t talk about my feelings without her being either dismissive or full on victim bla...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 110,
            "ESH": 0,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-25T05:13:06.093385"
    },
    {
        "id": "1p58viq",
        "title": "AITA for picking my parents up late from the airport",
        "url": "/r/AmItheAsshole/comments/1p58viq/aita_for_picking_my_parents_up_late_from_the/",
        "body_summary": "Throwaway because people know I'm on here.\n\nMy parents asked me to fetch them at the airport as per usual. They are both semi-retired and travel monthly either for business or for pleasure, so this favor is not new to me.\n\nThey don't want me to waste money on parking at the airport, so what we have been doing for years is they message me for updates (\"we have boarded the plane\", \"we have landed\" etc) so that we estimate what time I have to leave. Since I am about 30mins away from the airport, I am usually asked to leave the house at the same time they arrive. This gives them time to leave the plane, get their baggage, etc.\n\nAt around 12:30nn, they informed me that their flight is \"on time\", and their arrival is 15:25. I was already ready to leave by 14:00, and was having a mid-afternoon sn...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 135,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 137
        },
        "total_judged": 137,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-25T05:13:23.751696"
    },
    {
        "id": "1p5juea",
        "title": "AITA for not insisting to keep holding my bags, even though my dad was the one asking for it?",
        "url": "/r/AmItheAsshole/comments/1p5juea/aita_for_not_insisting_to_keep_holding_my_bags/",
        "body_summary": "I (16M) just went out to the supermarket with my parents (49M and 46F) to buy some food for our upcoming vacation. When we got out of the car and walked back home, we all held some bags. While in the lift, my dad offered to take my bags and I let him, which made my mom upset. She said I should have insisted to keep holding it, which didn't make sense to me.\n\nWhen we reached home, we continued the argument. I tried explaining to her that he was the one who initiated it. He knows better than me, and out of respect for him, I trust his request, even if I don't know 100% why. She said she was disgusted by me saying it was because I \"respected\" him, and then raised an example of if it was my grandmother instead, and she offered to hold my bags (even when she was already holding some bags hersel...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 31,
            "ESH": 2,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-25T05:13:39.792241"
    },
    {
        "id": "1p5sakt",
        "title": "AITA for changing the wifi password after my sibling kicked me off Netflix?",
        "url": "/r/AmItheAsshole/comments/1p5sakt/aita_for_changing_the_wifi_password_after_my/",
        "body_summary": "My sibling (22) and I (18) both live at home. They pay for Netflix, I handle the WiFi setup and maintenance (parents pay the bill). We’ve always just shared everything without tracking it.\n\nA few days ago I tried to watch Netflix and found out they changed the password and locked me out without any warning. When I asked about it, they said I could be added back “if I start paying.”\n\nSo I got annoyed and changed the WiFi password and didn’t give it to them.\n\nNow they’re mad, my parents are mad, and I’m being told I’m childish and controlling the whole house’s internet just to be petty.\n\nI feel like I just matched their energy, they locked me out first.\n\nSo… AITA??",
        "reddit_judgments": {
            "YTA": 159,
            "NTA": 0,
            "ESH": 8,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 170
        },
        "total_judged": 170,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-25T05:13:42.448959"
    },
    {
        "id": "1p5ozj3",
        "title": "AITA for refusing to move in a restaurant ?",
        "url": "/r/AmItheAsshole/comments/1p5ozj3/aita_for_refusing_to_move_in_a_restaurant/",
        "body_summary": "Earlier today me and my girl friend has a few hours between classes so we went to Nando’s and when we got there it was completely empty apart from 1 other table and the guy at the host stand directed us to a big long table with 10 or 12 chairs at it and just told us to use that table. I found it a-bit odd but figured no one’s here and it’s a very quiet time of day (Monday around 12).\n\nSo my and my gf order food and it takes about 25 minutes to arrive , whilst we are waiting for our food the restaurant starts to get a lot busier. By this point maybe 70% of the tables are now in use. \n\nOur food arrives and then the waiter comes up to the table and asked if me and my gf would mind moving tables as they have just had a party of 10 walk in and non of the other tables are big enough. At this poi...",
        "reddit_judgments": {
            "YTA": 59,
            "NTA": 94,
            "ESH": 8,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 161
        },
        "total_judged": 161,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-25T05:14:01.389851"
    },
    {
        "id": "1p5ayo1",
        "title": "AITA for telling my sister I won’t keep rearranging my plans every time she “needs help” with her kids?",
        "url": "/r/AmItheAsshole/comments/1p5ayo1/aita_for_telling_my_sister_i_wont_keep/",
        "body_summary": "She’s a single mom and I’ve always tried to support her, but lately she’s been calling me last-minute to babysit or canceling on plans because she forgot she scheduled something. I told her I love her but I can’t keep dropping everything for her, and now she’s upset, saying I “don’t understand how hard it is.” I feel guilty, but I also feel like my life matters too. AITA?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 44,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 46
        },
        "total_judged": 46,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-25T05:14:02.095121"
    },
    {
        "id": "1p5natd",
        "title": "AITA for having Thanksgiving at my house",
        "url": "/r/AmItheAsshole/comments/1p5natd/aita_for_having_thanksgiving_at_my_house/",
        "body_summary": "My wife and I invited my side of the family (my parents, my sister and her husband, their 2 kids) to our house for Thanksgiving this year. We have a 4 year old and a 5 month old baby. My sister's kids are older. My sister has hosted in the past, but I mentioned it would be easier for us with the baby's nap schedule if it was at our house this year.\n\nWhen I first texted her to ask if they'd like to come to our house (we also just moved into our house this year), she asked if we'd let her make the stuffing if they came. It's my late grandmother's recipe that she makes every year. I said yes of course, but also let her know that we were thinking about getting a takeout turkey dinner from a local restaurant. We have gotten it in the past during COVID and it was really delicious, easy, and has ...",
        "reddit_judgments": {
            "YTA": 27,
            "NTA": 45,
            "ESH": 1,
            "NAH": 18,
            "INFO": 2,
            "TotalJudged": 93
        },
        "total_judged": 93,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-25T05:14:19.557447"
    }
]