[
    {
        "id": "1l04t5i",
        "title": "AITA for not stopping my teenage sons gf from kissing him?",
        "url": "/r/AmItheAsshole/comments/1l04t5i/aita_for_not_stopping_my_teenage_sons_gf_from/",
        "body_summary": "OP's son was in a car accident. Son's girlfriend showed affection, which wife found \"gross\" in front of family. OP defended the girlfriend, prioritizing son's comfort. Wife wants OP to tell the girlfriend to stop. AITA for not intervening?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 132,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 133
        },
        "total_judged": 133,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-01T05:12:02.441035"
    },
    {
        "id": "1kzzm2d",
        "title": "AITA for saying I don’t want to be my friend’s “fat bridesmaid aesthetic”?",
        "url": "/r/AmItheAsshole/comments/1kzzm2d/aita_for_saying_i_dont_want_to_be_my_friends_fat/",
        "body_summary": "OP (29F, size 16) feels used by her friend (30F) who wants her in the bridal party to showcase \"diversity,\" forcing her into an uncomfortably tight dress. OP confronted her friend, accusing her of using her as a \"body positivity prop\" and withdrew from the wedding. AITA for refusing?\n...",
        "reddit_judgments": {
            "YTA": 22,
            "NTA": 104,
            "ESH": 3,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-01T05:12:05.751921"
    },
    {
        "id": "1kzu1ir",
        "title": "AITA for making my pregnant sister lose time after she told me to \"pretend i didnt know her\"?",
        "url": "/r/AmItheAsshole/comments/1kzu1ir/aita_for_making_my_pregnant_sister_lose_time/",
        "body_summary": "OP (19M) asked his pregnant sister (28F) for a ride. She agreed but was embarrassed by his casual, sunburn-friendly clothes at IKEA and told him to pretend he didn't know them. OP retaliated by deliberately lagging behind and annoying her. AITA for his reaction?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 57,
            "ESH": 4,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-01T05:12:07.257791"
    },
    {
        "id": "1l0ecxn",
        "title": "AITA: My husband will invite his family and friends over without telling me until that day. He then expects me to clean, run to the store and prep/cook everything. I finally just decided to leave the house the last time he told me because I only had 4 hours till their arrival. He canceled.",
        "url": "/r/AmItheAsshole/comments/1l0ecxn/aita_my_husband_will_invite_his_family_and/",
        "body_summary": "The thing is, his family is constantly judging and talking about each other, so when he says \"It doesn't matter, they don't care...\" I know, and he knows, he's full of it.\n\nAlso, it's not just tidying the house. We are not regularly stocked in food or drinks to have people over. When I got home, I asked what he was planning on having for dinner, and he responded, \"I don't know, I guess it's good that they aren't coming over anymore.\"\n\nNow he is sulking, saying I am the problem because I can't go with the flow. I have told him multiple times I just need a couple days notice to get things in order. But he insists I am just difficult, uptight and uncooperative. \n\nAITA?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 128,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-01T05:12:09.043137"
    },
    {
        "id": "1kzp8ip",
        "title": "AITA for stealing my dead sister’s name?",
        "url": "/r/AmItheAsshole/comments/1kzp8ip/aita_for_stealing_my_dead_sisters_name/",
        "body_summary": "OP (19F) argues with her mother over spelling her name. Mom wants a different spelling, claiming spirituality. OP dislikes it, tying her name to her identity. Mom changed OP's name on things, revealed OP has her deceased sister's name with a changed spelling. Mom now claims OP's name \"belongs\" to her sister. OP wants to refuse, but parents disagree. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 67,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 70
        },
        "total_judged": 70,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-01T05:12:11.098273"
    },
    {
        "id": "1kzt8vt",
        "title": "AITA for feeding my nieces pizza",
        "url": "/r/AmItheAsshole/comments/1kzt8vt/aita_for_feeding_my_nieces_pizza/",
        "body_summary": "OP, 18, babysat nieces and ordered pizza from a local place to save time studying. Sister is a health freak and angry OP gave her kids pizza. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 132,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 133
        },
        "total_judged": 133,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-01T05:12:14.797262"
    },
    {
        "id": "1kzrejq",
        "title": "AITAH for telling my husband not to run with our dog",
        "url": "/r/AmItheAsshole/comments/1kzrejq/aitah_for_telling_my_husband_not_to_run_with_our/",
        "body_summary": "OP's dog hates running with her husband, hiding when he prepares. OP forbade husband from taking dog running. Husband argues lack of time due to baby. OP wonders AITA for limiting husband's exercise, despite dog's aversion.\n...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 59,
            "ESH": 3,
            "NAH": 3,
            "INFO": 5,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-01T05:12:17.346499"
    },
    {
        "id": "1l07w5v",
        "title": "AITA for refusing to top up on electricity coz my roommate likes to keep her lights on",
        "url": "/r/AmItheAsshole/comments/1l07w5v/aita_for_refusing_to_top_up_on_electricity_coz_my/",
        "body_summary": "OP's roommate wastes electricity by leaving her lights on 24/7, causing them to run out before the month's end. OP refused to contribute extra money to buy more tokens after the roommate left her lights on while away for a week, even though she had the money. AITA?\n...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 10,
            "ESH": 2,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-01T05:12:18.663045"
    },
    {
        "id": "1l014eu",
        "title": "AITA for neutering my cousin's dog",
        "url": "/r/AmItheAsshole/comments/1l014eu/aita_for_neutering_my_cousins_dog/",
        "body_summary": "OP took in neglected Dobermans (Blacky and Red) from her cousin. To prevent puppies, OP informed cousin she's neutering Red, his dog, without permission. Family thinks OP is wrong for taking away cousin's potential income. AITA?\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 82,
            "ESH": 8,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 100
        },
        "total_judged": 100,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-01T05:12:20.946135"
    },
    {
        "id": "1kzpzmg",
        "title": "AITAH for refusing to allow my siblings to use me for my money?",
        "url": "/r/AmItheAsshole/comments/1kzpzmg/aitah_for_refusing_to_allow_my_siblings_to_use_me/",
        "body_summary": "OP's siblings, all unemployed adults, expected her to pay for their mother's birthday dinner. OP refused, leading to an argument and accusations of being stingy. Now OP plans to split costs for future events, anticipating more conflict. AITAH for not paying for her siblings?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 51,
            "ESH": 5,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-06-01T05:12:22.299873"
    }
]