[
    {
        "id": "1pk7x71",
        "title": "AITA for “choosing other women over my cousin”… even though she’s my cousin?",
        "url": "/r/AmItheAsshole/comments/1pk7x71/aita_for_choosing_other_women_over_my_cousin_even/",
        "body_summary": "\nFor six years, I (28M) lived with my favorite cousin “Carly” (25F). I covered almost everything rent, utilities, groceries while she paid $400 a month in a city where min rent  is $2,200. I’m in a financially better situation so this was never really an issue.\n\nThen one night, after I came home around 3am from a date, I came home to find  Carly threw food all over my bed because I “made her waste her time” by not knowing she cooked for us.\n\nThat was the moment I realized something was very wrong. Firstly I could save more by living on my own but secondly Carly was either insane or acting like a jealous girlfriend instead of a cousin.\n\nWhen our lease ended, I tried setting one small boundary: that she would contribute a little more that being 600 instead of 400 and that we move closer to m...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 46,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-12T05:14:15.845551"
    },
    {
        "id": "1pk2vjt",
        "title": "WIBTA telling my ex husband’s fiancé he’s using the diamond from my ring from our marriage?",
        "url": "/r/AmItheAsshole/comments/1pk2vjt/wibta_telling_my_ex_husbands_fiancé_hes_using_the/",
        "body_summary": "Ex husband and I have been divorced for 2 years, separated for 4. During mediation he wanted the 2.5ct diamond back from the engagement/wedding ring he gave me, and I agreed. We coparent our 2 kids relatively well, but overall, he terrifies me and can be vengeful. I hope he’s nice to whatever partner he’s with, and treats them better than he did me. \nHe recently got engaged to someone he’s only been dating for roughly 6 months. The kids had no idea he was going to propose (they’ve been living together the past 3 months). the way i found out was through the kids… whereas I prefer to give coparenting heads ups on things that would impact the kids. \nMy daughter voluntarily said that the diamond looks a lot like mine (it did have distinct occlusions). If I see his new fiancé and confirm that t...",
        "reddit_judgments": {
            "YTA": 45,
            "NTA": 0,
            "ESH": 0,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-12T05:14:35.032807"
    },
    {
        "id": "1pkcqeq",
        "title": "AITA for refusing to help a \"mom in need\"?",
        "url": "/r/AmItheAsshole/comments/1pkcqeq/aita_for_refusing_to_help_a_mom_in_need/",
        "body_summary": "Two years ago, a struggling mom reached out on a local Facebook group, asking for someone to help her buy Christmas gifts for her daughter. I answered her plea and helped her out. The next year, she had welcomed a second child, had to quit her job to care for her sick mother, and had apparently sold a car so she and her husband could make ends meet. I helped again. After the second Christmas, she sent me a thank you and a friend request, and I accepted. Her profile was full of TikTok posts that detailed her life as a novice influencer. So many videos of her doing designer shopping hauls, displaying expensive nails, and trying out expensive coffee shops and such. So basically, she was struggling because of this. I posted something on Reddit before about this and people advised me how to pro...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 51,
            "ESH": 3,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-12T05:14:50.992899"
    },
    {
        "id": "1pk1c2o",
        "title": "AITA for calling out a buddy for eating the crunchy cheese layer off the Mac & cheese",
        "url": "/r/AmItheAsshole/comments/1pk1c2o/aita_for_calling_out_a_buddy_for_eating_the/",
        "body_summary": "Went out to a nice tapas dinner with two buddies on a golf trip. We order very much with a sharing mindset. People tossed out ideas of menu items, agreed to stay away from seafood due to one person having an allergic sensitivity. As the food arrives, one of the items was a Mac & cheese that had a layer of crunchy melted cheese on top. One dude proceeded to serve himself and took THE ENTIRE TOP LAYER of the Mac. I called him out in a half joking manner like “yo! What you are doing, you terrorist!?! Who takes all the topping?” Again, in a sarcastic joking tone but clearly sending a message. He proceeded to cut half the crust off his plate and put it back in the community bowl. Am I the asshole for calling him out?!\n\nPart two is a huge blow up argument on the golf course the next day when it ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 46,
            "ESH": 5,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-12T05:15:07.180172"
    },
    {
        "id": "1pkdnrc",
        "title": "AITA for moving a student to a different table without asking for permission from his mother?",
        "url": "/r/AmItheAsshole/comments/1pkdnrc/aita_for_moving_a_student_to_a_different_table/",
        "body_summary": "I am an elementary school teacher. One of my students, who we’ll call Carson, is 6. Recently, I noticed he was showing signs of being on the autism spectrum. Carson avoids eye contact, flaps his hands when anxious, gets overwhelmed in noisy situations. However, what really stuck out to me was the trouble he has when it comes to my classroom’s fluorescent lighting. Some of the other kids have teased him because of these behaviors.\n\nI brought this up during a parent-teacher conference with his mom. I explained that I thought Carson might need some accommodations to thrive, especially around sensory stuff. She got very defensive and insisted that Carson is “normal” and “not like Trevor,” his 9 year old brother who’s in a special program because he is nonverbal and has autism. \n\nI moved Carson...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 66,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-12T05:15:23.104991"
    },
    {
        "id": "1pjzb99",
        "title": "AITA for calling out my neighbor on address fraud?",
        "url": "/r/AmItheAsshole/comments/1pjzb99/aita_for_calling_out_my_neighbor_on_address_fraud/",
        "body_summary": "My neighbor is President of our Road Association and I’m Treasurer. He used my address without my permission on a signed legal document for insurance for our neighborhood road association. \n\n\nHe asked my permission and I said “no,” but he used my address anyway.\nI asked him to change it to his and he said “ok” but never changed it.\n\n\nI called the insurance broker and she said she would change but never did.\nWhen I asked her to send me the signed legal document showing it was changed, she committed fraud by doctoring the document three weeks post-signature.\n\n\nThe broker and my neighbor think I’m being unreasonable not letting them use my address on a document I’m not signing. \nMy address they are trying to use without my permission is across the state.\n\n\nMy neighbor/president says he wants ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 15,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-12T05:15:38.699068"
    },
    {
        "id": "1pjtktg",
        "title": "AITA for yelling at my mum for picking me up late…",
        "url": "/r/AmItheAsshole/comments/1pjtktg/aita_for_yelling_at_my_mum_for_picking_me_up_late/",
        "body_summary": "AITA for telling my mum I’m not paying her anymore if she keeps picking me up late?\n\nI’m 16, can’t drive yet, and my job is 17km from home. When I applied, my mum said she was sweet with driving me there and back. I even offered to pay her for petrol because I didn’t want to be annoying. She agreed.\n\nBut now that I’ve been working for a bit, she constantly shows up insanely late. Not like ten minutes. I mean over an hour. Every. Single. Day. I finish late at night, my feet are killing me from long shifts, and she expects me to just sit around Kmart waiting for her like it’s no big deal. I’m exhausted and half the time the store is closing and I’m just wandering around like a zombie.\n\nI always remind her when I finish. She knows exactly what time to come. And she still tells me “other stuff...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 29,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-12T05:15:54.677360"
    },
    {
        "id": "1pk811p",
        "title": "AITA for refusing to take a wedding photo?",
        "url": "/r/AmItheAsshole/comments/1pk811p/aita_for_refusing_to_take_a_wedding_photo/",
        "body_summary": "I (30m) am a wedding photographer. And a good one. \n\nI was hired for last weekend to do a wedding. It was a lavish one. I was one of three photographers hired, and was told my main job was to photograph the groom (I think late 20s), his groomsmen, and the groom’s family. They had two photographers to photograph the bride’s side. \n\nPrior to agreeing to do the wedding, I always ask standard questions, such as what kind of special photos do you want. The groom seemed low maintenance, said his family was small, but him and his groomsmen were all very close from their frat days and he wanted to take a lot of photos with them. That seemed standard to me. \n\nAfter we’ve done what I considered a lot, I asked if there was anything special they wanted before we wrapped up. One of them brought up gett...",
        "reddit_judgments": {
            "YTA": 130,
            "NTA": 24,
            "ESH": 3,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 159
        },
        "total_judged": 159,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-12T05:16:12.599371"
    },
    {
        "id": "1pk6nbq",
        "title": "AITA for telling my parents about what she said, or was she out of line for getting so angry?",
        "url": "/r/AmItheAsshole/comments/1pk6nbq/aita_for_telling_my_parents_about_what_she_said/",
        "body_summary": "I (16F) go to a therapist who recently started using an empty office space my parents own. They made an agreement, she could use the space for free as long as she paid for electricity or gas and gave me free sessions.\nAt first everything was fine, but during multiple sessions she would complain about the space. Stuff like “it’s so hot without AC,” “the door is broken,” “this place needs plants,” etc. I told my parents because it made me uncomfortable, and they said she shouldn’t be telling me that.\nToday things blew up. The cleaning lady was working while I had my session. My therapist complained that the lady never cleans the windows and said she’d fire her if it were her house. Then she suggested we move to my dad’s office while the lady cleaned.\nMy dad showed up while we were there and ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 27,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-12T05:16:28.189134"
    },
    {
        "id": "1pk2pb7",
        "title": "AITA for not wanting my coworker’s whole family to come on our girls’ camping trip?",
        "url": "/r/AmItheAsshole/comments/1pk2pb7/aita_for_not_wanting_my_coworkers_whole_family_to/",
        "body_summary": "I (30sF) have a group of younger female coworkers (early 20s) that I get along with really well. We all work retail, and since it’s hard to get the same days off, we planned a girls’ camping trip months in advance. We put in the requests at work early, got approved, and one of the girls (“Planner”) started organizing things. Her “Bestie” also helped by buying some of the essentials.\nHere’s where things got messy.\nAbout two weeks before the trip, Bestie suddenly asked if she could invite her mom. I was not thrilled, this was supposed to be a girls’ trip, and none of us , except the planner friend, had ever met her. But Planner insisted her mom was “cool,” so I reluctantly said fine.\nThen one week before the trip, Bestie asked if her sister and her sister’s boyfriend could come too. At that ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 24,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-12T05:16:43.735718"
    }
]