[
    {
        "id": "1ql05gi",
        "title": "AITA for not getting my nephew an internship interview after getting them for most of the others?",
        "url": "/r/AmItheAsshole/comments/1ql05gi/aita_for_not_getting_my_nephew_an_internship/",
        "body_summary": "I work for a large organization that brings on interns, and over the years I have gotten most of (but not all) my nieces and nephews interviews. They are never guaranteed spots. All I do is get them in the interview pile. \n\nMy nephew is graduating. His mom (my SIL) asked me about the internship, and I told her that Eric needs to be the one to reach out to me. When he finally came to me, it was obvious he was just doing it because she told him to. He did not seem interested, and if I am honest, the way he speaks is childish. It’s all braindead “bruh” “fam” tiktok speak. He could not articulate WHY he wanted the internship.\n\nI told him that if he really wants this, I need him to show me, and asked him to write me a brief note giving me the reasons he wanted the internship and what he planned...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 82,
            "ESH": 1,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 94
        },
        "total_judged": 94,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-24T05:14:47.058782"
    },
    {
        "id": "1qkj6lr",
        "title": "AITA for thinking my landlord (uncle) is unfair for kicking me out for having my boyfriend over?",
        "url": "/r/AmItheAsshole/comments/1qkj6lr/aita_for_thinking_my_landlord_uncle_is_unfair_for/",
        "body_summary": "Sorry this is long, but there’s a lot of context.\n\nI (22F) and my brother (19M) rent a house from our uncle. It’s just the two of us on the lease. Our uncle does NOT live with us.\n\nThe same day we signed the lease, our uncle told us that another woman would be living with us “to keep an eye on us.” This was not discussed beforehand. She moved some stuff in but never actually slept there. Eventually, her daughter started living there instead, without my uncle knowing. As far as he knows, the original woman lived there the whole time.\n\nWhile the daughter lived there, she constantly ate the food my brother and I bought with our own money and my EBT. She never bought groceries and kept eating our food even after we told her not to. Sometimes the mother would come over and eat our food too.\n\nA ...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 46,
            "ESH": 3,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 58
        },
        "total_judged": 58,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-24T05:15:03.411930"
    },
    {
        "id": "1qkzbr1",
        "title": "AITA For Getting Upset with Unexpected Visitors?",
        "url": "/r/AmItheAsshole/comments/1qkzbr1/aita_for_getting_upset_with_unexpected_visitors/",
        "body_summary": "Throwaway account as my husband knows my regular account. My husband and I have lived in our house for a few years now, based in a major travel hub in the Midwest. Because of the fact that it is a city where many pass through or fly out of for travel, we tend to get friends and family that stay the night before carrying on with their travels. I'm fine with this, as long as a proper heads up is given (I would consider this a few days). \n\n  \nHowever, 3-5 times a year, my husband's friends and family seem to want to just drop in and use our home as an overnight hotel. There have been numerous instances where my husband will let me know the day of that he has friends or family that are wanting to stay the night. Keep in mind, these are trips that were pre-planned, and that they knew were happe...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 125,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-24T05:15:20.699770"
    },
    {
        "id": "1qkwkw9",
        "title": "AITA for banning my neighbor from our community garden?",
        "url": "/r/AmItheAsshole/comments/1qkwkw9/aita_for_banning_my_neighbor_from_our_community/",
        "body_summary": "I live in a small apartment building with a shared garden at the back. We all get one raised bed. My neighbor (Lisa) always “forgets” tools, leaves her weeds on the path and sometimes last year she accidentally pulled up half my carrots thinking they were weeds. I was annoyed but I let it go.  \nThis year I finally grew perfect tomatoes. I’ve been babying them for months. One day  I came out to find Lisa picking them. A whole bowlful. She smiled and told me they looked so ripe and she  thought she’d help before the birds got them.  I snapped and told her those were mine and she had no right and that she’s consistently disrespectful of the shared space. I suggested that until she learns to ask and clean up after herself she’s not to use the garden. Our building’s group chat agreed. She respe...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 35,
            "ESH": 5,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-24T05:15:36.580633"
    },
    {
        "id": "1qkncs7",
        "title": "AITA for refusing to change how I use a shared space after my roommate complained?",
        "url": "/r/AmItheAsshole/comments/1qkncs7/aita_for_refusing_to_change_how_i_use_a_shared/",
        "body_summary": "I (23F) live with my roommate Sophia (22F) and we’ve been sharing an apartment for about a year. We split rent evenly and haven’t had any major issues until recently. We mostly do our own thing but share common spaces like the living room and kitchen. A few weeks ago, I started spending more time in the living room in the evenings to relax after work. Usually this means sitting on the couch, watching TV at a normal volume, or having a light on while I read or scroll on my phone. This is typically between around 8–10 PM. I don’t stay up late in the living room and I’m mindful of noise. Sophia recently told me that this bothers her. She said she prefers the living room to be quiet and dim in the evenings and that my being in there makes it harder for her to relax even when she’s in her bedro...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 74,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 76
        },
        "total_judged": 76,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-24T05:15:52.499350"
    },
    {
        "id": "1qkvela",
        "title": "AITA for refusing to apologise for giving advice?",
        "url": "/r/AmItheAsshole/comments/1qkvela/aita_for_refusing_to_apologise_for_giving_advice/",
        "body_summary": "I've been with my girlfriend for 5 years so I know her family quite well. She is really close to her cousin who has just turned 17. My girlfriend is 27 and I am 28. Her cousin has joined us on days out and meals etc in the past. \n\nShe's always been quite quiet and isn't like a lot of kids her age who enjoy drinking etc, she tends to keep to herself and just reads, watches movies and things like that. \n\nWe were out last weekend and the cousin asked if she could ask me some questions. I asked what about and she mentioned it was about boys and dating since she didn't have anyone in the family near her age to ask. \n\nI agreed and she just asked me about if all guys want to have sex quite sickly and if it's normal for them not to want to wait etc. I just told her not to feel pressured into anyth...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 44,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-24T05:16:08.792950"
    },
    {
        "id": "1qlaru5",
        "title": "AITA for not enjoying the birthday gifts my friend got me that mocked my dead mother",
        "url": "/r/AmItheAsshole/comments/1qlaru5/aita_for_not_enjoying_the_birthday_gifts_my/",
        "body_summary": "Hi reddit, I'm posting this on a throwaway account due to some of the people involved use reddit. Im re-writing this post because the one I initally wrote would have been too long, so I'm going to summarize the series of events as best as possible.  \nI (20F) lost my mother 8 months ago, suddenly. I have experience a wave of emotion as I had a weird relationship with my mother and a lot of unsaid things. I did not get to say goodbye to her which pains me every. single. day. I have a large group of friends, some from high school and some from uni, who have all supporting me tremendously. One specific friend, Kayla, I met in uni. I would not consider her my best friend, but she has been such an amazing support to me throughout this whole situation with my mom. She always told me I could come ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 156,
            "ESH": 0,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 159
        },
        "total_judged": 159,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-24T05:16:25.504648"
    },
    {
        "id": "1ql7t4p",
        "title": "AITA for reporting someone for cheating and now they’re saying i ruined their life?",
        "url": "/r/AmItheAsshole/comments/1ql7t4p/aita_for_reporting_someone_for_cheating_and_now/",
        "body_summary": "posting on a throwaway.\n\ni reported someone a while back for cheating on an exam for a sophmore year class, and somehow she figured out it was me. she dmed me and told me they got disowned by their parents over it and now they have to pay their own tuition. she said i “ruined their life”. i think they were able to find out through the academic integrity office because the accused are allowed to see details of their referral.\n\nit’s not like i got anything out of this. i didn’t get a better grade or reward. there are no curves. but i didn’t expect it to blow up like this. i thought they’d maybe get a zero or have to retake the exam.\n\ndid i do the right thing or should i have just stayed quiet? am i in the wrong?\n\nedit: i go to a prestigious private school. after doing some research i found o...",
        "reddit_judgments": {
            "YTA": 24,
            "NTA": 66,
            "ESH": 7,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 103
        },
        "total_judged": 103,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-24T05:16:42.009045"
    },
    {
        "id": "1ql3n79",
        "title": "AITA for not inviting my broke friend to a concert",
        "url": "/r/AmItheAsshole/comments/1ql3n79/aita_for_not_inviting_my_broke_friend_to_a_concert/",
        "body_summary": "Last year, my best friend and I had a falling out, and I’m still not fully sure how much of it was on me. The final incident involved a concert we had talked about going to for months but never made solid plans for until the week before. At that point, she was struggling financially and had already said she couldn’t really afford even one day. Tickets had gone up in price, and it appeared that one-day tickets were sold out, leaving only the two-day option, which was much more expensive. I still really wanted to go and didn’t want to miss it.\n\nAround this time, I had also gotten closer to a new group of friends who had been hanging out with both of us. A pattern had formed where we would all talk about plans, but my best friend often wouldn’t end up coming because she chose to stay home wit...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 14,
            "ESH": 0,
            "NAH": 4,
            "INFO": 2,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-24T05:16:57.699578"
    },
    {
        "id": "1qkrf3h",
        "title": "AITA for not moving to another locker room bench",
        "url": "/r/AmItheAsshole/comments/1qkrf3h/aita_for_not_moving_to_another_locker_room_bench/",
        "body_summary": "Some context: the locker room of my local gym has benches that are wide enough for two people to sit and change. Each half of the bench faces 5 lockers (first come first serve, unassigned). People usually take up one half of the bench, leaving the other half clear for someone else.\n\nAfter working out, if I return to the locker room and someone is using the half of the bench in front of my locker, I take out my stuff and use the other half, if empty, or the bench immediately behind. This happens frequently as there are about 5 lockers per bench half. If someone is using an entire bench (unusual, as people tend to be more considerate), I may ask them to clear half or I may just move my things to a separate bench.\n\nToday, I was changing after showering, with my stuff on the bench in front of ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 11,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-24T05:17:13.197370"
    }
]