[
    {
        "id": "1q5jarl",
        "title": "AITA for “ripping my daughter away from family”",
        "url": "/r/AmItheAsshole/comments/1q5jarl/aita_for_ripping_my_daughter_away_from_family/",
        "body_summary": "I 25F and my husband 26M recently had a baby. Context for the story: My husband and I grew up in different states on opposite sides of the country. When we both graduated college, he moved in with me in my home state. I had a very long, difficult labor. I almost died and so did my child. She came out not breathing and was totally limp when she was placed on my chest. My parents are divorced. I am an only child.\n\nWe live about 15 minutes from my side of the family. So far, after my daughter’s birth, my mother has visited maybe 4 times. She shows up, takes a couple of photos for Facebook to show the world how great of a grandma she is, then leaves.\n\nMy dad is very involved but I struggle with that since him and I did not have a great relationship as I was growing up. He has been narcissistic...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 110,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 110
        },
        "total_judged": 110,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-07T05:18:07.402902"
    },
    {
        "id": "1q5aaez",
        "title": "AITA for being upset that my dad didn’t get me anything I asked for, but bought himself a PS5?",
        "url": "/r/AmItheAsshole/comments/1q5aaez/aita_for_being_upset_that_my_dad_didnt_get_me/",
        "body_summary": "I (16M) was told by my dad to make a Christmas list. I kept it simple and asked for three things:  \n1. My driver’s permit (which I’ve been asking for for a while)  \n2. An Xbox Series X\n3. An irrelevant item to the story\n\nMy main goal was the permit. I wake up at 5:30 a.m. every day to catch the bus to school and stand outside in the cold. After school my bus is also inconsistent (One time I was at school an extra hour because my bus was late.) I figured if I got my permit, I could start learning to drive and eventually stop relying on the bus. I don't feel like I was asking for a lot. I just wanted something that would help me in my daily life.\n\nMy brother also made a list. He got everything he asked for, including a VR headset. My dad also bought himself a brand new PS5 and 14 games :/. \n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 27,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-07T05:18:23.003721"
    },
    {
        "id": "1q5g51c",
        "title": "AITA for throwing away a dangerous item that wasn't mine",
        "url": "/r/AmItheAsshole/comments/1q5g51c/aita_for_throwing_away_a_dangerous_item_that/",
        "body_summary": "Yesterday I found a badly damaged charging cable in our living room. It was plugged in where my parents usually keep their cables. It had several open spots. Like, with the wires sticking out and half-heartedly kept together with some tape I doubt can be used to repair cables. \n\nI showed it to my dad and he was very upset with himself how he apparently could have let something like this happen. We agreed it was dangerous and we threw it away immediately. \n\nToday, my sister who lives with us over christmas searched for her charging cable. I realised the damaged one had been hers. She immediately threw a huge drama that she desperately needed it for Uni and how we couldn't even have asked who the cable belonged to. (She was out yesterday). I must admit I just forgot about it, as I thought it...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 37,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-07T05:18:38.823302"
    },
    {
        "id": "1q5kct5",
        "title": "AITA for considering not going to my sister’s wedding?",
        "url": "/r/AmItheAsshole/comments/1q5kct5/aita_for_considering_not_going_to_my_sisters/",
        "body_summary": "I don't want to go to her wedding because she has decided to invite both my dad and my aunt, aka his sister.\n\nMy aunt just posted some photos with my dad and his new wife over the holidays, and my mom was very triggered, and my sister does not want to pick sides, so she's just playing the neutral part and trying to invite everybody and assuming that my mom and I are just going to put up with it when my dad left us in such a savage way. He cheated on my mom and then left us in financial ruin. My sister didn’t get affected because she (luckily for her) found a job immediately after graduating from grad school and was living with her boyfriend. I didn’t get so lucky and moved back home where I was looking for a job for over a year. During this time, I had to witness my mom struggle and make e...",
        "reddit_judgments": {
            "YTA": 21,
            "NTA": 29,
            "ESH": 1,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 57
        },
        "total_judged": 57,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-07T05:18:56.192166"
    },
    {
        "id": "1q5ddwk",
        "title": "AITA for being slightly annoyed at my dad's $800 Christmas gift?",
        "url": "/r/AmItheAsshole/comments/1q5ddwk/aita_for_being_slightly_annoyed_at_my_dads_800/",
        "body_summary": "For some context, I (18M) and my dad (61M) have had somewhat of a strained relationship for the past few years. To not get into too much detail, my sister (21F) and I recently discovered he's been serially cheating on my mom (54F) since 2021, and it was a pivotal factor in my parents' divorce back in November. In spite of this, he's taken no accountability for any wrong doing in their separation. \n\nAs you can imagine, even in the earliest of Christmases, my father has never been much of a participant. He rarely buys gifts beyond last minute pick ups, and we usually have to drag him downstairs to start gift giving, before he takes a step out after a few unboxings. This year, however, was different---it was the first Christmas with my parents separated (not on paper, but in their relationshi...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 12,
            "ESH": 2,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-07T05:19:11.765924"
    },
    {
        "id": "1q5ecep",
        "title": "AITA for refusing to apologize after I followed our agreed plan?",
        "url": "/r/AmItheAsshole/comments/1q5ecep/aita_for_refusing_to_apologize_after_i_followed/",
        "body_summary": "My name is Lisa and I have a friend, Maya we are both 23years of age and we’ve been close friends for a few years now. We usually get along, but we have very different personalities. I’m more of a planner and like things to be clear ahead of time, while she’s more spontaneous and goes with the flow.\n\nA few weeks ago, we were working together on a group project for school that counted for a big portion of our grade. Because it was important, I suggested we divide the work evenly and set deadlines so nothing got rushed at the end. Everyone, including Maya, agreed to this plan. I finished my part early and shared it in the group chat in case anyone wanted to give feedback. A couple of days before the deadline, it became clear that Maya hadn’t started her portion yet. She said she’d been busy ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 24,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-07T05:19:27.255936"
    },
    {
        "id": "1q5iord",
        "title": "WIBTA for asking my housemate to kick her mom out",
        "url": "/r/AmItheAsshole/comments/1q5iord/wibta_for_asking_my_housemate_to_kick_her_mom_out/",
        "body_summary": "I (26) moved into a new shared house a few months ago. There were two women already living there; Maddie (31) and Louise (23). So far we've gotten along fine-- a few settling in hiccups but nothing major.\nHowever, Louise's mother frequently visits. As in, she will stay the weekend every other week. She sleeps in my housemates  room; Louise has a bunk bed. Thats fine. I can deal with it. She's nice and all, and doesn't cause any problems, but she is not someone I want to hang out with (aside from the fact that she's my housemates mom she has some...interesting opinions and a habit of sharing them unprompted). This has escalated over the holiday break; she stayed here for the 6 days leading up to Christmas, then again from the 26th to the 30th, and now she's been here since the 1st of Jan. E...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 9,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 11
        },
        "total_judged": 11,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-07T05:19:42.738835"
    },
    {
        "id": "1q5hr0q",
        "title": "AITA for not wanting to wear a hoodie with my own game design outside even though my mom spent a lot of money on it?",
        "url": "/r/AmItheAsshole/comments/1q5hr0q/aita_for_not_wanting_to_wear_a_hoodie_with_my_own/",
        "body_summary": "First of all, I wanted to explain something important about the story:  \nThere is a game company called \"Supercell\" which sometimes runs a contest called \"Supercell Make\" where you can create cosmetics for some characters. They recently did one for one of their games, and I wanted to try to participate to see if I had any luck.  \nI showed my designs to my family to ask for feedback, and my mother asked if I could send her the drawings so she could do something she didn't want to tell me.  \nToday (at least in Spain) is Three Kings Day, and we went downstairs to open the presents. Really excited, I opened my third present, and I got a bottle with the design of the skin I made. I thanked her and asked her if I could only use the bottle when I'm inside my house because I would feel embarrassed...",
        "reddit_judgments": {
            "YTA": 25,
            "NTA": 2,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-07T05:19:58.287019"
    },
    {
        "id": "1q5aaub",
        "title": "AITA for telling my friend to F*** off",
        "url": "/r/AmItheAsshole/comments/1q5aaub/aita_for_telling_my_friend_to_f_off/",
        "body_summary": "My roommate had her sister and her sister's daughter come stay with us for two weeks. Mind you, it was only supposed to be 3 or 4 days. They brought their dog, which barked loudly every morning! He sister yelled at her daughter a ton, and the kid screamed bloody murder on multiple occasions. (the sister also slapped this child who is about 7 or 8) \n\nI told my roommate how uncomfortable I was with the situation, She did nothing- granted, I didn't exactly expect her to do anything; it's not like she could kick her sister out. Additionally, the house was an absolute disaster!!! No one was cleaning up after themselves. the cleanliness of the apartment has come up countless times over the three years we've lived together, and I constantly tell her how stressed I get when the place is a mess. I ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 3,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 3
        },
        "total_judged": 3,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-07T05:20:13.623722"
    },
    {
        "id": "1q5fclk",
        "title": "AITA for refusing to let my mother use the money in my trust fund.",
        "url": "/r/AmItheAsshole/comments/1q5fclk/aita_for_refusing_to_let_my_mother_use_the_money/",
        "body_summary": "My mother had put my money in my trust fund since i was young. When i turned 18 i told her she can stop and that i will now put my own money in it. With the money she was putting in mine she can put it my younger sisters trust fund. One she got just started wanting to use the money like it its hers. As far as i know, she was the one putting money in my trust fund not hers and mine. I specifically told her i will only use if something terrible were to happen to her like she dies. So AITA ?",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 4,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 6
        },
        "total_judged": 6,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-07T05:20:13.797067"
    }
]