[
    {
        "id": "1r3ltm1",
        "title": "AITA for confronting my friend in front of people when she implied I’m an alcoholic?",
        "url": "/r/AmItheAsshole/comments/1r3ltm1/aita_for_confronting_my_friend_in_front_of_people/",
        "body_summary": "I (22F) was hanging out with my friend and her (21F) other friends who I don’t know, when she brought up an acquaintance of hers and said to me, “She’s an alcoholic, so you probably know her.“ Implying that I’m an alcoholic.\n\nI barely drink at all. I only accept if someone offers me wine or champagne at a social gathering, which happens maybe once a month. I have never been drunk in my life or even had more than a glass at a time.\n\nI said, “Why would you think that I know her because she’s an alcoholic? I’m not an alcoholic. I hardly even drink.” She rolled her eyes at me and said, “Of course, I’m sureee you’re not.” As if I’m some kind of addict in denial. I’ve never even had a drink in front of her. I don’t know where this audacity came from, but she made her other friends all think I ha...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 80,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-14T05:37:35.697982"
    },
    {
        "id": "1r3h4lf",
        "title": "AITA for not offering to take the bunk bed in an airbnb as the single person?",
        "url": "/r/AmItheAsshole/comments/1r3h4lf/aita_for_not_offering_to_take_the_bunk_bed_in_an/",
        "body_summary": "For my friend’s birthday she wanted our friend group to go away for the weekend for 2 nights. We are a group of 6 girls and she said that partners are welcome so there are now 10 of us (4 couples and 2 singles). She organised the Airbnb and we are dividing the cost equally between everyone. \n\nThere are 6 rooms: 2 rooms with a double bed, 2 rooms with 2 single beds and 2 rooms with 2 bunk beds. None of the rooms have ensuites and there are 3 bathrooms in the airbnb. \n\nFor deciding who sleeps in what room, myself and my friend that organised the trip (both the single people) asked can we pull names from a hat to see who sleeps where to keep it fair. (Myself and my friend have decided to sleep in the same room so it will be 5 names picked out of a hat)\n\nTwo of the couples are happy with this ...",
        "reddit_judgments": {
            "YTA": 101,
            "NTA": 23,
            "ESH": 10,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 139
        },
        "total_judged": 139,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-14T05:37:51.781954"
    },
    {
        "id": "1r3zgh2",
        "title": "AITA for not chipping in for my teen daughter’s hair appointment?",
        "url": "/r/AmItheAsshole/comments/1r3zgh2/aita_for_not_chipping_in_for_my_teen_daughters/",
        "body_summary": "January 2025, I told my daughter that I didn’t want her to dye her hair. 1. Bc she’s still too young. 2. The cost to maintain it will be a lot especially when I’m already maintaining her gelX manicure every 6 weeks.\n\nShe got her father involved and I expressed those two things. So he asked his wife for her thoughts and she informed my ex that maintaining it doesn’t cost a lot. So I told my ex, that I will only cover her hair cut and I will not help in anyway on my daughter dying or maintaining her hair dying.\n\nMy daughter re-touched her hair July 2025. Her father didn’t reach out to let me know. Which is fine, I’m not paying for it and he didn’t care about my thoughts on why I don’t want her to get it.\n\nNow, my daughter wants highlights, the cost is $170. My ex reached out and asked me if ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 106,
            "ESH": 3,
            "NAH": 2,
            "INFO": 7,
            "TotalJudged": 121
        },
        "total_judged": 121,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-14T05:38:03.165240"
    },
    {
        "id": "1r3njt4",
        "title": "AITA for refusing to give my bedroom to my brother and sleeping in the living room instead?",
        "url": "/r/AmItheAsshole/comments/1r3njt4/aita_for_refusing_to_give_my_bedroom_to_my/",
        "body_summary": "Hi, I’m 19F and in college. My family recently moved into a two-bedroom apartment. It’s my mother, me, and my 21M brother.\n\nAt first, it was only going to be me and my mother living here because my brother was staying with our dad. But after we moved, he came back to live with us.\n\nSince there are only two bedrooms, my mother bought a couch that turns into a bed, so my brother has been sleeping in the living room. He’s been complaining about it a lot, and now my mother is tired of hearing it. She has decided that he should get my bedroom, and I’ll be the one sleeping in the living room instead.\n\nI refused. The issue is that I use my room a lot to study and focus. My brother usually stays up until 4am playing video games. I feel like if he gets the room, it’ll mostly be so he can stay up la...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 52,
            "ESH": 4,
            "NAH": 8,
            "INFO": 3,
            "TotalJudged": 69
        },
        "total_judged": 69,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-14T05:38:11.429898"
    },
    {
        "id": "1r3sszf",
        "title": "AITA for telling my sister she can’t regularly bring her boyfriend to stay in my home?",
        "url": "/r/AmItheAsshole/comments/1r3sszf/aita_for_telling_my_sister_she_cant_regularly/",
        "body_summary": "Per my last post here, this quandary is owing to my unusual living situation: I rent my childhood home from my mother, who lives in her second home elsewhere. I make a pretty small wage in an extremely expensive city, so while I would like to just have my own place, it’s not going to be feasible for a long time (my current company is even on a pay freeze).\n\nMy sister makes substantially more than me but lives in a busy house share the other side of the city. Her bf lives in essentially poor student accommodation in a different city. She’s recently been saying that she feels she’s outgrowing her house share, and that she and her partner find it really stressful staying there because of how busy it is, and they can’t get much peace together.\n\nAll that to say that last weekend they came to st...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 128,
            "ESH": 2,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-14T05:38:20.473537"
    },
    {
        "id": "1r45ebj",
        "title": "AITA For calling out my best friend for stealing from me",
        "url": "/r/AmItheAsshole/comments/1r45ebj/aita_for_calling_out_my_best_friend_for_stealing/",
        "body_summary": "I (34F) hosted my best friend (32F) for a week recently. We've been friends for over 10 years. I've lived across the country for the last 6. \n\nContext - I have a blazer with beaded tassels that she loves. Not that it matters but it is \\~$300. She has asked me for it several times over the past 2 years. Like, \"Don't you want to just give it to me already? Its more my style and you never wear it.\" To which I always laugh it off and say I love that blazer. \n\nWhen she was visiting - she asked again if she could 'just have it' and I laughed and said no I don't want to give it away but you're welcome to wear it to dinner!\n\nHer flight was early Thursday morning. We hugged goodbye but I was asleep and only heard her make coffee and get ready before leaving. \n\nTwo days later, I'm getting dressed an...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 49,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 50
        },
        "total_judged": 50,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-14T05:38:28.827900"
    },
    {
        "id": "1r3zc4i",
        "title": "AITA for declining to share some of my food at a restaurant where I paid for my own order?",
        "url": "/r/AmItheAsshole/comments/1r3zc4i/aita_for_declining_to_share_some_of_my_food_at_a/",
        "body_summary": "I recently went to a restaurant with some family members. The understanding was that each person would be paying for their own food and no one else's (i.e. I was not being treated to this meal by them, or vice-versa). \n\nNow, in general, whenever I go to a restaurant and everyone pays for their own meal, I do not ask others to give me any of their food without offering some of mine to them in return. I do not like to impose on people in such a way, and in life generally I consider it presumptuous to expect others to give me things they bought for themselves without offering them anything in return. This was no exception, and as a result, I simply ate what I had ordered, without asking my companions to give me any of theirs for free.\n\nAnyway, one of the people I was eating with asked me to s...",
        "reddit_judgments": {
            "YTA": 19,
            "NTA": 30,
            "ESH": 2,
            "NAH": 3,
            "INFO": 5,
            "TotalJudged": 59
        },
        "total_judged": 59,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-14T05:38:36.740422"
    },
    {
        "id": "1r427g5",
        "title": "AITA for refusing to pay my partners friend for a stag doo my partner isn't even attending.",
        "url": "/r/AmItheAsshole/comments/1r427g5/aita_for_refusing_to_pay_my_partners_friend_for_a/",
        "body_summary": "My partner was asked to go on a stag doo, I earn the vast majority of our household income. His friends said it would be £300 and we'd have 6 months to pay, would this be affordable, at £50 per month if said it would. 1 week later the goalposts changed and it was £300 needed in a week, my partner told his friend we couldn't afford that all at once so he agreed to pay it in stages and gave him £100 initially. \n\nFast forwards another few weeks and compulsory extras were added making the new total £1000 for a few day trip! Me and partner discussed it and decided we couldn't afford that kind of money. He contacted his friend who said if he was dropping out he still had to pay the full £300 for flights and hotel as said friend had paid for everyone on his own credit card. \n\nDecember comes aroun...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 14
        },
        "total_judged": 14,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-14T05:38:44.241381"
    },
    {
        "id": "1r3ti77",
        "title": "WIBTAH if I Tell My Friend That He is a Horrible Musician and he Should Stop Sending Me his Songs?",
        "url": "/r/AmItheAsshole/comments/1r3ti77/wibtah_if_i_tell_my_friend_that_he_is_a_horrible/",
        "body_summary": "So I have a friend who’s very much into music. So much so that he’s decided it’s his true calling. Unfortunately, he’s very very bad at it. His voice, his flows, his lyrics, his lack of artistic direction, his lack of sonic cohesion, and his lyrics are all mundane to say the least.\n\nHe also floods my messages with his music ad nauseam. Sometimes his beat selection is fire, but I feel I’ve exhausted the “damn that beat hard, bruh” compliment. I feel like the cast of Friends when they tell Joey that the “lighting” is good after watching one of his awful plays.\n\nWhat’s the best way to move on this? I do wanna be honest eventually, but he’s extremely sensitive.",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 3,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 10
        },
        "total_judged": 10,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-14T05:38:44.808018"
    },
    {
        "id": "1r47oeq",
        "title": "AITA for not masking my disability?",
        "url": "/r/AmItheAsshole/comments/1r47oeq/aita_for_not_masking_my_disability/",
        "body_summary": "l am a part of a D&D group with other neurodivergent adults, that play in person every Tuesday. Me and one other girl R both have Echolalia (Echolalia is an involuntary tic) and we both tic frequently at D&D. which was never a problem until now, even with X. X came back to the DnD table after a few months of taking a break from the group. at the beginning of the session R and I were joking around and our Echolalia gets more frequent with elevated emotions. when X arrived and heard us she politely asked us to stop because she was overstimulated from the day. we thought she just wanted a few minutes of quiet until game started. as the night the continued, so did our Echolalia, as it's involuntary. X snapped at us to stop again, we apologized and said we didn't realize she wanted us to stop a...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 32,
            "ESH": 5,
            "NAH": 0,
            "INFO": 6,
            "TotalJudged": 45
        },
        "total_judged": 45,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-14T05:38:52.899838"
    }
]