[
    {
        "id": "1kgtba2",
        "title": "AITA for not letting my boyfriend come on vacation with me because he's a picky eater?",
        "url": "/r/AmItheAsshole/comments/1kgtba2/aita_for_not_letting_my_boyfriend_come_on/",
        "body_summary": "EDIT: I am breaking up with him. After seeing a glimpse into my future via your responses, I realized I cannot do this and it will eventually wreck us. Thank you.\n\n  \nMy boyfriend has tons a food restrictions and is picky in general. He basically can only eat chicken fingers, grilled cheese, Mac and cheese, and pad Thai. Ive never seen him eat a vegetable. We just started dating a few months ago and I love him, but I eat everything and am very laid back.  I know I will have to plan my entire day around finding food he can eat, on top of listening to him complain that things aren't the same. Even if a restaurant does have chicken fingers or Mac and cheese, it won't be the same as what we get at home and I just dont want to hear about it while Im on vacation. AITA? I feel bad.",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 95,
            "ESH": 2,
            "NAH": 5,
            "INFO": 3,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-08T05:11:59.376498"
    },
    {
        "id": "1kh50ec",
        "title": "UPDATE: AITA for refusing to take my low functioning sister out with me and my other sister?",
        "url": "/r/AmItheAsshole/comments/1kh50ec/update_aita_for_refusing_to_take_my_low/",
        "body_summary": "OP felt invisible next to her sister, Macy, who requires more care. OP took Missy on a trip instead of Macy, angering her parents. After, OP told her parents she wouldn't be Macy's caregiver. OP moved out. AITA for prioritizing herself?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 0,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 0
        },
        "total_judged": 0,
        "reddit_verdict": "No Judgments Found",
        "fetched_utc": "2025-05-08T05:12:01.202512"
    },
    {
        "id": "1kgsft6",
        "title": "AITA for telling my husband we will not be hosting for Mother’s Day because of his mom?",
        "url": "/r/AmItheAsshole/comments/1kgsft6/aita_for_telling_my_husband_we_will_not_be/",
        "body_summary": "OP's MIL boycotted her birthday party due to a perceived slight to SIL. OP now refuses to host any MIL-related celebrations. Husband thinks it's petty. AITA?\n...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 149,
            "ESH": 2,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 161
        },
        "total_judged": 161,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-08T05:12:04.173230"
    },
    {
        "id": "1kh5fkb",
        "title": "AITA for refusing to invite my estranged sister to my wedding despite my parents’ threats?",
        "url": "/r/AmItheAsshole/comments/1kh5fkb/aita_for_refusing_to_invite_my_estranged_sister/",
        "body_summary": "OP (28F) is estranged from sister Emma (25F) due to past manipulation and lies. Emma apologized and wants reconciliation. OP's parents demand Emma be invited to OP's wedding, threatening not to attend otherwise. OP fears Emma ruining the wedding but wants parents there. AITA for excluding Emma, risking parents' attendance?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 135,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 137
        },
        "total_judged": 137,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-08T05:12:07.973548"
    },
    {
        "id": "1kgy7ku",
        "title": "AITA for telling my wife that working a ton is necessary right now?",
        "url": "/r/AmItheAsshole/comments/1kgy7ku/aita_for_telling_my_wife_that_working_a_ton_is/",
        "body_summary": "OP's wife is in grad school (no income). OP works long hours to avoid layoffs and support them. Wife feels neglected. OP says it's temporary. Wife says it's a pattern. AITA for prioritizing work to provide?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 79,
            "ESH": 3,
            "NAH": 37,
            "INFO": 8,
            "TotalJudged": 129
        },
        "total_judged": 129,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-08T05:12:12.836577"
    },
    {
        "id": "1kh0uod",
        "title": "AITA telling my BIL to stop treating my husband like a child",
        "url": "/r/AmItheAsshole/comments/1kh0uod/aita_telling_my_bil_to_stop_treating_my_husband/",
        "body_summary": "OP confronted her BIL, Ken, about his condescending treatment of her husband. Ken belittles the husband constantly. OP felt her husband wasn't standing up for himself and confronted Ken, causing a scene. AITA for intervening?\n...",
        "reddit_judgments": {
            "YTA": 26,
            "NTA": 73,
            "ESH": 17,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 119
        },
        "total_judged": 119,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-08T05:12:14.486162"
    },
    {
        "id": "1kgz03i",
        "title": "AITA for calling the cops on my sisters boyfriend?",
        "url": "/r/AmItheAsshole/comments/1kgz03i/aita_for_calling_the_cops_on_my_sisters_boyfriend/",
        "body_summary": "OP found their apartment door unlocked. Sister's BF was banging on the door, scaring OP who called the police. BF yelled at OP. Sister is mad OP called the cops. AITA for wanting an apology & feeling safe?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 77,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 80
        },
        "total_judged": 80,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-08T05:12:16.493236"
    },
    {
        "id": "1kh81fx",
        "title": "AITA for asking my wife to do her therapy homework during the time I am working and our child is at school?",
        "url": "/r/AmItheAsshole/comments/1kh81fx/aita_for_asking_my_wife_to_do_her_therapy/",
        "body_summary": "OP's wife is on leave for mental health. He feels she isn't actively working on recovery and is frustrated she wants time to herself *after* work/school. He suggested afternoons instead. She got angry. AITA for suggesting a different time?\n...",
        "reddit_judgments": {
            "YTA": 91,
            "NTA": 9,
            "ESH": 3,
            "NAH": 1,
            "INFO": 8,
            "TotalJudged": 112
        },
        "total_judged": 112,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-05-08T05:12:20.005806"
    },
    {
        "id": "1kh18vv",
        "title": "AITA for passing someone in checkout line after they left the line to get more items?",
        "url": "/r/AmItheAsshole/comments/1kh18vv/aita_for_passing_someone_in_checkout_line_after/",
        "body_summary": "OP cut in front of someone at self-checkout who left the line to get more items. The person was annoyed. OP thinks it's rude to leave a line and believes they were justified. AITA?\n...",
        "reddit_judgments": {
            "YTA": 23,
            "NTA": 55,
            "ESH": 3,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 86
        },
        "total_judged": 86,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-08T05:12:21.989068"
    },
    {
        "id": "1khdfe1",
        "title": "AITA for not waiting for my sister before helping my niece with her first period?",
        "url": "/r/AmItheAsshole/comments/1khdfe1/aita_for_not_waiting_for_my_sister_before_helping/",
        "body_summary": "OP's niece (11) started her period while OP was babysitting. OP called his sister, who didn't answer, then called his girlfriend for help. Sister is angry OP didn't wait for her call back. AITA for involving his girlfriend instead of persistently calling the sister?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 63,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-05-08T05:12:23.323539"
    }
]