[
    {
        "id": "1lq038o",
        "title": "AITA for not letting my niece sew me a dress for a big career moment because she doesn’t do a good job?",
        "url": "/r/AmItheAsshole/comments/1lq038o/aita_for_not_letting_my_niece_sew_me_a_dress_for/",
        "body_summary": "OP doesn't want niece to make her an outfit for a career event due to quality concerns. SIL accuses OP of being superficial for refusing & prioritizing career over her daughter's feelings. AITA for prioritizing career?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 152,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 154
        },
        "total_judged": 154,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-03T05:15:31.858643"
    },
    {
        "id": "1lq2jqe",
        "title": "AITA for telling a lady to put her dog back in the carrier on the airplane.",
        "url": "/r/AmItheAsshole/comments/1lq2jqe/aita_for_telling_a_lady_to_put_her_dog_back_in/",
        "body_summary": "I (35M) had to fly to LA this morning on Delta and I had an aisle seat.  It was a smaller plane with 2 seats per side. No TV or Movies on this flight and I wasn't paying for WIFI, so just me and my music.  Ten minutes into the flight, the lady (40's)  across the aisle was moving around and trying to get in her personal item.  \n\nShe busts out a dog.  In my head, i'm like What the Fuck.  I'm not dog friendly so I tell the lady firmly, you better put the dog back in the carrier.   She says its cramped in the carrier, and the dog would rather be in her lap. I tell her to put it away or this can be a bigger scene for you.  She reluctantly put it away.  The rest of the flight she would baby talk the dog and call me the asshole. I complained to the flight attendants after the flight.   AITA?  ",
        "reddit_judgments": {
            "YTA": 67,
            "NTA": 68,
            "ESH": 29,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 167
        },
        "total_judged": 167,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-03T05:15:40.973818"
    },
    {
        "id": "1lpnd1g",
        "title": "AITA for calling my dad by his legal name when he refuses to call me by my preferred name?",
        "url": "/r/AmItheAsshole/comments/1lpnd1g/aita_for_calling_my_dad_by_his_legal_name_when_he/",
        "body_summary": "16f OP prefers \"Ana,\" not \"Anastasia,\" her legal name. Dad (46m) insists on Anastasia, even to upset her. OP called him \"George\" (his legal name) in retaliation. Dad is angry. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 80,
            "ESH": 5,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 90
        },
        "total_judged": 90,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-03T05:15:42.933084"
    },
    {
        "id": "1lpnf68",
        "title": "AITA for telling my husband no?",
        "url": "/r/AmItheAsshole/comments/1lpnf68/aita_for_telling_my_husband_no/",
        "body_summary": "OP, a CNA, came home to find her husband's pregnant, underage sister Chelsea, who was kicked out by their parents. Husband Michael wants to raise the baby. OP refused, citing they can't afford it & OP doesn't want kids. OP agreed to let Chelsea stay temporarily. AITA for not wanting to raise the baby?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 40,
            "ESH": 0,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 46
        },
        "total_judged": 46,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-03T05:15:44.414018"
    },
    {
        "id": "1lq5ts6",
        "title": "AITA for refusing to share my space with my cousin and her kids and planning to leave while they’re staying with us?",
        "url": "/r/AmItheAsshole/comments/1lq5ts6/aita_for_refusing_to_share_my_space_with_my/",
        "body_summary": "OP (29F) co-owns a house. Her mom unilaterally decided distant cousins with kids will stay in OP's basement living space for the summer. OP protested due to privacy and work schedule, especially during a planned solo house stint. OP is upset and considering a hotel to escape. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 76,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-03T05:15:46.475617"
    },
    {
        "id": "1lpstw0",
        "title": "AITA, Am i the asshole for threatening to leave my moms house.",
        "url": "/r/AmItheAsshole/comments/1lpstw0/aita_am_i_the_asshole_for_threatening_to_leave_my/",
        "body_summary": "OP (17M) and his older brother were told they'd be charged rent. OP, in front of family, said he'd move to his dad's (who's against rent) if forced to pay. An aunt cursed him out. AITA for suggesting he'd move to avoid rent?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 67,
            "ESH": 1,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-03T05:15:48.205230"
    },
    {
        "id": "1lqcz3o",
        "title": "AITA for supporting my wife and her decisions during the pregnancy?",
        "url": "/r/AmItheAsshole/comments/1lqcz3o/aita_for_supporting_my_wife_and_her_decisions/",
        "body_summary": "OP's pregnant wife wants to continue her aerial sports, which her doctor approves. OP supports her decision. OP's mom disagrees and blames him for potential miscarriage. AITA for supporting his wife's choice?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 137,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 141
        },
        "total_judged": 141,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-03T05:15:50.961684"
    },
    {
        "id": "1lq5gnw",
        "title": "AITA for leaving before my mom’s birthday after my brother’s ugly comment at my husband?",
        "url": "/r/AmItheAsshole/comments/1lq5gnw/aita_for_leaving_before_my_moms_birthday_after_my/",
        "body_summary": "OP's family dislikes her husband, James, due to his chronic illness and perceived lack of \"manliness.\" After a break, the family seemed improved, but OP's brother insulted James regarding lawn mowing and children. OP left, causing a fight with her mother who feels OP overreacted and stifles their honesty. AITA for expecting them to not say bad things about James?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 102,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 105
        },
        "total_judged": 105,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-03T05:15:52.853666"
    },
    {
        "id": "1lq85cx",
        "title": "AITA for being angry that my child’s step mom allowed him to have a drink of an alcoholic beverage?",
        "url": "/r/AmItheAsshole/comments/1lq85cx/aita_for_being_angry_that_my_childs_step_mom/",
        "body_summary": "OP is angry because her son's stepmom allowed him a sip of alcohol despite the father's alcoholism and OP's education on its dangers. The dad recently left rehab. OP feels betrayed and questions stepmom's judgment. AITA?\n...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 106,
            "ESH": 1,
            "NAH": 9,
            "INFO": 3,
            "TotalJudged": 124
        },
        "total_judged": 124,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-03T05:15:56.040264"
    },
    {
        "id": "1lpqfji",
        "title": "AITA For Forcing My Roommate To Let Me Buy Out Our Kitchen Table",
        "url": "/r/AmItheAsshole/comments/1lpqfji/aita_for_forcing_my_roommate_to_let_me_buy_out/",
        "body_summary": "Bob wants to take a table OP loves after saying he wouldn't. OP blocked Bob from subletting, forcing him to pay the remaining $3k in rent unless he leaves the table. OP bought the table. AITA for using the lease as leverage?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 11,
            "ESH": 2,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-03T05:15:57.321344"
    }
]