[
    {
        "id": "1p166an",
        "title": "AITA for putting on a \"Do Not Disturb\" Sign at my Door?",
        "url": "/r/AmItheAsshole/comments/1p166an/aita_for_putting_on_a_do_not_disturb_sign_at_my/",
        "body_summary": "I (25F) work at home for five years and had been supporting my family with my dream job. I pay all the bills consistently and even buy groceries once in a while. I live with my my mom (59F) who's a housewife all her life, and my brother (44M) and SIL who both don't have jobs but does labor work in the house.\n\nMy job pays well while I'm at home, and I genuinely like and thrive working in a peaceful setting where I'm not interrupted for eight hours a day, so I confined myself inside my room, which also serves as an office.\n\nMy mother is aware that I dislike being bothered, but occasionally she just barges into my room to talk, gossip, do chores, etc., which is really quite distracting and makes it easy for me to lose focus. (I think I got ADHD, but I'm yet to be diagnosed.)\n\nI've recently go...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 142,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-20T05:11:51.954655"
    },
    {
        "id": "1p1gw5a",
        "title": "AITA for telling my son he basically caused his own breakup?",
        "url": "/r/AmItheAsshole/comments/1p1gw5a/aita_for_telling_my_son_he_basically_caused_his/",
        "body_summary": "My son never once went to see his long-distance lover, who came to visit him nearly every month.  He refused to try despite my constant encouragement, in part because my wife insisted that she was afraid of his flying.  Eventually, the relationship ended, and the girlfriend is now seeing someone else.\n\nI explained to my kid that I knew why she had left and that he was to blame for it because he had made no attempt to maintain the connection.  He and my wife are now furious with me.\n\nAITA for expressing it?  I continue to believe that it was true.",
        "reddit_judgments": {
            "YTA": 22,
            "NTA": 77,
            "ESH": 14,
            "NAH": 1,
            "INFO": 12,
            "TotalJudged": 126
        },
        "total_judged": 126,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-20T05:11:53.241776"
    },
    {
        "id": "1p1lpnx",
        "title": "AITA for refusing to share the hotel",
        "url": "/r/AmItheAsshole/comments/1p1lpnx/aita_for_refusing_to_share_the_hotel/",
        "body_summary": "I’m (Research Engineer) attending a conference soon, and my employer is covering my hotel expenses. I booked a hotel room for myself and made sure to choose a nicer one by picking a budget-friendly flight and saving money elsewhere.\n\nThere’s another colleague (Staff Research Scientist) who’s also going to the conference, but his trip isn’t funded by our employer. He mentioned that he’s on a budget and kind of hinted that he’d like to share my hotel room, even offering to pay the extra cost for the additional bed. However, he earns significantly more than I do, and I feel uncomfortable sharing the room, even if he’s willing to pay.\n\nAdditionally, he didn’t directly ask me if he could share the room; he just brought it up as a general idea. Moreover, we’re co-authors on a paper for the confe...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 93,
            "ESH": 0,
            "NAH": 15,
            "INFO": 1,
            "TotalJudged": 109
        },
        "total_judged": 109,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-20T05:12:09.830444"
    },
    {
        "id": "1p1irn3",
        "title": "AITA for not joining my coworker for lunch?",
        "url": "/r/AmItheAsshole/comments/1p1irn3/aita_for_not_joining_my_coworker_for_lunch/",
        "body_summary": "My coworker and I work servicing machines throughout the county, so we carpool in a work van. I bring my lunch everyday in my lunch pail. He eats out everyday, and everyday he tries to pressure me to join him inside the restaurants he’s eating in. There’s no way I’m taking food from home into an establishment and eating without purchasing anything. He says I’m being a jerk for having him eat alone. AITA? ",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 48,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-20T05:12:10.395722"
    },
    {
        "id": "1p1jfsf",
        "title": "AITA for refusing to cover for my coworker during her “mental health breaks” even though I know she’s struggling?",
        "url": "/r/AmItheAsshole/comments/1p1jfsf/aita_for_refusing_to_cover_for_my_coworker_during/",
        "body_summary": "I (25F) work as a case coordinator at a community clinic. It’s a demanding job, and our small team is constantly stretched thin. One of my coworkers, Lena (29F), has been going through a rough time. She lost a parent earlier this year, and her workload has understandably been harder for her to manage.\n\nAt first, I volunteered to pick up some of her cases whenever she needed a breather. It wasn’t officially assigned to me I just didn’t want her to drown. But over the past few months, those breaks have changed from occasional moments to daily disappearances.\n\nSome days she’ll step outside for a reset, and I won’t see her again for an hour. Other times she’ll ask me to update her case files because she can’t focus today, I get it. I really do. But I’ve become the default person picking up the...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 93,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 95
        },
        "total_judged": 95,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-20T05:12:26.491690"
    },
    {
        "id": "1p1qio4",
        "title": "AITA For Locking my wife out of the bedroom I sleep in?",
        "url": "/r/AmItheAsshole/comments/1p1qio4/aita_for_locking_my_wife_out_of_the_bedroom_i/",
        "body_summary": "About two weeks ago, my (37M) wife (37F) started snoring out of the blue. Its not really Loud but it wakes me up. And I can’t go back to sleep if it wakes me up in the middle of the night. I wasn’t going to ask her to sleeo somewhere else so I just went to another room the night she started.\n\nI guess some time during the night she woke up to use the bathroom or something,  and she went to the guest room and slept in the bed I was sleeping in since i wasnt in our room. Where she began to snore again. \n\nI told her that she was starting to snore, and she just shrugged it off.  She only booked just booked an appointment a few days back. Ive continued to sleep in the guesy room, and Ive started to lock the door since my wife keeps coming in whenever she notices I’m not in the bed even though I’...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 91,
            "ESH": 9,
            "NAH": 4,
            "INFO": 0,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-20T05:12:43.707366"
    },
    {
        "id": "1p1gm2b",
        "title": "AITA for Embarrassing a Man at a Party (and Upsetting my Friend)?",
        "url": "/r/AmItheAsshole/comments/1p1gm2b/aita_for_embarrassing_a_man_at_a_party_and/",
        "body_summary": "Recently, I went to a party with a friend, I’ll call her L, where I didn’t know anyone else but her. Usually, that would be an absolute no for me but she really likes a guy (let’s call him J) who was going so after some begging, I agreed.\n\nWhile she was talking to the guy she likes, a man started a to talk to me. It turns out, this was the host of the party and a close friend of J but I didn’t know this at the time. He asked what I do for a living and I said that I have an art business. \n\nWithout asking any follow-up questions, he immediately started talking about how if “I’m not harnessing the power of social media” my business is doomed to fail. The thing is, I get all my business through social media and have almost 300k followers across different apps. \n\nI tried to explain that I do us...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 72,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 75
        },
        "total_judged": 75,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-20T05:12:59.513053"
    },
    {
        "id": "1p13itn",
        "title": "AITA for smoking in the smoking section of a casino?",
        "url": "/r/AmItheAsshole/comments/1p13itn/aita_for_smoking_in_the_smoking_section_of_a/",
        "body_summary": "I was sitting at a slot machine in the smoking section, this lady came by a little while after and sat down next to me, she automatically started waving her hands like she was trying to push the smoke away from her, I ignored her and kept playing, eventually she turned to me and asked me to put my cigarette out, I told her that I was here before her and even if I wasn’t, she chose to sit in the smoking section, she got all huffy and puffy and called me a bitch, I ignored her and went back to playing.\n\nWas I the asshole?",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 51,
            "ESH": 2,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 57
        },
        "total_judged": 57,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-20T05:13:00.135841"
    },
    {
        "id": "1p1tc7h",
        "title": "AITA for quietly paying for a stranger’s groceries after overhearing her phone call about her husband losing his job, even though my own girlfriend thinks it was weird and “performative”?",
        "url": "/r/AmItheAsshole/comments/1p1tc7h/aita_for_quietly_paying_for_a_strangers_groceries/",
        "body_summary": "I’m 29M, my girlfriend “Sarah” is 27F, and we’ve been together 3 years now, I make decent money in tech and we live comfortably, but I’m not flashy about it at all, Sarah knows I like doing small random acts of kindness when I can, like covering coffee for the person behind me or tipping servers extra on bad days. She usually teases me about being a “boy scout” but never made a big deal until now.\n\nLast week I was at the grocery store on a Saturday morning doing our weekly shop. There’s this woman ahead of me in line, maybe early 40s, with a full cart but she’s on the phone looking stressed. I wasn’t trying to eavesdrop but the store was quiet and she was talking kind of loud basically telling someone (sounded like a friend of some\n\nSort ) that her husband got laid off Friday, they have tw...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 136,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 137
        },
        "total_judged": 137,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-20T05:13:16.760460"
    },
    {
        "id": "1p1f46c",
        "title": "AITAH if I tell my parent that they need to give me a timeframe for them to move out of my house",
        "url": "/r/AmItheAsshole/comments/1p1f46c/aitah_if_i_tell_my_parent_that_they_need_to_give/",
        "body_summary": "Hey guys, \n\nLooking for some input here. \n\nMy mother moved into a guest room nearly two years ago after a divorce led to her losing her housing. \n\nThe intention was for her to stay with me while she receives the necessary surgeries to try to get back into the workforce, so initially, the deal was presented to me as her staying with me for \n\"a couple of years\" until she finds a housing accomodation\". \n\nAfter her surgeries, she is still disabled and is still not able to work and has not made any efforts to find new housing. They receive around $2k a month in benefits and there's a potential they could apply for vouchers, but they seem unwilling to move to a less desirable area and have dogs that would probably need a fenced in yard. \n\nAm I the asshole for telling her that I would like her to...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 28,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 33
        },
        "total_judged": 33,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-20T05:13:32.745324"
    }
]