[
    {
        "id": "1qbmwbm",
        "title": "AITA for not giving my parents the master bedroom in my house?",
        "url": "/r/AmItheAsshole/comments/1qbmwbm/aita_for_not_giving_my_parents_the_master_bedroom/",
        "body_summary": "Hi all, first time posting!\n\nMy parents and younger brother are about to move into my house (4 bedrooms 3 bathrooms)and I’m having a bit of a dilemma!\n\nI offered for my family to move in with us whilst their house is getting built after the sale of their current home. We live in a rental crisis and when a rental is secured it can be really expensive. I’m super close with my parents and without thinking, of course I offered them to live with me for the 1.5 yrs it’ll take to build. Currently living in my home is myself, my husband and our newborn baby. My husband is only home one week of the month as he works away. It was loosely agreed that my parents and brother would take the back two rooms which have a bathroom (walk in shower and bath) and toilet beyween the rooms and set up their sofa ...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 141,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 146
        },
        "total_judged": 146,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-14T05:16:50.992195"
    },
    {
        "id": "1qborsx",
        "title": "AITA for forcing my injured friend to smoke in the bathroom?",
        "url": "/r/AmItheAsshole/comments/1qborsx/aita_for_forcing_my_injured_friend_to_smoke_in/",
        "body_summary": "Throwaway, because my friends know my main.\n\nI(31F) don’t smoke, but most of my friends do, for as long as I’ve known them. However, I can’t stand the smell of smoke. I have never stopped anyone from smoking in my presence, and with my really close friends who know this about me and know that I don’t mean any ill-will, I usually step away till they finish smoking. \n\nThe only place I do control this is my home, because I’m afraid the smell will seep into the cloth and bedding of the sofa/bed/curtains (I’ve seen it happen during college accommodation). Sheets can be washed, sure, but the bedding and cotton is more difficult to clean. In case we (my husband and I) are hosting anyone, we encourage them to smoke in the bathroom, where the exhaust fan should take care of any lingering smell. (Un...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 165,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 168
        },
        "total_judged": 168,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-14T05:17:08.104262"
    },
    {
        "id": "1qbrxbn",
        "title": "AITAH for filing a report against my mom for stealing my identity?",
        "url": "/r/AmItheAsshole/comments/1qbrxbn/aitah_for_filing_a_report_against_my_mom_for/",
        "body_summary": "Mom (52) me F22 \n\nFor context, my mom has serious mental illness + executive dysfunction and struggles to take care of herself, she hasn’t had a job longer than a few months at a time, and mostly relies on welfare/freelance and delivery gigs to get by. Since I was 11 she has moved nearly every year due to eviction or financial issues with landlords. \n\nShe had come into almost 100k in 2021, and by 2024 it was completely spent on shopping, cosmetic surgeries, eating out etc. She has spent most of her life struggling with debt, and growing up my dad kept my social security number frozen to keep her from trying to use it.\nIn the past she had overdrawn my credit card and my bank account for gas in her car, plus random spending on things she wanted.\n\nIn 2024 my mom had no choice but to move back...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 41,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 43
        },
        "total_judged": 43,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-14T05:17:23.941176"
    },
    {
        "id": "1qbmy2h",
        "title": "AITA for refusing to cancel our family vacation because of my nephew’s 1st birthday?",
        "url": "/r/AmItheAsshole/comments/1qbmy2h/aita_for_refusing_to_cancel_our_family_vacation/",
        "body_summary": "I (M36) planned a vacation with my wife (W35) and our two kids, ages 2 and 4. The vacation was meant to be a much-needed break for just the four of us. However, today my wife suddenly realized that the 1st birthday of her sister's son falls right in the middle of our trip. She now insists on canceling the vacation to attend the party.\n\nI’m confused because our kids, especially our daughter (who is highly sensitive), really love these family vacations and enjoy the time we spend alone as a family. I don’t see why we need to cancel the whole vacation just for a birthday, especially when we could visit them just two days after the birthday.\n\nAm I the asshole for not wanting to cancel the vacation for this?",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 65,
            "ESH": 0,
            "NAH": 5,
            "INFO": 3,
            "TotalJudged": 75
        },
        "total_judged": 75,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-14T05:17:24.726324"
    },
    {
        "id": "1qby51m",
        "title": "AITA for shutting down gossips in the middle of the office",
        "url": "/r/AmItheAsshole/comments/1qby51m/aita_for_shutting_down_gossips_in_the_middle_of/",
        "body_summary": "So, I (35M) have been working for the same company for the last 14 years slowly working my way up the ladder. \n\nDuring that time I became extremely close friends with a colleague (32F). We have worked together for over 10 years. We both moved city for our job in our 20s. I lived with her whilst in between places and she has always helped me with my disastrous love life. \n\nWe are so close that I was HER Best Man at her wedding and am godfather to her children. I also have a really good relationship with her husband, often going out with him to the football and drinks.\n\nWe have always accepted that there would be gossip about us. But we know our relationship is like that of siblings.\n\nUnfortunately, it’s recently become public knowledge that her marriage is ending due to an affair! (Don’t ev...",
        "reddit_judgments": {
            "YTA": 35,
            "NTA": 18,
            "ESH": 9,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-14T05:17:40.910832"
    },
    {
        "id": "1qbqlay",
        "title": "AITA for still telling my dad he has to move out after he tried to guilt me into letting him stay?",
        "url": "/r/AmItheAsshole/comments/1qbqlay/aita_for_still_telling_my_dad_he_has_to_move_out/",
        "body_summary": "I’m 27 and live with my grandmother (66). I work from home as a nail technician, so clients come onto the property all the time.\n\nAbout five years ago, my dad and his partner moved into a converted garage at the back of our place. There was never any rent agreement. They’ve lived here rent-free the whole time, and my gran and I have been paying for everything. They don’t really help financially.\n\nOver the years it’s just piled up. When their dogs got sick, I was always the one who had to make a plan to get them to the vet, and every time it cost over R3,000 (about $160–$170), which here is basically close to a month’s groceries. One time they said they’d pay it back, but we only got a small amount once (around R700–R800 / $35–$40) and then nothing again.\n\nElectricity has gone up a lot, so ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 27,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-14T05:17:56.549485"
    },
    {
        "id": "1qbqro4",
        "title": "AITA for telling my friend that my mother doesn't want her to stay at our house?",
        "url": "/r/AmItheAsshole/comments/1qbqro4/aita_for_telling_my_friend_that_my_mother_doesnt/",
        "body_summary": "A few years ago, my family and I moved to another country, and while I am studying, I live with them. I have a friend who lives in another country, so we rarely see each other. Last year, we were going to meet up; she was supposed to come for Christmas and stay at our house for a week. We planned this meeting for several months and everything was decided, but a week before her arrival, I had a quarrel with my mother over some trivial household matter (something like whose turn it was to walk the dog), and she said she would not accept my friend in our home.\n\nI knew she said it in the heat of the moment and wouldn't really leave her without a place to stay, but I still wrote to my friend that my mother had changed her mind and didn't want to host her. (My friend had other options for where ...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 26,
            "ESH": 3,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 39
        },
        "total_judged": 39,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-14T05:18:12.242443"
    },
    {
        "id": "1qbjtmh",
        "title": "WIBTA if I called my bully cousin out in a family group chat that includes her in laws?",
        "url": "/r/AmItheAsshole/comments/1qbjtmh/wibta_if_i_called_my_bully_cousin_out_in_a_family/",
        "body_summary": "I (40M) finally have come to the realization that my cousin (39f) has been bullying me my whole life. We live in different countries, so we only see each other every few years and the majority of the time it is during a wedding a larger family hangout, so she and I aren’t spending that much meaningful one on one time together.\n\nThis past Christmas she visited with her husband and two kids and stayed at my house with my wife and two kids for 10 days. She pretty much spent the entire time getting her digs in, pushing buttons, and trying to get a reaction from my wife and I (attacking my wife’s cooking skills, attacking our lack of friends, and attacking our parenting styles). I say she has bullied me my whole life because she visited when I was 28 years old and it was basically the same, but...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 3,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 5
        },
        "total_judged": 5,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-01-14T05:18:28.277268"
    },
    {
        "id": "1qbp82b",
        "title": "AITA for being annoyed that my housemates woke me up to cut a birthday cake even though I’ve said I don’t celebrate my birthday or eat cake?",
        "url": "/r/AmItheAsshole/comments/1qbp82b/aita_for_being_annoyed_that_my_housemates_woke_me/",
        "body_summary": "I don’t like celebrating my birthday. I just don’t enjoy the attention or the rituals around it. I’ve been very clear about this over the years. I don’t tell people my birthday, I don’t celebrate it, and I don’t eat cake or sweets in general. I might have a piece of chocolate very rarely. When my housemates have birthdays, I usually politely decline cake or sweets. They’re aware of this. \n\nOver the past week, I’ve been working late-night shifts and was feeling pretty tired, so I’ve been sleeping during my day off to recover. Recently, my housemates woke me up to cut a cake for my birthday. I was irritated for several reasons:\n\n- I’ve explicitly said I don’t celebrate my birthday\n- I don’t eat cake\n- I was woken up without warning\n- It wasn’t even my actual birthday\n- They were filming the ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 27,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-14T05:18:43.936530"
    },
    {
        "id": "1qblsvm",
        "title": "AITA for thinking my sister overreacted by moving and labeling all her things?",
        "url": "/r/AmItheAsshole/comments/1qblsvm/aita_for_thinking_my_sister_overreacted_by_moving/",
        "body_summary": "My sister (25F) and I (23F) moved into an apartment together in 2023. My boyfriend (23M) moved in with us in August. Before he moved in, my sister and I had lengthy conversations (mostly over text because we work opposite schedules. I work 3–11 PM, she works 7–4 PM) and she was okay with it as long as we split everything three ways. Since most of the apartment furniture and items belong to her (she’s lived here since 2022), I agreed.\n\nRecently, I sent her a message asking her to pick up toilet paper. I assumed taking turns buying it was fine without messaging, like we’ve done before, but she got annoyed because she expected costs split three ways and communicated in the group chat. We agreed she would buy it this time and purchases should be messaged in our group chat after she purchased t...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 3,
            "ESH": 5,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 14
        },
        "total_judged": 14,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2026-01-14T05:18:59.642897"
    }
]