[
    {
        "id": "1rha4mx",
        "title": "AITA for telling my roommate's mother that my roommate's boyfriend has wronged me and wont stop coming around after i told him not to?",
        "url": "/r/AmItheAsshole/comments/1rha4mx/aita_for_telling_my_roommates_mother_that_my/",
        "body_summary": "I work crazy shifts as a nurse so I meal prep every Sunday for the whole week because I barely have time. It’s not fancy stuffs just  chicken, rice, veggies, portioned out in containers in the fridge.  \n roommate has been dating this guy (let’s call him Mike) for about 3 months. He started coming over a lot. At first it was fine. Then he started staying 3 to 5 nights a week. Still okay.  \nBut two weeks ago I came home exhausted after shift and opened the fridge to find all my containers empty. Mike had eaten my whole week’s food while my roommate was at work. He didn’t even ask. Just saw it got hungry and finished it.  \nI was furious and texted my roommate to report this to her. She said sorry and that Mike felt bad. I told her it’s not about feeling bad it’s about not touching other peopl...",
        "reddit_judgments": {
            "YTA": 18,
            "NTA": 99,
            "ESH": 6,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 127
        },
        "total_judged": 127,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-03-01T05:44:10.238564"
    },
    {
        "id": "1rh1abd",
        "title": "AITA for wanting my bed to be a colour I want even if it doesn't match my room?",
        "url": "/r/AmItheAsshole/comments/1rh1abd/aita_for_wanting_my_bed_to_be_a_colour_i_want/",
        "body_summary": "I 19f share a bedroom with my sister 14f. She recently got a new bed so our mother took us shopping to buy new bed sheets. I bought some green ones with plants on, my sister chose purple. Her favourite colour is purple and she got her way when we had the room decorated years ago. Purple walls, purple curtains. Well I wanted to buy a green Valance sheet to match my duvet cover, my mother told me no because it wouldn't match the room. She wanted me to get purple or pink. I said no, that I didn't like purple and that it was bad enough sharing a bedroom that I can't decorate to my choosing but I wanted my bed to be my colour. She insisted on pink valance sheets for me and my sister so I told her fine, I would buy the green one myself. She then called me a cow ect and said that I ruined everyth...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 75,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-03-01T05:44:18.569586"
    },
    {
        "id": "1rhdyd9",
        "title": "AITA for body shaming someone after they body shamed me",
        "url": "/r/AmItheAsshole/comments/1rhdyd9/aita_for_body_shaming_someone_after_they_body/",
        "body_summary": "Throwaway account for obvious reasons.\n\nI (22F) recently started modeling on the side in this new year. Throughout my childhood, I have always been on the smaller side, being quite thin and having a hard time developing a relationship with food. It wasn't until uni where I finally ate full meals and pulled myself out of destructive habits.\n\nRecently, I went to a friends house where three girls I will call Emma, Payton, and Kat (all 24F) were present. I used to be friends with them but we grew a part several years ago. At one point, I went to the restroom and came back to Emma, Payton, and Kat saying I was \"too big\" to start a modeling career. While Payton and Kat noticed I had come back and quit talking, Emma continued, saying that my waist wasn't small enough, I needed to be realistic, I ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 61,
            "ESH": 19,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 84
        },
        "total_judged": 84,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-03-01T05:44:27.871027"
    },
    {
        "id": "1rhgy1x",
        "title": "AITA? MIL mad about bday plans",
        "url": "/r/AmItheAsshole/comments/1rhgy1x/aita_mil_mad_about_bday_plans/",
        "body_summary": "My hubby and my mother have birthdays just a few days apart, hubs suggested having them over for dinner to celebrate her birthday and his at the same time. GREAT! Invited my parents and all was good. Later in his mother asked what our plans are for his birthday, I let her know. Right off the bat I could tell she was either annoyed, or mad (maybe both). I asked if she had other plans and she said something along the lines of “you’re his wife it’s your responsibility now” (for context this is his first birthday since we got married). She is now pissed that “plans were made without them” \n\nI told hubs to talk to his mom and I’m done with her passive aggressive hissy fits (this is not the first, many were done, even about our wedding). He has not told me of any plans made with them, and I aske...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 22,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-03-01T05:44:36.247497"
    },
    {
        "id": "1rhkxlb",
        "title": "AITA for asking my boyfriend to put my sunglasses back in the car?",
        "url": "/r/AmItheAsshole/comments/1rhkxlb/aita_for_asking_my_boyfriend_to_put_my_sunglasses/",
        "body_summary": "Today, my boyfriend (32M) and I (32F) went out running errands with our kids. We were using my car, and he was driving. We were mainly going to pick up orders for him at specialized stores.\n\nHe has chronic migraines and isn’t sure what triggers them, but glare from the sun reflecting off wet pavement can be one trigger. While he was driving, I offered him my sunglasses so he wouldn’t get a migraine.\n\nWhen we got home and came inside, I noticed my sunglasses sticking out of his jacket pocket. I pointed it out and asked him to put them back in the car. He replied that he would just put them on the entryway table and that I could put them back in the car myself next time I went out. He said he had just driven for two hours and wasn’t going to go back outside just for that. I told him I wanted...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 21,
            "ESH": 6,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-03-01T05:44:44.205561"
    },
    {
        "id": "1rhfowx",
        "title": "AITA for taking the car to a mechanic to get fixed?",
        "url": "/r/AmItheAsshole/comments/1rhfowx/aita_for_taking_the_car_to_a_mechanic_to_get_fixed/",
        "body_summary": "My car was making a screeching sound. It was making me feel uncomfortable about driving home which would have been 1 hour and 45 mins. I found a mechanic near by and they said it was the rear break pads. Everything ended up costing $900. My wife yelled at me because I’m “getting stuff done without asking or thinking critically”. She said if it was her she would have driven home and researched more about it. Am I the asshole? I didn’t feel safe driving home.",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 41,
            "ESH": 2,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 64
        },
        "total_judged": 64,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-03-01T05:44:45.191644"
    },
    {
        "id": "1rhgp6l",
        "title": "AITA for “treating my dad like a driver” after he picked me up from my entrance exam?",
        "url": "/r/AmItheAsshole/comments/1rhgp6l/aita_for_treating_my_dad_like_a_driver_after_he/",
        "body_summary": "So me (17F) and my friend have been preparing for a really important college entrance exam for the past 2 years. It was a huge deal for both of us. We got the same exam center, which was about 1.5 hours away from home, and my dad volunteered to drop and pick us up.\n\nFor context: my dad usually doesn’t like the passenger seat (next to the driver) being empty when he drives. He thinks it’s disrespectful if someone sits in the back while he’s driving alone in front. But that day, I was just really happy that the exam was finally over. When he told me to sit in the front, I asked if I could sit in the back with my friend just for that day and he said yes.\n\nOn the way back, my friend and I were talking, laughing, making reels, just being excited that it was finally done. I’ll admit we weren’t e...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 39,
            "ESH": 8,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-03-01T05:44:53.145888"
    },
    {
        "id": "1rhiuck",
        "title": "AITA for telling my mom it's ok to go shopping with my friends family?",
        "url": "/r/AmItheAsshole/comments/1rhiuck/aita_for_telling_my_mom_its_ok_to_go_shopping/",
        "body_summary": "Background context: I am 15(M) and met my friend 16(M) through my coding class at school. We had been friends for about 1 semester, game together on call when we have time, and I would say we have great chemistry together. I have started a food business for some money on the side to spend, since I don't get allowance. My family used to shop at Costco but since we only went a couple times back then, eventually they cancelled their membership and we stopped shopping at Costco. Now, lets go back a couple weeks ago, when my friend mentioned he had a Costco card and was going to shop w/ his family. I had met his dad once before and he seemed chill enough. So I asked him if I could tag along, if it was ok of course. He asked his parents and they were pretty chill about it, so I went shopping wit...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 10,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 11
        },
        "total_judged": 11,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-03-01T05:45:00.738148"
    },
    {
        "id": "1rhktzf",
        "title": "AITA for buying hair clips despite my mom saying no?",
        "url": "/r/AmItheAsshole/comments/1rhktzf/aita_for_buying_hair_clips_despite_my_mom_saying/",
        "body_summary": "Literally the title. I (18F) don’t even know why this is an issue. I have been growing out my hair and trying cute hairstyles to experiment with my look, and wanted these cute hairclips from amazon to put in my hair. Nothing crazy, just a $5 set of tiny fingerpad-sized claw clips to clip my bangs and etc. I was going to buy them with gift money my grandma gave me for Chinese New Year, but my parents have amazon prime and get angry if I order things without consulting them and allowing them to question me about non-harmful things such as a refill of my face moisturizer.\n\nI have had such a stressful week and honestly just wanted to treat myself to something nice, so I go to ask my mom for the clips. Right off the bat she starts screaming at me about how I “already have so many hair accessori...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 15
        },
        "total_judged": 15,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-03-01T05:45:08.458232"
    },
    {
        "id": "1rh6t1b",
        "title": "AITA for being annoyed that chores are not done correctly",
        "url": "/r/AmItheAsshole/comments/1rh6t1b/aita_for_being_annoyed_that_chores_are_not_done/",
        "body_summary": "Edited for more information: My wife has ADHD and is also overwhelmed from her job which others pointed out in this post is something to consider\n\nHello all!\n\nMy wife (30) and I (38) have been married for a few years. We split chores and both of us are happy with the split. However, we recently moved into a much bigger house and both of us had to take on more chores, but I am growing more and more annoyed by the day by the poor nature my wife does her chores. Instead of putting dirty dishes in the dishwasher, she leaves them in the sink for me to put in the dishwasher, when she does laundry, she overloads the washing machine causing it to break, or adds too much soap forcing me to redo the entire load. If she does load the dishwasher, she does it in a way that will jam the machine (blockin...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 39,
            "ESH": 3,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-03-01T05:45:16.616766"
    }
]