[
    {
        "id": "1k8ax7g",
        "title": "AITA for not letting new neighbours put scaffolding on my drive for 2 weeks",
        "url": "/r/AmItheAsshole/comments/1k8ax7g/aita_for_not_letting_new_neighbours_put/",
        "body_summary": "OP blocked a gate to their drive due to neighbors' uninvited access. Neighbors now need OP's drive for roof work, builder asked after lying about attempts to contact OP. They previously left a note on OP's MIL's car for briefly parking legally outside their house. AITA for refusing access to their drive?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 95,
            "ESH": 6,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 106
        },
        "total_judged": 106,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-27T05:10:26.778323"
    },
    {
        "id": "1k8ldz6",
        "title": "AITA for \"ruining\" my boyfriends family dinner by bringing my own food?",
        "url": "/r/AmItheAsshole/comments/1k8ldz6/aita_for_ruining_my_boyfriends_family_dinner_by/",
        "body_summary": "OP, allergic to gluten, dairy, shellfish, was invited to her BF's family dinner. Despite informing his mom, all dishes contained allergens. OP ate her own safe meal. BF's mom was offended, BF felt embarrassed. AITA for bringing my own food?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 132,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-27T05:10:29.675319"
    },
    {
        "id": "1k8ox5z",
        "title": "AITA for not picking the restaurant my cousin wanted?",
        "url": "/r/AmItheAsshole/comments/1k8ox5z/aita_for_not_picking_the_restaurant_my_cousin/",
        "body_summary": "OP (25f) chose a steakhouse to celebrate her promotion. Cousin Aria (32f), a vegan with allergies, demanded OP change the restaurant, citing cross-contamination concerns and past issues. OP refused, leading to Aria campaigning against her. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 143,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-27T05:10:32.350419"
    },
    {
        "id": "1k8jdxt",
        "title": "AITA for refusing to give my little brother my car after I turned 18",
        "url": "/r/AmItheAsshole/comments/1k8jdxt/aita_for_refusing_to_give_my_little_brother_my/",
        "body_summary": "I just turned 18 and my parents have been pushing me to give my old car to my 16-year-old brother “as a gift.” The thing is, I worked part-time jobs for two years to help pay for that car, it wasn’t fully a gift from them.\nNow that I’m 18, I want to keep it while I save up for something better. My parents say I’m being selfish and that “he needs it more now” since I’m an adult and should start “figuring things out myself.” I feel like they’re trying to guilt-trip me into giving up something I worked hard for. AITA for saying no??\n",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 125,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 128
        },
        "total_judged": 128,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-27T05:10:33.526120"
    },
    {
        "id": "1k8hj8z",
        "title": "AITA for cancelling my visit to my niece’s birthday the day we were due to leave?",
        "url": "/r/AmItheAsshole/comments/1k8hj8z/aita_for_cancelling_my_visit_to_my_nieces/",
        "body_summary": "OP canceled a 4.5-hour drive to his niece's birthday lunch last minute, citing the late lunch time and no day off work making the trip unreasonable. His sister is upset. AITA?\n...",
        "reddit_judgments": {
            "YTA": 33,
            "NTA": 43,
            "ESH": 28,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 106
        },
        "total_judged": 106,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-27T05:10:35.159808"
    },
    {
        "id": "1k8ke1m",
        "title": "AITA for carrying my service dog in a purse?",
        "url": "/r/AmItheAsshole/comments/1k8ke1m/aita_for_carrying_my_service_dog_in_a_purse/",
        "body_summary": "OP (24F, T1D) uses a dog purse for her service dog who is nearing retirement. A woman harassed OP in a store, claiming it wasn't a real SD. The woman then posted about OP online, leading to public harassment. AITA for using the purse, making people think it's not a real service dog?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 51,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-27T05:10:37.763776"
    },
    {
        "id": "1k86xtu",
        "title": "AITA Declining an Invitation After Finding Out the Cost",
        "url": "/r/AmItheAsshole/comments/1k86xtu/aita_declining_an_invitation_after_finding_out/",
        "body_summary": "OP's dad invited him/wife to a baseball game, then asked for $80 afterwards. OP said they'd rather stay home due to the cost and OP's lack of interest. AITA for declining after the invite and payment request?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 30,
            "ESH": 0,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 35
        },
        "total_judged": 35,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-27T05:10:38.721427"
    },
    {
        "id": "1k8a5lp",
        "title": "AITA for objecting to buying expensive painting supplies for my godson?",
        "url": "/r/AmItheAsshole/comments/1k8a5lp/aita_for_objecting_to_buying_expensive_painting/",
        "body_summary": "My(37) husband(38) and I are currently looking after my godson(15) since my best friend and her husband are in rehab. He is very interested in art and requested Raphael brushes with some synthetic squirrel hair/pelt thingy along with Arches paper.\n\nNow it’s easily within our budget, especially considering that the kid doesn’t have any other hobbies. My husband bought the stuff for him but I wasn’t happy and told him not to get any more expensive supplies since he can use cheaper brands and it can teach him the value of money. But my husband said it’s a good thing he’s coping with his situation through art rather than unhealthy means, and that we should encourage him to pursue painting since he really enjoys and is good at it. And he is good. Am I being too cheap?",
        "reddit_judgments": {
            "YTA": 139,
            "NTA": 2,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 143
        },
        "total_judged": 143,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-27T05:10:40.449060"
    },
    {
        "id": "1k8tijm",
        "title": "AITA for not inviting my sister to my wedding after she stole my thunder at my engagement party?",
        "url": "/r/AmItheAsshole/comments/1k8tijm/aita_for_not_inviting_my_sister_to_my_wedding/",
        "body_summary": "OP got engaged, sister Lisa announced *her* engagement at OP's party. OP felt overshadowed and confronted Lisa. Now OP's uninviting Lisa to the wedding to prevent a repeat. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 35,
            "ESH": 4,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-27T05:10:42.040555"
    },
    {
        "id": "1k8ngmq",
        "title": "AITA for upsetting my cousin due to my finances",
        "url": "/r/AmItheAsshole/comments/1k8ngmq/aita_for_upsetting_my_cousin_due_to_my_finances/",
        "body_summary": "OP, a broke college student, can't afford the dress code/gift for cousin Nova's wedding. OP told Nova she couldn't attend. Nova's upset, as are OP's parents who want her to go regardless. AITA for declining due to financial constraints?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 117,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 117
        },
        "total_judged": 117,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-27T05:10:43.687862"
    }
]