[
    {
        "id": "1rgbqbz",
        "title": "AITAH for ‘causing a scene’ at my boyfriends work?",
        "url": "/r/AmItheAsshole/comments/1rgbqbz/aitah_for_causing_a_scene_at_my_boyfriends_work/",
        "body_summary": "So.. I (22F) and my boyfriend (23M) were going for a dinner in a restaurant that he works at as a pastry chef. I ordered a Caesar tortilla, and, after 45 of waiting, recieved a Caesar salad. I said to him that’s not what I have ordered, and he told me to wait, and that he will go to the kitchen and make me a tortilla.\n\nAfter a few minutes, he came back with the plate. It was just the previously made salad stuffed in the tortilla (the crispy breadcrumbs from the salad were inside). I told him that I am not going to eat that, because that is not what I ordered. He told me that that’s basically the same thing and that I should just eat it. But, it’s not the same thing. I especially wanted the tortilla because of the crispy bacon and the cheese that melts inside, but in the salad there are jus...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 154,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 159
        },
        "total_judged": 159,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-28T05:26:08.773782"
    },
    {
        "id": "1rg6l4z",
        "title": "AITA for telling a woman to have her and her kids get off their phone at the movies resulting them either getting kicked out or leaving?",
        "url": "/r/AmItheAsshole/comments/1rg6l4z/aita_for_telling_a_woman_to_have_her_and_her_kids/",
        "body_summary": "I saw a movie last night and during the movie, was distracted by a family two rows in front of me.  mom, a teen son and teen daughter and maybe a 7 year old daughter. \n\nThe first issue was the son was constantly moving seats throughout the movie. At one point he was sitting in front of his family. The mom was on her phone most of the movie, at several points filming the movie. The mom and son were taking turns using their phones and then passing one of the phones to the 7 year old who was playing games. \n\n  \nIt was super distracting so I went up and whispered to the mom to get off their phones. she said, “she’s playing a game. she’s not doing anything wrong.” i said “it’s a movie theater. ya’ll aren’t supposed to be on your phones.” the mom said “you can ask nicer.” I said “or you can be a...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 72,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-28T05:26:17.057579"
    },
    {
        "id": "1rg7veh",
        "title": "AITA for never doing the laundry when my girlfriend needs something washed?",
        "url": "/r/AmItheAsshole/comments/1rg7veh/aita_for_never_doing_the_laundry_when_my/",
        "body_summary": "Throwaway because my gf knows my main.\n\nMe (25M) and my girlfriend (26F) have been together for 3 years and have lived together for 1 year. We split the tasks around the house in such a way that I do all the laundry. I don't mind doing laundry but she has ADHD and hates having to wait for the laundry to be done and then wait for it to dry and would often forget about it and leave it overnight so I do the laundry because I don't mind waiting.\n\nThis morning I mentioned to her that I'll be doing the laundry later today because I have a shirt in the laundry basket I wanna wear tomorrow (the laundry basket is pretty full, I'm not washing just that one shirt). She said, in a passive aggressive voice, \"isn't it interesting how you always do the laundry when you need something washed but never whe...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 136,
            "ESH": 0,
            "NAH": 5,
            "INFO": 2,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-28T05:26:25.951070"
    },
    {
        "id": "1rgnke4",
        "title": "AITA for not warning people that a character in a friend’s book was based on me?",
        "url": "/r/AmItheAsshole/comments/1rgnke4/aita_for_not_warning_people_that_a_character_in_a/",
        "body_summary": "My best friend, “Cass” is an author who has a few books out. There are bits and pieces of me and everyone else she loves in everything she does, but she wrote a character heavily based on me for her most recent book. Personality, appearance, some life events, etc. There is a love interest who is also based heavily on a friend of ours, Riley, in the same way. The characters end up together. We all met in college, fwiw. Riley and I have also never dated, hooked up, or anything like that.\n\nI knew this was happening (we have a tradition where I read her 3rd draft), but Riley is not a huge reader so I never mentioned it to them. Same with my husband. The book came out and I didn’t even think about it because while the character is based on me, it is not me.\n\nWell some time later, we were at ano...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 20,
            "ESH": 2,
            "NAH": 5,
            "INFO": 1,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-28T05:26:34.398572"
    },
    {
        "id": "1rg5vte",
        "title": "AITAH for thinking you shouldn’t be billed after a dinner party invite?",
        "url": "/r/AmItheAsshole/comments/1rg5vte/aitah_for_thinking_you_shouldnt_be_billed_after_a/",
        "body_summary": "My (35F) best friend (34F) and her roommate (35F) hosted a small Christmas dinner (about six of us). They cooked a full roast. I have allergies so couldn’t eat everything, but they made sure I had a full meal. I don’t drink, so I brought my own flavoured water and didn’t have any of the alcohol provided. I also brought a bottle of Prosecco as a hostess gift because I know hosting is a lot of work.\n\nA few days later, her roommate texted asking for £7.80 as my “share” of the party costs.\n\nIt’s not a lot of money, so I transferred it straight away. But it didn’t sit right with me. If I’d known in advance we were splitting costs, I would’ve just brought my own food (which I often prefer anyway due to cross-contamination worries and the fact I don’t really like roasts). I only ate what was serv...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 114,
            "ESH": 9,
            "NAH": 7,
            "INFO": 2,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-28T05:26:43.717943"
    },
    {
        "id": "1rgd7za",
        "title": "AITA for not putting gifted gold necklace on my newborn baby for a photo?",
        "url": "/r/AmItheAsshole/comments/1rgd7za/aita_for_not_putting_gifted_gold_necklace_on_my/",
        "body_summary": "My husband (24m) and I (24f) had a baby toward the end of last year. A couple weeks after he was born, brought him over to my in laws house to meet my husband’s grandmother (94f). She gifted our newborn son a gold coin necklace, which is apparently a tradition that neither of us were aware of. She went to put the necklace on our son, which we both asked her not to and said we don’t think it is a good idea as he is too young to wear a necklace and we’re afraid of it getting caught in his neck folds. We took a picture of her holding him and the necklace, and one where she is laying the necklace on him. \n\nMonths later, my MIL calls my husband and goes off on him about how both of them are upset because we did not put the necklace on our son for the picture and that it is disrespectful to the ...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 24,
            "ESH": 0,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-28T05:26:51.751800"
    },
    {
        "id": "1rg8c0m",
        "title": "AITA for stop helping my rommie with groceries?",
        "url": "/r/AmItheAsshole/comments/1rg8c0m/aita_for_stop_helping_my_rommie_with_groceries/",
        "body_summary": "i recently stopped paying for his groceries, because he keeps inviting his GF over to eat which is ok? but she eats everything i buy, i told him three weeks ago that if shes eating here five nights a week she needs to chip in or he needs to cover her share. he laughed it off and said i was being crazy? over some pasta and chicken wow, then the other day i cam ehome and they were cooking the steak i bought for my meal prep. i lost it and took the pans off the stove and told her to get out. now \"im a phsycho\". for starting? ok .",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 27,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-28T05:26:52.121622"
    },
    {
        "id": "1rgh849",
        "title": "AITA for not eating the same birthday lunch meal as my dinner meal",
        "url": "/r/AmItheAsshole/comments/1rgh849/aita_for_not_eating_the_same_birthday_lunch_meal/",
        "body_summary": "I am having conflicting feelings on my birthday dinner. This is definitely first world problems and not really a big deal but it has my head spinning.\n\nMy father asked me a few days ago where I wanted to go to dinner for my birthday. I am almost 40 and he is in his 70s, we are not young so I feel that makes this even weirder.\n\nI tell him a restaurant I saw online that he and my mom had never been to. They said fine. My dad starts looking it up and says it’s not a fancy place so he would like to go check the place out first to see if they even have seating. Weird but okay.\n\nCut to the day we are supposed to go there for dinner and he says I’m going now(noon) to order lunch to see if the place is good. I said, “what? I thought we were going for dinner tonight.” He looked at me like I was an ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 11,
            "ESH": 1,
            "NAH": 8,
            "INFO": 0,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-28T05:26:59.754514"
    },
    {
        "id": "1rgf1d5",
        "title": "AITA for not wanting to help a SpEd kid in class",
        "url": "/r/AmItheAsshole/comments/1rgf1d5/aita_for_not_wanting_to_help_a_sped_kid_in_class/",
        "body_summary": "So for reference both me and the girl in question are seniors in high school. Ive been sat next to her in multiple classes because im pretty helpful on average with other students.\n\nI realized that during math class (one i actually kind of struggle in) she has just been copying all of my work, word for word, without doing any work. Im uncomfortable with most confrontation, and was a bit split, because she does struggle a lot with work. Ive always answered her questions, even though she barely asks. Ive also made it clear im always willing to help.\n\nSo after class i brought it up with the para educator assigned to her (basically a helper), and said what was happening was bothering me. She said that whenever i see it i should ask her if she understands whats going on, and if not, to explain ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 46,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-28T05:27:07.340742"
    },
    {
        "id": "1rg39s6",
        "title": "AITA Didn’t finish my food because I glass in it",
        "url": "/r/AmItheAsshole/comments/1rg39s6/aita_didnt_finish_my_food_because_i_glass_in_it/",
        "body_summary": "I was eating rice with my parents and sister as usual  when I bit into something hard. I pulled it out and it was literally a thumb sized shard of glass! I was so shocked to be honest. I showed it to my parents and told them I lost my  appetite. My mom was trying to convince me to continue eating. Just chew and be careful. I Refused to eat and I told them they shouldn’t eat the rice anymore as well. I felt like I could’ve seriously injured myself if I swallowed it. Who knows if there were smaller glass shards in the rice. \n\nMy mom got mad at me for wasting food and she made me feel like I was being dramatic.  \n\nEveryone else continued to eat like nothing happened. \n\nI’m just so shocked at how can you wash rice without feeling the glass?\n\nI also researched how one woman died from swallowing...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 26,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-28T05:27:14.935265"
    }
]