[
    {
        "id": "1ppph6i",
        "title": "AITA for telling my sister not to come to my wedding if she kept bringing up her miscarriage?",
        "url": "/r/AmItheAsshole/comments/1ppph6i/aita_for_telling_my_sister_not_to_come_to_my/",
        "body_summary": "3 years ago my younger sister Jen had a miscarriage at 9 weeks. She and her partner Scott were devastated. I was there for them as much as I could be but it was a tough time for them.\n\nA few months later Scott left Jen: Jen said it was because of the miscarriage. Her and Scott had a close knit group of friends and I found it odd no one has checked on her so I rang her best friend to suggest a girls night. She told me the reason they had broke up: Jen had slept with someone else. When he confronted her she blamed the miscarriage.\n\n9 months ago I got engaged and asked Jen to be my MoH. At our engagement party Jen became inconsolable at seeing our friends baby. Everyone’s focus - including mine - was on Jen all night. I wasn’t upset with her: I figured that she was imagining what all these bi...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 130,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 136
        },
        "total_judged": 136,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-19T05:14:49.752159"
    },
    {
        "id": "1ppq5ov",
        "title": "AITA for asking my boyfriend's dad whether he planned on eating his pet cat?",
        "url": "/r/AmItheAsshole/comments/1ppq5ov/aita_for_asking_my_boyfriends_dad_whether_he/",
        "body_summary": "I (19F) met my boyfriend (26M)'s parents for the first time last weekend over lunch. He warned me his parents could be a little bit weird so I was prepared for that but during the lunch they made repeated jabs at me for my age which I did not appreciate. The topic of pets came up in the conversation and I told them about my pet rabbits. When his dad heard this he asked whether I was raising them for food and at this point I was quite offended and said \"well are you raising that cat for food?\" and pointed at their cat, to which he said something to the effect of \"don't talk back\" which I found quite infantilising and a bit creepy. I excused myself from the lunch.",
        "reddit_judgments": {
            "YTA": 26,
            "NTA": 71,
            "ESH": 23,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 126
        },
        "total_judged": 126,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-19T05:14:53.633208"
    },
    {
        "id": "1ppmj1y",
        "title": "AITA for seeing friends/going to other things the day of my family's Christmas dinner?",
        "url": "/r/AmItheAsshole/comments/1ppmj1y/aita_for_seeing_friendsgoing_to_other_things_the/",
        "body_summary": "So I (late 20s f) live with my parents/sister. My family has two separate celebrations for Christmas every year- one where we have my brother and SIL over, and another on another day where we have the whole family over.\n\nOne of my friends has just moved back into the area and I hadn't seen her in a while, so I suggested we meet up again on a particular morning - I'm busy and if I don't do that day, I won't be able to see her for a while. On the same day, later in the evening, I have a dance class I do weekly.\n\nI mentioned that I was going to meet up with her and some other friends to my mother, who was unhappy, reminded me we had Christmas dinner with my brother, and told me she had wanted my help that day getting ready. (Her wanting help is reasonable, but I would be back in the mid after...",
        "reddit_judgments": {
            "YTA": 11,
            "NTA": 37,
            "ESH": 0,
            "NAH": 1,
            "INFO": 4,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-19T05:15:09.760689"
    },
    {
        "id": "1ppwg6f",
        "title": "AITA for not babysitting my grandkids on Christmas so they can go to a football game",
        "url": "/r/AmItheAsshole/comments/1ppwg6f/aita_for_not_babysitting_my_grandkids_on/",
        "body_summary": "My son and DIL have two grandkids 6 and 4. I babysit them once and while and overall our relationship is good. They were suppose to see us on Christmas for dinner.\n\nI got a call today about watching the kids on Christmas from noon until they come to dinner. I asked them why and it’s because they got football tickets on Christmas.\n\nDIL mother  was suppose to stay with them over the Christmas week but canceled bexuase she can’t make the drive (6 hours). They don’t have anyone to watch the kids\n\nThey asked me to do it and I told them no. They said they would be out a lot of money if they can’t go and I told them they shouldn’t have bought tickets on Christmas in the first place. I told them to spend time with their kids\n\nThey told me not to expect them on Christmas Day. they are not happy and...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 166,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 170
        },
        "total_judged": 170,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-19T05:15:30.112746"
    },
    {
        "id": "1pptsc4",
        "title": "AITA not buying more presents?",
        "url": "/r/AmItheAsshole/comments/1pptsc4/aita_not_buying_more_presents/",
        "body_summary": "So my grandkids were over and we made Christmas cookies. One especially difficult grandchild decided to open her presents that she found, despite being told that they were for next week.  The mother wants me to buy more presents for her to unwrap next week, and let her take the original presents home to play with, to the dismay of her siblings.\n\nI refuse to buy more gifts.  \n\nI just don’t understand the parenting style, it’s really hard to watch   ",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 125,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 126
        },
        "total_judged": 126,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-19T05:15:31.389772"
    },
    {
        "id": "1pq5kam",
        "title": "AITA for not accommodating my sister-in-law for Christmas before her gastric bypass surgery?",
        "url": "/r/AmItheAsshole/comments/1pq5kam/aita_for_not_accommodating_my_sisterinlaw_for/",
        "body_summary": "For context:\n\nMy sister in law just told us 15 days before Christmas that she is going to be getting gastric bypass surgery. I’m happy for her-she is taking a huge step in her health journey and managing chronic conditions.\n\nThis year I am hosting Christmas. My husband and I have 2 young children and this makes it easier for us. Sister and brother in law have no children. I had already bought the prime rib before knowing she was going to be on a liquid diet the week of Christmas.\n\nMy mother in law called my husband explaining how hard it’s been on Sister in law. Stating that SIL will just have to sit in the living room while everyone else eats. Mother in law feels bad and thinks we should eat before she comes over so she won’t feel left out. Personally, I think SIL is being a grinch and sh...",
        "reddit_judgments": {
            "YTA": 24,
            "NTA": 86,
            "ESH": 5,
            "NAH": 4,
            "INFO": 7,
            "TotalJudged": 126
        },
        "total_judged": 126,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-19T05:15:49.144888"
    },
    {
        "id": "1ppjs8d",
        "title": "WIBTA for telling my coworker that she has BO?",
        "url": "/r/AmItheAsshole/comments/1ppjs8d/wibta_for_telling_my_coworker_that_she_has_bo/",
        "body_summary": "Hi, I’m a longtime lurker of this sub and I have an issue that I’d like an impartial second opinion on.\n\nI’m a 28 year old woman that works at a med lab. I love my job and I love knowing that I’m helping people even it’s just a small part in the grand chain of operations.\n\nRecently we got a new coworker. I’m not entirely sure on her age, but I’d put her at early 20’s. She’s super sweet and dedicated to her job, often staying overtime to finish things up when others have already gone home.\n\nHere’s the problem though.\n\nShe has an incredibly intense BO. At first I honestly thought it was one of my male coworkers, but after a few times of her walking past me and the smell lingering in the air for a good 10 seconds I know it’s her. I really don’t wanna be mean, but the only other time I’ve smel...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 21,
            "ESH": 0,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-19T05:16:04.803579"
    },
    {
        "id": "1ppwzj5",
        "title": "WIBTA if I attended a chore weekend at our vacation home, but didn't do any chores?",
        "url": "/r/AmItheAsshole/comments/1ppwzj5/wibta_if_i_attended_a_chore_weekend_at_our/",
        "body_summary": "We own a vacation home.  Every time we go my partner works on his actual work emails, conference calls.... leaving me to do all of the maintenance on the property. \\*\\*This is usually Friday-Sunday, and he's the owner of the company. \\*\\* I've sanded and scraped paint from railing and fencing and then repainted it in the 90+ heat.  I've raked leaves, repaired the decking, trimmed bushes, layed mulch, power-washed, weeded... He says he's going to help, but never does.  Last month he asked me to go down to take care of somethings our property manager requested.  I went on my own for 4 days and worked, worked, worked.  He stayed home and played golf and relaxed.  Now he wants to go to finish the tasks, I couldn't do.  I said, I've already been down and worked my butt off.  So, he is having on...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 21,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-19T05:16:20.432043"
    },
    {
        "id": "1pq8qfx",
        "title": "AITA-for canceling my son's bday over $10",
        "url": "/r/AmItheAsshole/comments/1pq8qfx/aitafor_canceling_my_sons_bday_over_10/",
        "body_summary": "Aita- I 34yo female have a son who is turning 13 this weekend. He bday falls close to xmas and I am not wealthy, we just get by, so many years he doesn't get a full party. This year felt like a big milestone becoming a teenager so I wanted to make it special. We invited 10 kids and rented out some batting cages for 1.5 hours, I ordered a cake and planned a whole game and food and snacks. We live in an apartment so I planned a scavenger hunt outside to keep them entertained after the batting cages and wanted the prize to be soem hidden money. So on Monday I pulled out $20 and got 4 5 dollar bills. Today is Thursday and his last day of school before break  they were having a party at school and so I pulled a $5 out of my wallet and handed it to him and saw the other 3 $5s. I work from home s...",
        "reddit_judgments": {
            "YTA": 84,
            "NTA": 29,
            "ESH": 1,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 117
        },
        "total_judged": 117,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-19T05:16:37.625842"
    },
    {
        "id": "1ppvqdw",
        "title": "AITA for declining my boyfriend’s family’s New Year’s gathering after he decided not to attend my family’s Christmas?",
        "url": "/r/AmItheAsshole/comments/1ppvqdw/aita_for_declining_my_boyfriends_familys_new/",
        "body_summary": "I (35M) have been with my boyfriend “John” (31M) for a little over four years, and we live together in the Midwest.\n\nMost of my extended family lives about a 6-hour drive away, while John’s entire family lives about a 3-hour drive away. Over the course of our relationship, we’ve gone to his family's many times for holidays and family events. In contrast, John has only been to my extended family's once in 4+ years.\n\nThis year, John told me he won’t be coming to my family’s Christmas because the trip is too far. I understand it's a longer drive, but I was still hurt and disappointed given how infrequently he’s made the effort to see my family.\n\nBecause of that, I’ve decided not to attend his family’s New Year’s gathering.\n\nThis isn’t meant as punishment or retaliation. At this point, attendi...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 27,
            "ESH": 3,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-19T05:16:53.333501"
    }
]