[
    {
        "id": "1q9rpu0",
        "title": "AITAH for playing Mahjong on my computer at 11:00PM??",
        "url": "/r/AmItheAsshole/comments/1q9rpu0/aitah_for_playing_mahjong_on_my_computer_at_1100pm/",
        "body_summary": "AITA: I 21(f) love playing on my computer. It is a 2020 macbook air for reference. Currently, is a Saturday night at 11:30pm and I want to play a game I very much enjoy on my laptop in bed, and the game happens to be mahjong. Now mahjong is a lot of clicking because of how the game is, just matching tiles. I have no other noises going on in my apartment at this time. No music, no tv, no talking, computer volume is muted, and both of my pets laying next to me quietly. Yet, my downstairs neighbors have been complaining about hearing the clicking of my mousepad. They also have been complaining about hearing the typing of my computer. They shouted through the ceiling “can you do this tomorrow” or “bro you’ve had all day why are you doing this now” and even \"CAN YOU F-ING STOP.\" When they start...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 65,
            "ESH": 0,
            "NAH": 3,
            "INFO": 3,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-12T05:22:33.330574"
    },
    {
        "id": "1q9rjzb",
        "title": "AITA for telling my sister she wasn't the only one affected by our mom's death and to let our dad live his life?",
        "url": "/r/AmItheAsshole/comments/1q9rjzb/aita_for_telling_my_sister_she_wasnt_the_only_one/",
        "body_summary": "Hi, I said something meaning well but even my dad whom I said it for thinks I went too far. So I'd like to have an unbiased opinion.\n\nMy mom passed away almost 5 years ago. I was 24 at the time, my sister was 17. She's always beem treated as the baby of the family by all of us and she did take our mom's passing very hard. According to my dad, she'd have night terrors and he would go downstairs to get her water. She stayed with him for the first year of her college before moving out.\n\nA couple of years ago, my dad started dating someone and when he told us my sister went ballistic, full-on sobbing and begging him not to. The strain led to him breaking it off. Same story repeated once more after that. My dad told me she was young and still coming to terms with it so he wouldn't take anything...",
        "reddit_judgments": {
            "YTA": 20,
            "NTA": 58,
            "ESH": 2,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 83
        },
        "total_judged": 83,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-12T05:22:49.482045"
    },
    {
        "id": "1qa0q31",
        "title": "AITA for prioritizing hunger over my girlfriend clicking pictures of the food?",
        "url": "/r/AmItheAsshole/comments/1qa0q31/aita_for_prioritizing_hunger_over_my_girlfriend/",
        "body_summary": "My girlfriend likes to take pictures of things we eat outside. Most of the times, we order different dishes, so she takes the picture of every dish for \"variety\", or whatever.\n\nI'm always aware of it whenever we order, she doesn't have to mention it. I consider it a small thing, never had any issue. Today we went to mall and later decided to have lunch at a restaurant. One of the things we ordered and arrived first was Paneer tikka.\n\nFor those who don't know, Paneer tikka means a wooden stick having 3-5 chunks of cottage cheese marinated in spices. We got two sticks in the plate, each had 4 chunks.\n\nAs soon as it arrived, she gave it a glance and went to the washroom to pee. I was hungry, I knew she would have a click of it, but I waited for a min and then took one of the chunks, thinking ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 140,
            "ESH": 1,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-12T05:23:06.317230"
    },
    {
        "id": "1q9y5av",
        "title": "AITA for telling pharmacy customer to mind his own business?",
        "url": "/r/AmItheAsshole/comments/1q9y5av/aita_for_telling_pharmacy_customer_to_mind_his/",
        "body_summary": "A guy queueing in front of me got his medicine and imo should leave at that point but no he waited around like he wants to strike up a friendship right there. Then I get called to talk about my meds with the pharmacist and this customer listens in, interrupts, he starts giving his advice on medicine I am getting like he tried it before. A part of me thinks this is a private conversation, I would never think of getting involved in another person sorting their meds out. Another part of me sees how maybe he was trying to be helpful, but why? I have the pharmacist. Anyway I tell him no one asked him anything and it's none of his business and he goes ballistic. I just wanted to gather my pills in peace.",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 50,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 52
        },
        "total_judged": 52,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-12T05:23:06.978200"
    },
    {
        "id": "1q9woz6",
        "title": "AITA for delaying my group from leaving a bar because I was helping someone?",
        "url": "/r/AmItheAsshole/comments/1q9woz6/aita_for_delaying_my_group_from_leaving_a_bar/",
        "body_summary": "So last night, my friends and I were out bar hopping in Nash to have some fun. I didn’t want to drink so I stayed sober, and about 1 out of the remaining 4 people in my group decided to stay sober as well. Towards the end of the night, this girl, who I will refer to as S, comes up to me saying she lost her friends and asked if she can borrow my phone to call them, to which I oblige. \n\nDuring the course of this interaction, I noticed she was exceptionally drunk because she dropped my phone a couple times, couldn’t stand still, stumbling around, slurring words, etc. Seeing this and her failing to get ahold of her friends I was slightly concerned so we go sit on a bench out on the roof while she continues to try to call. At this point, my friends are ready to go and let me know. \n\nProblem is,...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 15,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 19
        },
        "total_judged": 19,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-12T05:23:22.508847"
    },
    {
        "id": "1q9zm42",
        "title": "AITA for wanting to keep my finances private?",
        "url": "/r/AmItheAsshole/comments/1q9zm42/aita_for_wanting_to_keep_my_finances_private/",
        "body_summary": "For reference I am 20 years old, still living at home, and have a full time job.\n\nSo today my mom and I are going over some stuff. Like future plans, me taking over some bills, etc. Like financial stuff. When doing this, she wants to log into my bank account and know exactly how much is in it. But in my opinion, I think that is my business only and all that matters is that if I’m able to pay what I need to, not for her to know exactly what I have.\n\nShe doesn’t have full access to my bank account but what she does is she sits me down and forces me to log in, and if she’s unhappy with the amount, makes me scroll through my transactions and gives me a huge lecture.\n\nI have a problem putting my foot down with her sometimes but goddamn it I need to have something that’s my own. Who cares how mu...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 46,
            "ESH": 0,
            "NAH": 5,
            "INFO": 4,
            "TotalJudged": 60
        },
        "total_judged": 60,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-12T05:23:38.768404"
    },
    {
        "id": "1q9rmrw",
        "title": "AITA for doing my own thing on a group trip",
        "url": "/r/AmItheAsshole/comments/1q9rmrw/aita_for_doing_my_own_thing_on_a_group_trip/",
        "body_summary": "I’m 24M. I just got back from a beach trip with five friends. We split an Airbnb evenly and rented a car. The plan was basically “chill vacation,” nothing super strict.\n\nBy the third day, it was clear the group wasn’t on the same page. Two people wanted to sleep till noon every day and then just drink at the house. That’s fine, but I didn’t want to spend the whole trip doing that. A couple of us actually wanted to go out and do stuff.\n\nThe night before, I booked a snorkeling thing for the next morning. I paid for it myself. I mentioned it kinda late and not everyone was around when I said it. In the morning, me and two others took the rental car and left early.\n\nWhen we got back, the people who stayed were pissed. They said I took a shared car without asking and that it felt like I ditched...",
        "reddit_judgments": {
            "YTA": 34,
            "NTA": 11,
            "ESH": 2,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 51
        },
        "total_judged": 51,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-12T05:23:54.670443"
    },
    {
        "id": "1q9vlve",
        "title": "AITA for not going to my sister-in-law's salon",
        "url": "/r/AmItheAsshole/comments/1q9vlve/aita_for_not_going_to_my_sisterinlaws_salon/",
        "body_summary": "AITA for not going to my sister-in-law's salon to get ready for my graduation? I, 25F is the youngest of 3 kids. My brother 32M got married to his 9 years girlfriend now my sister-in-law 30F, 3 years ago. She is a good beautician but she doesn't know how to handle my curly hair or my skin tone. I know this because I got her to help me get dress for a wedding previously and came out looking like I got flour all over my face. I'm a south asian woman mind you. So you can understand why I didn't choose to go to her salon for my big day and choose the salon I went to over 10 years. That was just my decision. I thought since me and my brother - not to mention sister-in-law, aren't close they won't care much about it. But today an argument broke out and this came out. Apparently I was hurting the...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 13,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 13
        },
        "total_judged": 13,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-12T05:24:10.187244"
    },
    {
        "id": "1q9tkaf",
        "title": "AITA for intentionally upsetting my mother?",
        "url": "/r/AmItheAsshole/comments/1q9tkaf/aita_for_intentionally_upsetting_my_mother/",
        "body_summary": "My (32M) mother (74F) lives with me, just the two of us. She's disabled, on oxygen, not easily mobile, has a history of falling and is hospital-prone. She is also very much still in her right mind (thank goodness) and we have a wonderful, healthy and close relationship.\n\nWhenever I leave the house to run errands, pick up prescriptions, go out with a friend, etc. she always does something risky while I'm not there. Things she's not supposed to do without supervision. Showering, walking up/down our stairs, stuff like that. I'll come home, find out \\[XYZ\\] and confront her, she'll promise me it won't happen again. But then it does, and it's not that I'm always leaving- besides work, I'm only going out 2-3 times a week and it's mainly for shit for the house and her.\n\nThe issue is even after th...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 28,
            "ESH": 2,
            "NAH": 4,
            "INFO": 0,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-12T05:24:25.771261"
    },
    {
        "id": "1qa1nm7",
        "title": "AITA because I need my sister to pay rent in a home she's occupying",
        "url": "/r/AmItheAsshole/comments/1qa1nm7/aita_because_i_need_my_sister_to_pay_rent_in_a/",
        "body_summary": "Context:\n\nSister is a 31 year old able bodied woman. We currently reside in a 3 bedroom home with my parents and son (5). At one point, my parents, sister and I were splitting the rent 4 ways but when my sister lost her job in Feb 2025, she stopped paying and I started also paying her portion. It's also important to know that I pay ALL of the other bills (water, electric, garbage, internet, insurance for my parents vehicles***).\n\nConsidering we have a 3 bedroom, my parents have the ensuite, my sister has her own room and I sleep in my son's room with him. Sleeping in my son's room was ideal at the time we moved in because he was nonverbal and 2. Now he's older, can speak and we both need our own space. \n\n***I pay the insurance for my parents vehicles because I drive them frequently. Why do...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 13,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 18
        },
        "total_judged": 18,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-12T05:24:41.374677"
    }
]