[
    {
        "id": "1q3nipn",
        "title": "WIBTA if I told my sons school it is their responsibility to make sure they have the right child",
        "url": "/r/AmItheAsshole/comments/1q3nipn/wibta_if_i_told_my_sons_school_it_is_their/",
        "body_summary": "I have twin sons (aged 11) who are not identical, but who do look similar - their older sister looks pretty similar to them too. \n\n\"James\" is taller and slightly more slender in the face. \"Ben\" is more freckle-y and is noticeably paler. They have the same eye and hair colour, but James has longer hair, and his is more wavy than Ben's. James tends to be very neat and tidy while Ben is, somehow, always covered in ink and / or paint. \n\nIn school, they are in uniform so are dressed identically. Classes are split by ability but their scores are close enough to each other that they are in the same groups for everything though they have different friendship groups and different hobbies. Both go to Chess Club though that is the only club / sport they have in common and most of the time, they don't...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 106,
            "ESH": 0,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 113
        },
        "total_judged": 113,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-05T05:29:31.777250"
    },
    {
        "id": "1q3i2pa",
        "title": "AITA for waiting in line at the grocery store while my parents finished shopping?",
        "url": "/r/AmItheAsshole/comments/1q3i2pa/aita_for_waiting_in_line_at_the_grocery_store/",
        "body_summary": "THANK YOU ALL WHO TOOK THE TIME TO WRITE A CIVIL AND CONSTRUCTIVE RESPONSE. DUE TO THE OVERWHELMING AMOUNT OF ENGAGEMENT AND AFTER MORE THAN 5 HOURS OF CONTINUOUS REPLYING I'M SAD TO ANNOUNCE I WONT BE INTERACTING WITH THE POST OR REPLIES ANYMORE. I CAN'T KEEP UP WITH EACH COMMENT AS THEY ARE WAY TOO MANY NOW. THANK YOU AGAIN FOR YOUR TIME AND TO THOSE WHO UPHELD THE VALUES AND RULES OF THIS SUBREDDIT. \n\nSo I went to the grocery store today and the lines to pay were a bit crowded, so my parents asked me to already wait in line while they finished grabbing the last couple of items. We usually do this if there's a lot of people. If it's my turn to pay and they aren't there yet I just let the person behind me pass, so I don't stop the flow (for obvious reasons). Even though that wasn't the ca...",
        "reddit_judgments": {
            "YTA": 161,
            "NTA": 2,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 163
        },
        "total_judged": 163,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-05T05:29:56.554661"
    },
    {
        "id": "1q3pdpo",
        "title": "AITA FOR TELLING MY DAUGHTER A TRIP FOR FUN WAS A NO GO",
        "url": "/r/AmItheAsshole/comments/1q3pdpo/aita_for_telling_my_daughter_a_trip_for_fun_was_a/",
        "body_summary": "I 40(F) and husband 42(M) have 4 children our oldest son 22(M) lives on his own. We have 20(F), 18(M), 10(F) and our 2 year old grandson that live with us. Our 20 year old daughter is currently a single mom in nursing school she lives with us we pay for pretty much all expenses seeing as she is in school and we want to see her succeed. I also dropped my full time hours at work in order to help with childcare so she can work and attend school. We have had to cut back and money is much tighter but all in all we are able to help her at this time and thankful we can help her as we were also teen parents with not much help we lived on our own worked paid our own bills lived on a tight budget. \nNow comes the AITA part, so as stated we pretty much support our daughter and grandson while she is in...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 126,
            "ESH": 5,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 149
        },
        "total_judged": 149,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-05T05:30:14.815786"
    },
    {
        "id": "1q3jv0e",
        "title": "AITA for trying to help my neighbor shovel her driveway?",
        "url": "/r/AmItheAsshole/comments/1q3jv0e/aita_for_trying_to_help_my_neighbor_shovel_her/",
        "body_summary": "I (19m) was already outside shoveling my own driveway when I noticed my neighbor(17-18f) across the street shoveling theirs. I don’t know her, but something immediately looked off. She kept stopping, bending over, holding her stomach, and occasionally her chest too.\n\nThen she slipped and fell in the snow. I saw that and I walked over to check on her. I asked if she was okay and she said yeah, but she looked pale, and was still holding her stomach, Im not entirely sure what was wrong. I asked if she needed help and she said she had to get the driveway done before her dad left for work. Her dad was still inside at this point.\n\nI told her I could just finish it really quick if she needed to rest.\n\nAs we were talking her dad came outside. He saw me shoveling and immediately started yelling, as...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 52,
            "ESH": 0,
            "NAH": 3,
            "INFO": 1,
            "TotalJudged": 57
        },
        "total_judged": 57,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-05T05:30:31.143664"
    },
    {
        "id": "1q3k9vn",
        "title": "AITA for wanting my stepdaughter to go to public school",
        "url": "/r/AmItheAsshole/comments/1q3k9vn/aita_for_wanting_my_stepdaughter_to_go_to_public/",
        "body_summary": "Using a throwaway account\n\nI(45M) have a daughter Amy (16F) with my ex and my wife(41F) has a daughter from a previous marriage  Cara(14F). Fake names.\n\nMy daughter has always done well in school and was among the top performers in elementary and middle school so for high school, we found a good private school which teaches more advanced concepts than regular high school and opens more opportunities for learning and better for college applications. She is doing well in this school but the school comes with a hefty fees. I don't mind paying as it will help her future.\n\nOn the other hand, my stepdaughter isn't as academically inclined, she was mostly average performing throughout. But we decided it would be good to put her in the same school as well. Since my daughter already went to this sc...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 58,
            "ESH": 5,
            "NAH": 8,
            "INFO": 13,
            "TotalJudged": 96
        },
        "total_judged": 96,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-05T05:30:49.077726"
    },
    {
        "id": "1q3lfme",
        "title": "AITA for choosing my future over my brother’s second chance?",
        "url": "/r/AmItheAsshole/comments/1q3lfme/aita_for_choosing_my_future_over_my_brothers/",
        "body_summary": "The responsibility I never expected.  \nI (24M) just got my first real job after college. I'm talking entry level salary and  living on instant noodles trying to build a life. My younger brother (20M) who won’t get a real job but insists he’s built for business failed his first year after I paid his full tuition. He blew the money on whatever and a failed startup with his friends.  \n he’s helpless begging for me to pay again. At this time I only have a little savings.  I used my savings to furnish an apartment. a bed, a couch, basics I’ve been struggling to get for a year with hopes of helping him out with some other money that haven’t come in as I expected. My parents doesn’t think  I’ve done bad with my decisions but it feels like guilt trip.  \nI overheard my brother on the phone with his...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 60,
            "ESH": 0,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-05T05:31:04.889138"
    },
    {
        "id": "1q3qgbn",
        "title": "AITA for not wanting to swap Concert tickets?",
        "url": "/r/AmItheAsshole/comments/1q3qgbn/aita_for_not_wanting_to_swap_concert_tickets/",
        "body_summary": "I need to know if I'm in the wrong on this and objective opinions would be much appreciated. \n\nSo, I'm a massive lover of Rock and Metal music and used to be an avid concert goer in my teens and 20's, but there are a few that I never got to see that have always been my Holy Grails. \n\nThen, mid 20's, I had a kid, settled down and being a working mum,  gigs became something that just weren't a priority, and a lot of the bands I loved either split up or stopped touring, so I gave up hoping I would see my Grails. \n\nCue a few months ago: System of a Down, one of my favourite bands, announced a tour. My son, Jack, who is 16, is also on his music journey and also loves System, so I decided to buy us both tickets and spend enough to get really good ones! I'm stupidly excited to share this experien...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 85,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 88
        },
        "total_judged": 88,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-05T05:31:21.608897"
    },
    {
        "id": "1q3pbsx",
        "title": "AITA for feeling ripped off after dog sitting and elderly couple with terminal brain cancer",
        "url": "/r/AmItheAsshole/comments/1q3pbsx/aita_for_feeling_ripped_off_after_dog_sitting_and/",
        "body_summary": "So my aunt is friends with this elderly couple who needed someone to look after their dogs from Dec 26–28. The husband has terminal brain cancer, and after hearing their situation I was willing to help for pretty much any price.\n\nAt first, I thought it would just be feeding and walking the dogs. Instead, I had to give three different sets of eye drops, three times a day (the dogs hated it), plus clean up poop and pee inside the house. We agreed on $20–25 AUD per visit.\n\nI didn’t really mind the work. I knew they were going through a hard time. I fed, walked, cleaned, and medicated the dogs three times a day, and even bought new food out of my own pocket because the food they left was out of date.\n\nOn the last day, I was told they’d be staying away another week longer than planned. I even l...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 25,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-05T05:31:37.324436"
    },
    {
        "id": "1q3hv6e",
        "title": "AITA for saying my in-laws can wait to be paid?",
        "url": "/r/AmItheAsshole/comments/1q3hv6e/aita_for_saying_my_inlaws_can_wait_to_be_paid/",
        "body_summary": "About 3 years ago I found out I was pregnant with baby number 4. My now hsuands first baby. I had a car that would fit me and the kids easily and since my husband doesn't ever really go anywhere with us, told him that for the time being this car would be fine for us. Before the baby was born he and his parents decided that I needed a different car. My husband brought it up multiple times but I told him until we could afford a new car, we'll be ok with what we have. I was upsidedown on my car but was more than half way done paying it off.\nMy inlaws are very well off. Everything they have was paid with cash. I got a call from my husband one day that his parents gave him $20,000 for a new car and he got one and needed me to come sign the paperwork. I told him again that I didn't want to becau...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 20,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 25
        },
        "total_judged": 25,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-05T05:31:53.313132"
    },
    {
        "id": "1q3jr3p",
        "title": "AITA for insisting it’s not my fault that boyfriend didn’t put his laundry away?",
        "url": "/r/AmItheAsshole/comments/1q3jr3p/aita_for_insisting_its_not_my_fault_that/",
        "body_summary": "My (24F) boyfriend (25m) and I have been together for 4 years and living together for 2. I want to preface by saying this isn’t about housework. While I have my occasional gripes, I think he does plenty especially compared to most men his age. This is about this specific situation. \n\nWe both had Thursday-Friday off this past week. We were so busy with the holidays and had a lot of cleaning up to do around the house. I’ve heard it’s bad luck to do laundry on New Year’s Day, so we saved that for Friday. I washed our bedding, towels, my regular clothes and my work clothes, which was 5 loads total. \n\nHe has admitted laundry is his least favorite chore. I do most of the “communal” laundry but he is responsible for his clothes. Almost every time, he leaves them in the dryer. They stay there unti...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 20,
            "ESH": 3,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-05T05:32:09.160871"
    }
]