[
    {
        "id": "1qwz100",
        "title": "AITA for leaving because my SIL hid my shoes to keep me from taking walks?",
        "url": "/r/AmItheAsshole/comments/1qwz100/aita_for_leaving_because_my_sil_hid_my_shoes_to/",
        "body_summary": "Sorry if there are any sentences that are missing words, this was over 5000 characters when I first wrote it so I had to edit it down. She is my SISTER IN LAW not my sister.\n\nMy SIL has three little ones, and her husband (my step brother) had to leave the country for work for a few months. I offered to stay so I could help her out where needed, and she happily accepted. I live across town so not THAT far.\n\nI was there for 3 days when my SIL commented on me going on daily walks. I have taken a daily walk of at least a mile since October 2018. Yes, even with a cold, yes, even in cold weather, yes to all of it. On nice days the walk is usually 4 miles. At my SILs, I started taking a path that was about two miles.\n\nI asked if she wanted me to watch the kids while she got some exercise and she ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 144,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-06T05:44:50.424962"
    },
    {
        "id": "1qwqfa5",
        "title": "AITA for punishing my stepson in response to his claims he has multiple personalities",
        "url": "/r/AmItheAsshole/comments/1qwqfa5/aita_for_punishing_my_stepson_in_response_to_his/",
        "body_summary": "Background: I (39/M) have a 17 year old stepson.  His father passed when he was 6, and Ive been in his life since he was 8. \n\n A few months ago, he came to family dinner and started talking in this funny nasal voice.  we laughed, thinking he was joking around, but he got upset, saying we werent accepting him.\n\nThis was the firat he claimed he had multiple personality disorder.  Short story:  My wife and I absolutely dont believe him.\n\nWe talked to his therapist (he had been seeing one since his father death), and the therapist knew nothing about this, but doubted the claim.  my stepson then asked to go to 2 different psychologists, who also said they disagreed with the claim.  My stepson then started refusing to go to therapy unless we find him a therapist who agrees with the claim.\n\nLooki...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 129,
            "ESH": 2,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 135
        },
        "total_judged": 135,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-06T05:45:01.257373"
    },
    {
        "id": "1qwwyxf",
        "title": "AITA for rejecting my MIL’s challenge and giving her instructions to learn how to knit?",
        "url": "/r/AmItheAsshole/comments/1qwwyxf/aita_for_rejecting_my_mils_challenge_and_giving/",
        "body_summary": "I am a knitter and enjoy making all kinds of things, but for the most part, I knit things for me or my husband. I don’t have the heart to buy nice yarn, a pattern, and put hours into making something for someone just to watch it be treated like crap. I have no say over what others do with the things I give them so I just don’t.\n\nMy MIL said “I have a challenge for you, IF you’re up to it.” She pointed at a picture on her phone and said that the challenge was for me to make her a Sophie scarf that would match a dress.\n\nI asked her, why is she framing it as a challenge when it’s just her asking me to knit something for her? She didn’t have an answer and just said if I’m up to the challenge I can give it a try.\n\nI asked my husband what I should do. He said to just flat out tell her no. But I ...",
        "reddit_judgments": {
            "YTA": 39,
            "NTA": 84,
            "ESH": 40,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 165
        },
        "total_judged": 165,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-06T05:45:10.765808"
    },
    {
        "id": "1qwe5zv",
        "title": "AITA for walking on ahead of my friend at the airport?",
        "url": "/r/AmItheAsshole/comments/1qwe5zv/aita_for_walking_on_ahead_of_my_friend_at_the/",
        "body_summary": "So I recently went on a trip with my friend. I’d noticed something was up, but every time I asked if she was okay, she said it was fine, then returned to her phone.  She kept bailing on our shared plans, and I would end up doing them on my own. \n\nWhen it comes time to board the flight home, she boards early as she uses a cane. She refuses my help with her bags, and barely speaks twenty words to me over the full 10+ hour period. \n\nWhen we land, I take her carryon out of the compartment for her, which she then sets in my seat, along with her cane and her other bag. As that leaves me in the aisle, I start moving when the rest of the row does. (The entire trip, she had been physically shoving me around, even for a few inches, because I am ‘in the way’, so I’m admittedly paranoid about holding ...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 40,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-06T05:45:18.721296"
    },
    {
        "id": "1qwx8u0",
        "title": "AITA for telling my houseguest about my son?",
        "url": "/r/AmItheAsshole/comments/1qwx8u0/aita_for_telling_my_houseguest_about_my_son/",
        "body_summary": "I (38m) live with my son (20m).  His mom is not in the picture and I have no other children. \n\nLast year my son came out as gay. While it was not something I am familiar with I of course accepted him because he’s my son and I love him. It was surprising because my son typically presents as very masculine and was very athletic and into sports growing up and still is. I apologize if that’s not PC to say I’m still learning but it is important to this story. When my son came out to me I asked how open he wanted to be with it and he said it’s not a secret and anyone can know. I’ve casually mentioned to other people that my son is gay and he’s never had an issue with it. \n\nAbout a month ago my friend (40m) asked me if his son (22m) could live with us for a while. He started grad school and my ho...",
        "reddit_judgments": {
            "YTA": 99,
            "NTA": 27,
            "ESH": 3,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 132
        },
        "total_judged": 132,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-06T05:45:28.374707"
    },
    {
        "id": "1qwvluy",
        "title": "AITA For Telling My Wife My MIL Can't Move In",
        "url": "/r/AmItheAsshole/comments/1qwvluy/aita_for_telling_my_wife_my_mil_cant_move_in/",
        "body_summary": "We bought a house a year ago. The house has a spacious basement that we were planning on turning into a living area for my MIL. That project probably won't happen for a few years due to the cost. My MIL lives in a section 8 type of building for older people. It is in a nice location so we are in no real rush to renovate the basement. My MIL has been staying with us 2 weeks at a time every month for the past year and the building manager recently told her that she is not allowed to live there part time. My wife and i can see why the manager thinks she only lives there part time. She hinted at wanting to move into the kids play room until we fix the basement I immediately said no because A. that is the kids play room and would make things tight in our house and B. I do not want to live with ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 39,
            "ESH": 1,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-06T05:45:36.608980"
    },
    {
        "id": "1qwmn8t",
        "title": "AITA for not cancelling a long-planned sports competition to attend my niece’s baptism?",
        "url": "/r/AmItheAsshole/comments/1qwmn8t/aita_for_not_cancelling_a_longplanned_sports/",
        "body_summary": "My sister invited me to her child’s baptism about a month in advance. The date was already chosen when she told me, and she also asked me to be the godfather.\n\nThe problem is that I already have a major curling competition that same weekend. I’ve been looking forward to this event all year, paid about $200 to participate, and I’m part of a team (of four) that would be short a player and let down if I didn’t show up. We tried to get into this competition last year and missed out (filled up in minutes) and this year we've been really excited, bought outfits, planned around it, and have been talking about it all season.\n\nI told my sister I couldn’t make the baptism on that date and asked if there was any flexibility. She said no and has been very upset since, saying she would “drop everything...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 70,
            "ESH": 2,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-06T05:45:44.967506"
    },
    {
        "id": "1qwwsg2",
        "title": "AITA for not allowing my cousin to wear my wedding dress for her wedding?",
        "url": "/r/AmItheAsshole/comments/1qwwsg2/aita_for_not_allowing_my_cousin_to_wear_my/",
        "body_summary": "AITA for not letting my cousin wear my weddings dress for her wedding?\n\nFirst off I want to start by saying that me and said cousin are not close! We used to be but we aren’t really now and haven’t been for years. My mum however is incredibly close with her and treats her like her own daughter.\n\nI want to start this off by saying I got married last year in September. I got married on holiday and we told no one until after we got married only my parents attended. We had pink, gold and purple and cream/white as our colour. I had a tiara with my hair half up half down curled. We had our reception when we got back etc and had bridesmaids and groomsmen as of which she was not a part of the bridal party. We had a lovely cake, decor (all colour themed as stated above), I changed dress half way th...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 36,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 39
        },
        "total_judged": 39,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-06T05:45:52.712914"
    },
    {
        "id": "1qws0qj",
        "title": "AITA for refusing to write a poem about my wife?",
        "url": "/r/AmItheAsshole/comments/1qws0qj/aita_for_refusing_to_write_a_poem_about_my_wife/",
        "body_summary": "I (33m) write poems for fun. I don't publish them or share them with anyone. I just have a little black notebook full of poems that I write in the morning with my coffee, which I then leave in my desk drawer. It's sort of a mindfulness practice I do instead of reading the news on my phone. \n\nAnyway, so my wife (30f) got curious the other day, and went through my little black notebook, without my permission. Maybe 100 poems. And she got angry with me because none of the poems are about her. She told me that she expected at least ONE of the poems to be about her, and went off on this tangent, about how she doesn't even know if I love her if I didn't write a poem about her, but I wrote a poem about our cat, the tree in our front yard, etc. I tried to tell her that it wasn't like that, and so ...",
        "reddit_judgments": {
            "YTA": 40,
            "NTA": 67,
            "ESH": 24,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 137
        },
        "total_judged": 137,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-06T05:46:02.008092"
    },
    {
        "id": "1qwpd2a",
        "title": "AITA for buying a £45 hoodie with my own money even though my family is tight on money?",
        "url": "/r/AmItheAsshole/comments/1qwpd2a/aita_for_buying_a_45_hoodie_with_my_own_money/",
        "body_summary": "For context, I (16F) have my own part-time job. I barely make £100 per month (this will be important later).\n\nMy dad is currently doing a PhD on international fees in the UK, so we're currently paying upwards of £17,000 per year for 4 years, as well as my subsidised fees (90% bursary) for my attendance at a private sixth form (academic scholarship). My dad has no job (he's been unemployed since COVID) and my mum is an assistant teacher, which is barely enough money to pay for all of this, including rent, and their savings can only go so far. I understand this. I always have. We've been tight on money since I was 11, when my dad lost his job. But we were doing okay because we weren't paying outrageous university fees, and a result, we're now worse off. One of the reasons I got a job was so ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 65,
            "ESH": 0,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 71
        },
        "total_judged": 71,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-06T05:46:11.231085"
    }
]