[
    {
        "id": "1r8zmg4",
        "title": "AITA for refusing to go to my SIL  Baby shower and the rest of the family is following.",
        "url": "/r/AmItheAsshole/comments/1r8zmg4/aita_for_refusing_to_go_to_my_sil_baby_shower_and/",
        "body_summary": "edited to be clear\n\nThis started soon after my brother married Ruby. At the time everyone seemed to really like her and my older sister and I were part of her bridal party.  Her wedding was around 5 years ago.\n\nSoon they were talking about trying to kids and they were stuggling with infertility issues. Ruby was quite upset  but it got a lot worst when my older sister ( she was 26 at the time) got pregnant. \n\nRuby was snappish and mean to my oldest sister and people tried to be very mindful since she was struggling. When the baby  was born Rudy didn’t send anything. \n\nI got pregnant my senior year of college, it was an oops baby and I only told my mom because I was unsure what to do. I was a heavy drinker at family events and when I wasn’t drinking, my grandma joked I must be pregnant and m...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 168,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 169
        },
        "total_judged": 169,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-20T05:45:41.780602"
    },
    {
        "id": "1r9idix",
        "title": "AITA for telling my uncle I don’t want to be like his kids",
        "url": "/r/AmItheAsshole/comments/1r9idix/aita_for_telling_my_uncle_i_dont_want_to_be_like/",
        "body_summary": "Backstory: my mom died when I (14f) was little. She had been sick for a while and before she died she set everything up so I would go to her best friend, Katie. My uncle, Nick, fought for custody of me after my mom died because he thought I should be with family. Katie has custody of me and adopted me but I spend one weekend a month with Nick and his family, although lately it’s been a little less because of competitions. The visits to Nicks house aren’t court ordered  Katie just wants me to have a connection with my bio family  \n\nNick and Katie are very different parents. Katie and her husband are both doctors. Nick is a cop and his wife is a preschool teacher.\n\nI’ve been in private school my entire life and my school is 1-2 years ahead of the local public schools, which are also some of ...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 61,
            "ESH": 11,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 82
        },
        "total_judged": 82,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-20T05:45:50.283461"
    },
    {
        "id": "1r9861z",
        "title": "AITA for not going to the school board becuase my daughter got a 12% on an exam since  she went to the bathroom",
        "url": "/r/AmItheAsshole/comments/1r9861z/aita_for_not_going_to_the_school_board_becuase_my/",
        "body_summary": "edit: since people asked why she went form “A” student to a 12%. the teacher jacks  up the difficlulty in her class after winter break to see who can handle their medical track. my daughter is much more a math person\n\noldest daughter had the same think happen and she learned she wanted to go into medical with this And came home with first zero on a quiz\n\nsane thing is happening in math to see who can handle the engineering track (she is doing well in that one)\n\n—————\n\nMy daughter is a freshman in high school and she goes to a really good academic private schools. My older daughter went to the school and has graduated.\n\nThe school has a strict test taking policies and one of the rules is you must turn in your test if you leave the classroom. You will be graded on what you turned in. There a...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 90,
            "ESH": 2,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 97
        },
        "total_judged": 97,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-20T05:45:58.804874"
    },
    {
        "id": "1r9asjf",
        "title": "WIBTA if I confronted my mom about lying to my husband to rearrange the furniture in my house?",
        "url": "/r/AmItheAsshole/comments/1r9asjf/wibta_if_i_confronted_my_mom_about_lying_to_my/",
        "body_summary": "So long story short my mom went behind my back and suggested to my husband to rearrange my toddlers room.\n\nKeep in mind I’m 38 weeks pregnant.\n\nI hated the arrangement mainly because my kid loves having a ton of stuffed animals in her bed and the way the bed was arranged they kept falling off.\n\nSo finally I asked my husband “Why did you do this? I don’t understand why this took priority with the new baby coming.”\n\nEspecially since the furniture was mounted to the wall for safety and now the furniture needs remounted.\n\nHe told me my mom told him to do it and that I wanted it. I told him no and to put the bed up against the other wall.\n\nWell my mom walks in and says “Why did you do this? I was going to buy her a nightstand there isn’t any room now.”\n\nOf course did she ask anyone about the ni...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 28,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 29
        },
        "total_judged": 29,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-20T05:46:08.063810"
    },
    {
        "id": "1r97svc",
        "title": "AITA for letting my son buy something without first having him ask his dad?",
        "url": "/r/AmItheAsshole/comments/1r97svc/aita_for_letting_my_son_buy_something_without/",
        "body_summary": "I went to Costco to get some grocerie items. My oldest comes across a Pokemon set that catches his eyes. He looks but he doesn't get it.\n\nWe're done and at the self-checkout line. My son goes to take another look at the Pokemon set then decided he wants the set because he could resell it. He buy it with his own money. Then he wants a second one but doesn't have enough funds. He asks me if I can purchase it for him then he'll pay it back once he has money. I gave him some grief (saying it better make a good profit) and paid for the item.\n\nI'm a SAHM, I don't have any income. My husband is the sole provider and pays for everything even if I'm the one that goes shopping. I shop with a joint credit card that's under his name and he pays for all of the bills.\n\nAfter my son had some money I had ...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 55,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 62
        },
        "total_judged": 62,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-20T05:46:15.957340"
    },
    {
        "id": "1r947oc",
        "title": "AITA for upsetting my daughter over food?",
        "url": "/r/AmItheAsshole/comments/1r947oc/aita_for_upsetting_my_daughter_over_food/",
        "body_summary": "So this just happened and I want to know if I'm the asshole or not, I get that food is a sensitive topic with some people and in all honesty I feel like I was just being a caring mum.\n\nAnyway so my daughter we'll call her Amy (12F) just took a box of chocolate filled soft sponge cakes (there's 5 in a box) and ate them all. When I asked why she would eat them all instead of getting something better for her she got upset, when I mean better we have a fridge full of fruit that *she* loves and ingredients to make actual snacks or meals. \n\nShe got upset saying that I was making her self-conscious of herself and that I'd basically called her fat. I hadn't and would never, that girl is my world. I just wanted to help her make good choices. \n\nI have already apologized for making her feel that way ...",
        "reddit_judgments": {
            "YTA": 35,
            "NTA": 35,
            "ESH": 2,
            "NAH": 16,
            "INFO": 2,
            "TotalJudged": 90
        },
        "total_judged": 90,
        "reddit_verdict": "Mixed",
        "fetched_utc": "2026-02-20T05:46:24.805044"
    },
    {
        "id": "1r9eztq",
        "title": "AITA for not going against what my mother wanted for her 60th birthday?",
        "url": "/r/AmItheAsshole/comments/1r9eztq/aita_for_not_going_against_what_my_mother_wanted/",
        "body_summary": "I (25F) and my brother (31M) were planning our mom’s 60th birthday. She told me earlier she didn’t want a big party just a quiet dinner with immediate family. We agreed to respect her decision \n\n\n\nI made a reservation at her favorite restaurant and planned something small like she wanted, Two weeks before her birthday, my brother told me he changed his mind and booked a surprise party with around 50 people because he thought she did not really mean what she said about wanting a small and quiet dinner. \n\n\n\nI told him I wasn’t comfortable going against what she asked for and i will go ahead with the dinner plan. He said I was being self centered and not thinking about what she actually wanted when she clearly stated she wants something quiet. \n\n\n\nI didn’t cancel the dinner. She came, seemed ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 26,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-20T05:46:32.376879"
    },
    {
        "id": "1r8veq6",
        "title": "AITA For refusing to listen to my friend after I warned her that I will not?",
        "url": "/r/AmItheAsshole/comments/1r8veq6/aita_for_refusing_to_listen_to_my_friend_after_i/",
        "body_summary": "I (24 F) got into an issue with my (26 F) friend, for some context, I'm usually the person my friends go to for relationship advice, if all the people I met are anything to go on, I'm pretty good at giving advice.\n\nMy friend is dating a man of a different race, one day she came to me asking about his pattern of behaviours and his past, from microaggression and racism to his family (and him) being on a different stance on lots of things. I spoke honestly, told her she is not necessarily the exception and even if she was, what if she is no longer? How would he treat her then? How would his family react to them being together? If she wanted to marry would he give up his family for her? Or would this be a waste of her time?\n\nShe got upset at me, telling me I'm being a ‘hater’ and trying to rui...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 26,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-20T05:46:39.930000"
    },
    {
        "id": "1r9ei4j",
        "title": "AITA for refusing to share my vacation pics with a friend who bailed on the trip last minute?",
        "url": "/r/AmItheAsshole/comments/1r9ei4j/aita_for_refusing_to_share_my_vacation_pics_with/",
        "body_summary": "my friend sarah and i planned a trip for months. two days before she bailed because she didnt feel lik eit... i went alone and had an amazing time, now shes asking me to send her all my pics so she can post them on her private story to see what it was like, but i feel like she doesnt deserve the memories since she left me hanging. she says im being petty ... AITA?",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 24,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-20T05:46:40.346243"
    },
    {
        "id": "1r8y08m",
        "title": "AITA for not wanting to pay a bill after canceling an appointment for a service, but the service was still provided?",
        "url": "/r/AmItheAsshole/comments/1r8y08m/aita_for_not_wanting_to_pay_a_bill_after/",
        "body_summary": "I (41 m) have gotten into a fight with my SO (43 f, also she's Japanese which might put some context here) over a chimney sweeping service bill. Earlier this month I got a notification via email for a chimney sweeping service which happens once or twice a year. This is standard practice. However this company is new as the old one no longer operated here. I haven't use any fireplace the whole year since I have mountain heating system so the service was not need. I contacted them and canceled the the service and got a confirmation via email that it was indeed canceled. I did not mention this to her since I didn't think it was important since it was supposed to be a closed matter.\n\nHowever, today while I was at work and my SO was at home, we got a knock on the door and the company guy started...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 27,
            "ESH": 1,
            "NAH": 4,
            "INFO": 2,
            "TotalJudged": 35
        },
        "total_judged": 35,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-20T05:46:48.086776"
    }
]