[
    {
        "id": "1lzk851",
        "title": "AITA for refusing to let my roommate’s girlfriend move into our apartment without paying rent?",
        "url": "/r/AmItheAsshole/comments/1lzk851/aita_for_refusing_to_let_my_roommates_girlfriend/",
        "body_summary": "OP & roommate Jake split rent. Jake wants GF Sarah to move in, jobless. OP wants Sarah to pay rent later; Jake refuses, calls OP petty. OP feels used, asks AITA for refusing to subsidize Sarah's living.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 120,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 120
        },
        "total_judged": 120,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-15T05:17:05.472029"
    },
    {
        "id": "1lzvx1m",
        "title": "AITA for asking my boyfriend to not open the bathroom doors on me at his parents house?",
        "url": "/r/AmItheAsshole/comments/1lzvx1m/aita_for_asking_my_boyfriend_to_not_open_the/",
        "body_summary": "OP (30F) is visiting BF's (31M) parents. He repeatedly opens the unlocked bathroom door on her despite her discomfort, escalating to incidents where he brings in others. She asks him to stop. He dismisses her feelings, citing past behavior & lack of nudity. AITA for asking him to stop?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 116,
            "ESH": 0,
            "NAH": 0,
            "INFO": 4,
            "TotalJudged": 122
        },
        "total_judged": 122,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-15T05:17:12.292972"
    },
    {
        "id": "1lztcql",
        "title": "AITA for preventing my pregnant sister access to my food?",
        "url": "/r/AmItheAsshole/comments/1lztcql/aita_for_preventing_my_pregnant_sister_access_to/",
        "body_summary": "OP's sister is eating his prepped food. He bought a mini-fridge for his room. She's upset. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 133,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-15T05:17:17.251712"
    },
    {
        "id": "1lzqyr1",
        "title": "AITA for buying my neice a car and not my nephew?",
        "url": "/r/AmItheAsshole/comments/1lzqyr1/aita_for_buying_my_neice_a_car_and_not_my_nephew/",
        "body_summary": "OP (50M) promised niece & nephew cars if they maintained a B average in HS. Niece succeeded; nephew didn't. OP bought the niece a car but not the nephew. Nephew is angry, accusing OP of favoritism & refusing to speak to niece/OP. AITA?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 150,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 155
        },
        "total_judged": 155,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-15T05:17:22.234597"
    },
    {
        "id": "1lzemoc",
        "title": "AITA for how i acted after finding out about the possibility of a new baby in the family?",
        "url": "/r/AmItheAsshole/comments/1lzemoc/aita_for_how_i_acted_after_finding_out_about_the/",
        "body_summary": "OP refuses to acknowledge her brother's new baby due to his past behavior, including past abandonment of kids he helped raise and their strained relationship, citing childhood trauma and his alcoholism. Her mother is upset and wants her to reconcile. AITA for setting this boundary?\n...",
        "reddit_judgments": {
            "YTA": 6,
            "NTA": 35,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-15T05:17:25.345656"
    },
    {
        "id": "1m00izb",
        "title": "AITA for getting the other kids sugary drinks when she isn’t allowed one?",
        "url": "/r/AmItheAsshole/comments/1m00izb/aita_for_getting_the_other_kids_sugary_drinks/",
        "body_summary": "It was my(18) little sister(13)’s birthday. Our parents and her friends’ parents asked me and my girlfriend(17) who is one of the kids’ sister, to take them to the cinema. So we did.\n\nAfter getting the tickets, I went to buy the drinks. Asked them what they all want. Two Fuze Teas, one slushie and one Coca Cola. Got around to the final kid who looked a bit sad. She said her mom doesn’t let her drink sugary drinks. Then she pointed at a shelf where there are small boxes of unsweetened almond milk, saying that those are okay. So I got one of those for her.\n\nMy girlfriend later said I shouldn’t have gotten the other kids drinks she wanted to try but wasn’t allowed to, and that it was insensitive.",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 59,
            "ESH": 0,
            "NAH": 7,
            "INFO": 0,
            "TotalJudged": 69
        },
        "total_judged": 69,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-15T05:17:26.237969"
    },
    {
        "id": "1lzs4dx",
        "title": "AITA for refusing to share my umbrella with a girl?",
        "url": "/r/AmItheAsshole/comments/1lzs4dx/aita_for_refusing_to_share_my_umbrella_with_a_girl/",
        "body_summary": "OP (19F) refused to share her umbrella with a classmate (20F) who constantly mocks her. The classmate called her a \"bitch,\" and friends labeled OP \"heartless.\" OP feels justified due to prior mistreatment. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 72,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-15T05:17:29.502009"
    },
    {
        "id": "1m02rxj",
        "title": "AITA for letting my boyfriend tell a friend to find her own ride home from the beach?",
        "url": "/r/AmItheAsshole/comments/1m02rxj/aita_for_letting_my_boyfriend_tell_a_friend_to/",
        "body_summary": "Took a friend to the beach after she’d been begging to go. She brought no money, ate our food, drank my alcohol, then disappeared to make out with two random guys. We stopped our day to look for her, made eye contact, and got ignored.\n\nShe has a pattern of flaking, mooching, and crossing boundaries like commenting on my looks, smacking my butt, and getting upset when I didn’t want her sleeping in my bed. My boyfriend’s always been uncomfortable with how clingy she is with me.\n\nWhen she finally showed back up, he told her she could ride with the guys she was with since she clearly wasn’t with us. She started crying, and he still told her she could ride back with us, but it’s not fair for her to disappear and treat us like a free ride. She chose to leave and turned her location off. Now she’...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 30,
            "ESH": 17,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-15T05:17:45.658518"
    },
    {
        "id": "1lzyqp8",
        "title": "AITA for not kashering the kitchen for my son?",
        "url": "/r/AmItheAsshole/comments/1lzyqp8/aita_for_not_kashering_the_kitchen_for_my_son/",
        "body_summary": "Throwaway blah blah. I grew up Orthodox Jewish but it wasn’t the lifestyle for me and I left while remaining very culturally Jewish. My husband is Jewish and I raised our children to be very in touch with their cultural identity (sent them to Jewish schools and sleepaway camps) but don’t really practice the religion in terms of keeping the Sabbath, following the dietary laws, etc.\n\nOur son is 19 and has, over the past two years, become pretty religious. He spends the Sabbath with friends, which is fine with us. We have tried to compromise on the dietary laws by purchasing kosher meat/poultry for him, not mixing meat and dairy, etc. we live in an area with a large Jewish community and he has cart blanche to use Apple Pay to buy himself whatever food he wants. \n\nBecause I grew up in the comm...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 85,
            "ESH": 0,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 91
        },
        "total_judged": 91,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-15T05:18:01.881244"
    },
    {
        "id": "1lzthob",
        "title": "AITA for confiscating a friend's dental floss?",
        "url": "/r/AmItheAsshole/comments/1lzthob/aita_for_confiscating_a_friends_dental_floss/",
        "body_summary": "OP's friend visited, unaware of cat safety. OP's cat nearly died eating string; friend left floss out despite warnings. OP confiscated floss. Friend's husband called OP controlling. AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 91,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 94
        },
        "total_judged": 94,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-07-15T05:18:14.352706"
    }
]