[
    {
        "id": "1re7fkz",
        "title": "AITA for refusing to return expensive band merchandise I bought second hand when someone reached out to tell me they were stolen from her?",
        "url": "/r/AmItheAsshole/comments/1re7fkz/aita_for_refusing_to_return_expensive_band/",
        "body_summary": "Last November, I bought two autographed K-pop posters from members of my favorite band. They were listed in my country’s main Facebook selling group for the fandom, and the seller authenticated them with enough proof that I was comfortable buying. I spent a couple thousand dollars on them as a gift to myself for graduating with my Master's and landing a \"big girl\" job after interning all summer to secure it, which kept me from traveling like I wanted.\n\nA few weeks after posting them on Instagram, I got a message from a girl, \"Ana,\" from another country. She claimed the posters were stolen from her by her ex-roommate, who sold them to me without her consent, and demanded I return them immediately as stolen property. She sent a picture of the posters with a timestamp showing early February 2...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 71,
            "ESH": 1,
            "NAH": 4,
            "INFO": 3,
            "TotalJudged": 87
        },
        "total_judged": 87,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-26T05:51:39.685373"
    },
    {
        "id": "1re5lno",
        "title": "AITA for refusing to pay my share of the Airbnb after my friend offered to let me stay for free when I said I couldn’t afford it?",
        "url": "/r/AmItheAsshole/comments/1re5lno/aita_for_refusing_to_pay_my_share_of_the_airbnb/",
        "body_summary": "Okay so there was a big event in the city which is a decent distance away (about 1.5 hours away by train) and 8 of us were planning to go, now one guy Dan suggested we book an Airbnb and split the cost 8 ways which basically cost about $70 each.\n\nI've honestly been bad at saving my money and am trying to make an effort to spend less, so I told everyone upfront if you guys want to do the Airbnb, go for it. I’ll just take the train home after the event.\n\nNow after the event ended I start saying goodbye to everyone and tell them I’m heading to the train station. Suddenly everyone starts trying to convince me to stay at the Airbnb. I firmly say no, because I'm trying to save money and that I’m going home. Then Dan specifically tells me we’ve already ordered it anyway, just stay for free since ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 108,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 110
        },
        "total_judged": 110,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-26T05:51:49.468116"
    },
    {
        "id": "1rewvgh",
        "title": "AITA for snapping at an old lady who cut me in line.",
        "url": "/r/AmItheAsshole/comments/1rewvgh/aita_for_snapping_at_an_old_lady_who_cut_me_in/",
        "body_summary": "I was waiting in line at a department store for about 12 minutes. An older woman was nearby watching me, and when the line moved, she suddenly stepped right in front of me like I wasn’t there.\n\nI said “excuse me,” and she told me I was “too slow,” even though I had been standing there the whole time.\n\nI got frustrated and said, “is this how you want to live out the last 3 years, lady?” She looked shocked and immediately moved out of the way without arguing.\n\nAITA? ",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 55,
            "ESH": 1,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 65
        },
        "total_judged": 65,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-26T05:51:50.315505"
    },
    {
        "id": "1rey22o",
        "title": "AITA for refusing to share my \"secret\" recipe with my sister-in-law?",
        "url": "/r/AmItheAsshole/comments/1rey22o/aita_for_refusing_to_share_my_secret_recipe_with/",
        "body_summary": "I have a specific way of making baked mac and cheese. It’s the only thing I’m known for at family gatherings. My SIL asked for the recipe, and I told her I’d rather keep it a secret. She called me gatekeeper-y and says I’m being \"childish\" over noodles. My brother says I should just give it to her to keep the peace. AITA?",
        "reddit_judgments": {
            "YTA": 25,
            "NTA": 96,
            "ESH": 4,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 130
        },
        "total_judged": 130,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-26T05:51:53.701440"
    },
    {
        "id": "1ret4l0",
        "title": "WIBTA if I call off the wedding my mom planned for me?",
        "url": "/r/AmItheAsshole/comments/1ret4l0/wibta_if_i_call_off_the_wedding_my_mom_planned/",
        "body_summary": "I (28F) am having two wedding celebrations in about 7 months.\n\n1. My mom is planning a large, cultural celebration that is centered around a religion she and my dad are very active in. The ceremony and those hosting will be speaking a non-English language. The groom (34M) and I do not speak the language and do not participate in this religion or are present in the cultural community. The guest list is well over 350 people, many of which I've never met. This takes place 7 days before the second wedding.\n2. The second is a small/medium sized, American style wedding. We have invited 100 people that includes our immediate family, close distant family, close friends, and co-workers and their +1's. We only want people we care about here. This is the one we agree is our \"real wedding\".\n\nMy mom as...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 72,
            "ESH": 3,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-26T05:52:01.949100"
    },
    {
        "id": "1relu37",
        "title": "AITA For not inviting my brother’s sister in law to my wedding.",
        "url": "/r/AmItheAsshole/comments/1relu37/aita_for_not_inviting_my_brothers_sister_in_law/",
        "body_summary": "Some background. I am 1 of 5 siblings. I grew up with my mother’s side of the family which is HUGE. My grandma has well over 40 grandchildren. My fiancé comes from a small family but he is 1 of 7 siblings. He doesn’t have an extended family like I do.\n\nDue to this we decided to have a micro wedding where we ONLY invite siblings and close people to us. My sister got married in 2022 and she paid over $40k and had 200 people at her wedding and it was so stressful and we hardly see any other people at her wedding anymore due to family problems so I do not want to fund a party with people who are not actively in our lives.\n\nCurrently my guest list is 32 but we have a max capacity of 48 allowed if we paid the difference. All that being said this is where the issue arises.\n\nMy eldest brother live...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 44,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-26T05:52:10.235836"
    },
    {
        "id": "1rednag",
        "title": "AITA For having this car towed",
        "url": "/r/AmItheAsshole/comments/1rednag/aita_for_having_this_car_towed/",
        "body_summary": "I live in an apt and I have two parking spots but I only use one. There is VERY VERY clear signage that ur car will be towed if you park in the spot. I usually just leave a note or something on the car if I notice they’ve parked there more than once, and I always check with my neighbors first to make sure it wasn’t one of their guests or something. But a few days ago a different car parked in my spot and coincidentally someone tried to break into my car. They also left a weird marker mark on my door so I’m afraid they’re planning on coming back or something. Bought a dash cam but it didn’t work w my outlets 🤦‍♀️. Anyways this car has been parked here since last night. I waited out by my car for 30 min to see if anyone would see or something idk. My spot is right outside my window so I open...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 29,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 31
        },
        "total_judged": 31,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-26T05:52:17.811673"
    },
    {
        "id": "1reuuyd",
        "title": "AITA for offering to pay for my friend and his wife to get a babysitter so we could hang out?",
        "url": "/r/AmItheAsshole/comments/1reuuyd/aita_for_offering_to_pay_for_my_friend_and_his/",
        "body_summary": "At face value this sounds ridiculous but I think what happened is they felt financially insulted. Like they felt I was looking down on them.\n\nI have a close friend I'll call Rob. I've known him since freshman year of high school. I was in his wedding party, I'm close with his parents, he's essentially my brother from another mother. Love the guy immensely.\n\nHis wife, I'll call Katie, is also a sweetheart. She can be anxious and stresses easily depending on the situation but she loves Rob immensely and I know she treats him right. So she's a good woman in my book. Genuinely no ill feelings towards her.\n\nRob and Katie have two kids. Two girls. They've disappeared from the social circles for a bit and I know it's likely because money is tight and they're exhausted. After putting out an invite...",
        "reddit_judgments": {
            "YTA": 21,
            "NTA": 12,
            "ESH": 2,
            "NAH": 4,
            "INFO": 1,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-26T05:52:26.509448"
    },
    {
        "id": "1reu9ld",
        "title": "AITA for telling I have ZERO need for a gift I was given",
        "url": "/r/AmItheAsshole/comments/1reu9ld/aita_for_telling_i_have_zero_need_for_a_gift_i/",
        "body_summary": "Before I tell what happened I must give some context. My grandmother has always given me, and members of my family expensive gifts. Gifts none of us ask for. My 16y old female cousin received a very expensive designer handbag (which she doesn't wear), my other cousin, a boy received an expensive watch, which he neither asked for, or wears. I think she wants to buy appreciation or respect, instead of earning it through love and being a good grandmother.\n\nI say this because today I had invited the whole family over for dinner. I had just returned from abroad and wanted to celebrate my homecoming. She shows up first, while the food is still cooking, and begins talking while I'm in the middle of preparations. She takes out an electric toothbrush of all things and hands it over to me as a gift....",
        "reddit_judgments": {
            "YTA": 121,
            "NTA": 7,
            "ESH": 3,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 133
        },
        "total_judged": 133,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-02-26T05:52:35.103309"
    },
    {
        "id": "1redlag",
        "title": "AITA for not helping my mom pay for a house she bought that she cant afford",
        "url": "/r/AmItheAsshole/comments/1redlag/aita_for_not_helping_my_mom_pay_for_a_house_she/",
        "body_summary": "Hi everyone. After I graduated from college, my mom bought a house and pressured me to move in with her. I didn’t grow up living with her I lived with my dad but things seemed fine at first. I mostly keep to myself and pay all my own expenses, including food, insurance, and my car note; I try to stay out of the way.\n\nHowever, she has recently started asking me for large, random sums of money anywhere from $700 to $1,000 at a time and says she will pay me back but never does . When I decline, she gets angry. She claims she can’t afford her house or even basic necessities like food. She is in major debt apparently. I would have no problem helping out here and there. but its always theses large amounts that come out of the blue that im not ready for.\n\nAITA for not giving her money when she ne...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 23,
            "ESH": 2,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-26T05:52:42.636620"
    }
]