[
    {
        "id": "1q8yqn3",
        "title": "AITA for changing the lock on my bedroom in a shared apartment without my roommate’s permission?",
        "url": "/r/AmItheAsshole/comments/1q8yqn3/aita_for_changing_the_lock_on_my_bedroom_in_a/",
        "body_summary": "I’ve been sharing an apartment with another woman for about three months now. We didn’t know each other well before moving in, but we had a mutual friend. She actually asked me to move in because her previous roommate was leaving, and at the time I was really struggling to find a place. I had checked a lot of rooms, but either they were too expensive or just didn’t feel right. When she offered, I went to see the apartment and agreed pretty quickly.\n\nAt the beginning, she was very nice, and honestly I felt grateful because she helped me when I needed a place. Because of that, I ignored a lot of small things. She would come into my room without asking, lie on my bed, walk around the apartment barefoot and then sit on my bed with the same feet. She also helped herself to my snacks and used my...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 53,
            "ESH": 1,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 60
        },
        "total_judged": 60,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-11T05:18:13.905985"
    },
    {
        "id": "1q909gi",
        "title": "AITA? Sister trying to make me give her my meds",
        "url": "/r/AmItheAsshole/comments/1q909gi/aita_sister_trying_to_make_me_give_her_my_meds/",
        "body_summary": "So I had surgery on my hand because of messed up tendons or whatever. During my recovery I was given, along side some other medication, a bottle with 3 pills of oxycodone, with the instructions if that if the painkillers don’t work, to take half a tablet, with one dose being the maximum for a whole day. After my recovery, I was talking with my mom about the surgery and my sister walked in and asked for the oxycodone because I didn’t need it anymore, I said no, and then she demanded for it, I said no, again, she said her bf had chronic pain and needed it, I said that if he had such bad pain he needed oxycodone he should go to the hospital. She stormed out of the room and slammed her bedroom door and I heard her talking with her boyfriend. I bought a safe and put the oxycodone in it to keep ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 88,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 92
        },
        "total_judged": 92,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-11T05:18:31.135274"
    },
    {
        "id": "1q942j8",
        "title": "WIBTA for saying something after my partner ate my chocolate then were reluctant to share theirs?",
        "url": "/r/AmItheAsshole/comments/1q942j8/wibta_for_saying_something_after_my_partner_ate/",
        "body_summary": "This is such a small silly thing that I feel like I'm being dramatic for being bothered by it.\n\nSituation is, my partner has a medical condition. There is a small amount of data that suggests dark chocolate might help with their symptoms.\n\nI had about half a bar of nice chilli-flavoured dark chocolate which I only allow myself to buy while it's on offer, because otherwise it's pretty expensive. It was in the front pocket of a bag we both had clothes in from an overnight trip. I'd found it on offer in a supermarket where we were staying on that trip.\n\nLast night, my partner informed me they'd finished the bar of chocolate, apologised, and said they'd get me a new bar the next morning (this morning) on their walk. This morning, they came back with several bars of dark chocolate, but not the ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 70,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-11T05:18:47.451898"
    },
    {
        "id": "1q8wrv2",
        "title": "AITA for telling my husband he is being a bad father to our son by favoring our daughter over our son because of school grades",
        "url": "/r/AmItheAsshole/comments/1q8wrv2/aita_for_telling_my_husband_he_is_being_a_bad/",
        "body_summary": "Hi, my heart's been a bit heavy all day and I wanted to know if I was in the wrong. My husband and I have been married for 16 years, we have a 15 year old son and a 12 year old daughter. \n\nMy husband has always placed a very high premium on book smarts, I know this because when I was first pregnant and relatives had asked whether we were hoping for a boy or a girl, he had joked at the time that he didn't care about the child's gender as long as they were intelligent. It was a joke and I probably found it amusing at the time but it's seared in my mind and I still bring it up to him when we argue about the following issue.\n\nOur son gets average scores in school when it comes to science and math. He scores well in english thats his only 80%+ mark, in the others its middling scores. He's a gre...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 60,
            "ESH": 3,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 68
        },
        "total_judged": 68,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-11T05:19:03.742031"
    },
    {
        "id": "1q94tm0",
        "title": "AITAH for stopping by at my friend's place quickly to grab something I left there?",
        "url": "/r/AmItheAsshole/comments/1q94tm0/aitah_for_stopping_by_at_my_friends_place_quickly/",
        "body_summary": "Hey everyone. So I'm not sure about this situation and need some input. \n\nI recently had to stay at a friend's house over the weekend and earlier this week. I thankfully found a room to rent so I left Tuesday night. While grabbing my stuff from her place, I accidentally left my rice cooker there. We finally coordinated for me to grab it this evening, Friday, at 5:30pm. She had a friend over and was watching a football game. I parked in an illegal spot with my hazards on and had to just get in and get out. I knocked on her door twice, greeted her, met her friend, and told them I couldn't stay long because of the parking situation. I told her this twice while I was there and apologized both times. I told them before I left that it was nice meeting her friend, to have fun watching the game, a...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 20,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-11T05:19:19.499580"
    },
    {
        "id": "1q93uhx",
        "title": "WIBTA If I refuse to take money to use when I take my neice out for a fun activity if it causes me to have to include someone I realy don't want to.",
        "url": "/r/AmItheAsshole/comments/1q93uhx/wibta_if_i_refuse_to_take_money_to_use_when_i/",
        "body_summary": "I(M-35) have made plans to take my Neice (F-5) out for some fun activities, including pottery painting and lunch. I just want it to be a Funcle (Fun Uncle) and Neice day. \n\nMy mother is willing to give me money for it but I have to include something for my brother's (M-32) girlfrends daughter (F-6). I know it would not be reciprocated in future, this thought has been shown in the past to be ture. \n\nI do have the funds to easly plan and do the activates I have planed for my neice so I don't need the money and my mother was just trying to be nice but was also putting strings on it.\n\nI really want this to just be about me (Funcle) and my niece as she doesn't really get to have her own fun without someone else having to be included.\n\nSo WIBTA refuse the money to have a truly 100% Funcle and Ne...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 17,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-11T05:19:35.397353"
    },
    {
        "id": "1q91gxa",
        "title": "AITA for asking my roommate to be more considerate about her personal life while living together??",
        "url": "/r/AmItheAsshole/comments/1q91gxa/aita_for_asking_my_roommate_to_be_more/",
        "body_summary": "I (21F) live with my roommate (22F), we split rent, and walls are thin af. She’s got a new boyfriend and he’s over basically every night. They’r EXTREMELY loud. Like porn soundtrack loud.\n\nI’ve asked her multiple times to keep it down, especially on work nights and she won’t listen, she pretty much laughs it off. Last week they woke me up at 2am before a 6am shift and that pretty much sent me over the edge. I knocked on her door, her boyfriend opened the door half naked, smirked awkwardly but in a way where he didn’t really care??said that “they’ll try.” And it got way louder.\n\nThe next day I told her if he’s gonna pretty much live here and ruin my sleep, she needs to chill, see him less, or pay more rent because at this point it’s really draining. She didnt really care but when i persiste...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 27,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-11T05:19:51.742276"
    },
    {
        "id": "1q94fp3",
        "title": "AITA for spending the hotel money because my friends don’t have enough to help me out",
        "url": "/r/AmItheAsshole/comments/1q94fp3/aita_for_spending_the_hotel_money_because_my/",
        "body_summary": "My (F22) friends(22F, 22F) and I have been friends for 4-6 years and have had a great time at concerts.\n\nThey only work part time while I work full time. We’ve been preparing for this concert since October. I’ve told them that I would be moving to a hotel because our apartments would be renovated and lo behold we were at the hotel until January.\n\n\nI’m the only one who knows how to drive and I’ve noticed a pattern of them not helping with gas or if they want to go to a store helping with the parking cost. Last time I paid all most $900 and it took them all most a month to pay me back for the hotel. Since I’m the only one who’s drives I’m always tired when we get to the hotel (OR to Seattle and more driving if they want to go somewhere)\n\nIn January we moved back to my apartments and I’ve let...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 13,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 16
        },
        "total_judged": 16,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-11T05:20:07.448715"
    },
    {
        "id": "1q90zid",
        "title": "AITA for not chatting when I’m poorly with chest infection and lost my voice?",
        "url": "/r/AmItheAsshole/comments/1q90zid/aita_for_not_chatting_when_im_poorly_with_chest/",
        "body_summary": "Been poorly since Xmas with nasty flu and chest infection. On my 3rd round of steroids for my chest plus inhalers. Yesterday after a long day at work (wfh) my voice had given up and I can hardly speak. My boyfriend came home around 6.30pm having finished work at 3 then been to the pub. He was chatty and wanted me to chat back. I said as best I could, I’m losing my voice and feel terrible I just want to sit quietly tonight and try to recover. He is angry at me and kicked off that I don’t care, don’t want to make conversation and am uninterested. It ended in a row and him sleeping on the couch. I’m too poorly to really care right now but I think he is being terribly unfair. I literally have no voice to chat! \nThis morning my voice is totally gone and he still persistently is asking me questi...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 17,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 17
        },
        "total_judged": 17,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-11T05:20:23.033364"
    },
    {
        "id": "1q92u6z",
        "title": "WIBTA if I tell my mom I don't want my grandmother using my room?",
        "url": "/r/AmItheAsshole/comments/1q92u6z/wibta_if_i_tell_my_mom_i_dont_want_my_grandmother/",
        "body_summary": "So basically, I(14F) have been pretty upset lately. My grandmother (from my dads side) is coming over from overseas on the 20th of January for 4 whole months, and she will be taking my room. My mom told me this around late December, and I have always been expressing my dislike for it, because my room is my safe space and my mom knows that.\n\nDuring my grandmothers stay, I will be sleeping in my parents room and my mom has already set up a bed for me (she even made me help with setting the bed up in her bedroom). Not only that but for the past few months I have asked for a new mattress as our cat peed on mine, staining it, and all my mom has done was pull out the stench remover and the mediocre stain remover and basically told me to just deal with it, not only that but my mattress is very ol...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 26,
            "ESH": 1,
            "NAH": 5,
            "INFO": 2,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-11T05:20:39.020680"
    }
]