[
    {
        "id": "1jt7ogm",
        "title": "AITA for not buying my stepdaughter a new car after she's repeatedly gotten into accidents?",
        "url": "/r/AmItheAsshole/comments/1jt7ogm/aita_for_not_buying_my_stepdaughter_a_new_car/",
        "body_summary": "OP's stepdaughter, a reportedly bad driver, totaled her third car. She asked OP & husband to help buy a new one. OP's husband wants to, but OP refuses, citing precedent and financial concerns, suggesting walking/rideshare instead. AITA?\n...",
        "reddit_judgments": {
            "YTA": 45,
            "NTA": 20,
            "ESH": 0,
            "NAH": 5,
            "INFO": 3,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:50:00.754522"
    },
    {
        "id": "1jt74ox",
        "title": "AITA for how I explained to SIL that she wouldn't be my son's godmother?",
        "url": "/r/AmItheAsshole/comments/1jt74ox/aita_for_how_i_explained_to_sil_that_she_wouldnt/",
        "body_summary": "OP and wife chose godparents for their son: OP's brother (BF), wife's cousin (GF). SIL (BF's wife) assumed she'd be chosen with BF. OP explained their rationale (avoiding divorced godparent scenario), inadvertently offending SIL. SIL is now angry. AITA?\n...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 46,
            "ESH": 7,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 67
        },
        "total_judged": 67,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:02.173131"
    },
    {
        "id": "1jt0s1f",
        "title": "AITA for canceling my mom’s surprise farewell dinner because she called me messy?",
        "url": "/r/AmItheAsshole/comments/1jt0s1f/aita_for_canceling_my_moms_surprise_farewell/",
        "body_summary": "OP planned a surprise party for her mom who is moving. After an argument over OP's mess, Mom insulted OP. OP canceled the party in anger after mom said she wasn't going. Mom then changed her mind. OP refused, leaving. AITA for canceling?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 39,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 41
        },
        "total_judged": 41,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:03.384744"
    },
    {
        "id": "1jt9ifz",
        "title": "AITA for playing volleyball in the day of my sister's wedding?",
        "url": "/r/AmItheAsshole/comments/1jt9ifz/aita_for_playing_volleyball_in_the_day_of_my/",
        "body_summary": "OP (18F) played in a volleyball match on her sister's (24F) wedding day. Relatives chose to attend the game. Sister is upset, feeling OP stole her spotlight by playing and discussing it. OP asks AITA for playing and talking about the game.\n...",
        "reddit_judgments": {
            "YTA": 72,
            "NTA": 62,
            "ESH": 6,
            "NAH": 9,
            "INFO": 0,
            "TotalJudged": 149
        },
        "total_judged": 149,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:50:06.386492"
    },
    {
        "id": "1jtl8ua",
        "title": "AITA for sending my niece back home after lying multiple times and smoking in my home?",
        "url": "/r/AmItheAsshole/comments/1jtl8ua/aita_for_sending_my_niece_back_home_after_lying/",
        "body_summary": "OP and husband agreed to host niece with clear rules: no drugs. Niece broke rules, lied about vaping. OP's SIL didn't support them. They sent niece home. Now niece hates OP. AITA for sending her home after she broke rules?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 25,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:07.566222"
    },
    {
        "id": "1jtg6xv",
        "title": "AITA for refusing to keep sending money for my partner’s family",
        "url": "/r/AmItheAsshole/comments/1jtg6xv/aita_for_refusing_to_keep_sending_money_for_my/",
        "body_summary": "OP's partner's family constantly asks for money despite being repaid for a past loan. OP is financially strained and wants to set boundaries, but the partner refuses and suggests separating finances. AITA for refusing to send more money?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 27,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 29
        },
        "total_judged": 29,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:08.677092"
    },
    {
        "id": "1jt47m8",
        "title": "AITA for how I responded to my friend’s mom asking for more money after I already paid what she had said I owed her?",
        "url": "/r/AmItheAsshole/comments/1jt47m8/aita_for_how_i_responded_to_my_friends_mom_asking/",
        "body_summary": "OP paid $280 before moving out of shared housing. Now, housemate's mom asks for more utility money. OP refuses, citing absence and prior payment. They argue. AITA for refusing and OP's replies?\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 13,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 24
        },
        "total_judged": 24,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:09.768113"
    },
    {
        "id": "1jt8t6i",
        "title": "AITA for refusing to take care of my ex’s dog even though I was the one who originally adopted him?",
        "url": "/r/AmItheAsshole/comments/1jt8t6i/aita_for_refusing_to_take_care_of_my_exs_dog_even/",
        "body_summary": "OP gave his dog to his ex after their breakup. Now, facing hardship, she wants OP to temporarily take Max back. OP refused due to his living situation and work. Ex is upset. AITA for refusing?\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 37,
            "ESH": 0,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:10.938641"
    },
    {
        "id": "1jtcizm",
        "title": "AITA for not sharing my savings account",
        "url": "/r/AmItheAsshole/comments/1jtcizm/aita_for_not_sharing_my_savings_account/",
        "body_summary": "I’m not a big writer, but basically one of my family members is upset with me because I have grown a savings account & they feel like I should be helping them. Mind you they are older than me. Has a steady job and all. They want to spend their money on new vehicles and gadgets. I’m saving to buy my first house. But im over here being guilt tripped. ",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 39,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:11.339918"
    },
    {
        "id": "1jtmfwg",
        "title": "AITA for taking over my parents’ condo and offering to give my siblings today’s value when I sell it?",
        "url": "/r/AmItheAsshole/comments/1jtmfwg/aita_for_taking_over_my_parents_condo_and/",
        "body_summary": "OP took over parents' condo mortgage/upkeep, promising siblings their share of today's value upon future sale. Siblings think this is unfair, wanting a lower purchase price. OP asks AITA for managing the condo and offering current value share.\n...",
        "reddit_judgments": {
            "YTA": 46,
            "NTA": 9,
            "ESH": 0,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:50:13.284018"
    },
    {
        "id": "1jt00a7",
        "title": "AITA for not going to my grandma's 85th birthdaydinner probably 2 weeks to a month postpartum?",
        "url": "/r/AmItheAsshole/comments/1jt00a7/aita_for_not_going_to_my_grandmas_85th/",
        "body_summary": "OP, pregnant & due ~1mo before grandma's 85th, doesn't want to attend due to postpartum recovery/baby's health. Mom says OP's being unreasonable (\"back in the day\"). AITA for setting this boundary?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 49,
            "ESH": 0,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 58
        },
        "total_judged": 58,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:15.649505"
    },
    {
        "id": "1jte15o",
        "title": "WIBTA If I asked my friends to pay the full amount?",
        "url": "/r/AmItheAsshole/comments/1jte15o/wibta_if_i_asked_my_friends_to_pay_the_full_amount/",
        "body_summary": "OP paid for a group dinner (KBBQ) excluding birthday people, wife, and themself. A couple paid less, claiming they only had shots. OP suspects they ate food too & saw they went out after. Should OP ask them for the remaining amount, given wedding costs but later outing?\n...",
        "reddit_judgments": {
            "YTA": 16,
            "NTA": 40,
            "ESH": 3,
            "NAH": 3,
            "INFO": 4,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:17.907871"
    },
    {
        "id": "1jtfwsc",
        "title": "AITA for not including my husbands siblings in life events for our kids?",
        "url": "/r/AmItheAsshole/comments/1jtfwsc/aita_for_not_including_my_husbands_siblings_in/",
        "body_summary": "To give some background My husband (m34) and I (f35) went no contact with my husbands parents about 8 months ago. The first 4 months we were just “taking space” sparked by a phone call we had with them. They opened the door on the phone call and said, “ I hope if there is anything we have done to hurt you we can talk about it in the moment” my husband has been extremely hurt by many of their actions and he took the opportunity to try to express those in a calm environment. (My husband grew up in a house where he always felt he had to tiptoe around his Moms mood and his Dad would defend that. When I married into the family I was all but told who I should like in the family and who I shouldn’t if I was going to make his mom like me.) \n \nAnyway, he told them about some past ways he had been h...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 18,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:28.365991"
    },
    {
        "id": "1jtkwl8",
        "title": "AITA Mom wants me to give her money she gifted me back",
        "url": "/r/AmItheAsshole/comments/1jtkwl8/aita_mom_wants_me_to_give_her_money_she_gifted_me/",
        "body_summary": "A few weeks ago, my mom came into a large sum of money and gifted both my sister and me a portion of it. For context, we grew up with very little money, so this was a huge deal for us. She gave me $40K.\n\nI live independently and have a significant amount of debt, so I met with an accountant to figure out the best way to use the money mainly to pay off debt or put it toward buying a condo, since housing is the main priority for me. I’ve already used some of the money to pay down debt that was in collections and to begin going to school. \n\nNow, my mom is asking me to give $8K of it back because she is saying she needs to pay more expenses which doesn’t make sense to me. \n\nMy mom is extremely emotional and can be aggressive. I suspect she has undiagnosed BPD. She’s lashed out at me in the pas...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 19,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:50:38.831311"
    },
    {
        "id": "1jt1okq",
        "title": "AITA for lying to my family so I don’t have to help my sick grandmother?",
        "url": "/r/AmItheAsshole/comments/1jt1okq/aita_for_lying_to_my_family_so_i_dont_have_to/",
        "body_summary": "I (30F) was asked to help my grandma move from her old house into a 1 bedroom apartment in a senior community. She is in her 80s, not in great health, and her house is about to be condemned by the city because she didn’t take care of it over the decades. \n\nShe’s also an asshole whom I haven’t spoken to in over a decade because she abused and neglected my father so bad that he now has severe mental and physical health conditions that are directly caused from her mistreatment of him during his childhood and adolescent years. \n\nAnyway, my mom asked me to help move my grandma and I vaguely agreed that I would show up this weekend to help out. The only reason I said yes is because it was my mom that was asking. \n\nHOWEVER, I have just now flat out lied to my mom feigning a “pet emergency” so I d...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 6,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:50:49.403117"
    },
    {
        "id": "1jti7gp",
        "title": "AITA for getting mad about my MIL coming to stay with us for 4 days?",
        "url": "/r/AmItheAsshole/comments/1jti7gp/aita_for_getting_mad_about_my_mil_coming_to_stay/",
        "body_summary": "OP's BF invited his mom to stay in their small trailer during OP's work week. OP is upset about lack of space/privacy, mom's dislike of dogs, & hiding their smoking. BF works long hours; mom is lonely. AITA for wanting BF to cancel the visit?\n...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 56,
            "ESH": 6,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 78
        },
        "total_judged": 78,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:51:01.749067"
    },
    {
        "id": "1jtm96u",
        "title": "AITA for ditching my dad’s funeral?",
        "url": "/r/AmItheAsshole/comments/1jtm96u/aita_for_ditching_my_dads_funeral/",
        "body_summary": "OP, 13F, whose dad recently died, skipped his funeral mid-speech due to his abusive behavior towards her and her family. He provided financially but was emotionally neglectful. Now, her mom and sisters are angry. AITA?\n...",
        "reddit_judgments": {
            "YTA": 9,
            "NTA": 50,
            "ESH": 0,
            "NAH": 13,
            "INFO": 0,
            "TotalJudged": 72
        },
        "total_judged": 72,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:51:03.178446"
    },
    {
        "id": "1jsxvup",
        "title": "AITA If I ignored my uncle on my Birthday Trip?",
        "url": "/r/AmItheAsshole/comments/1jsxvup/aita_if_i_ignored_my_uncle_on_my_birthday_trip/",
        "body_summary": "OP (18M, trans) wants to attend Supercon alone. Mom insists someone accompany him for safety, then invites transphobic uncle. OP doesn't want him there and threatens to ditch him if he's offensive. AITA for ignoring uncle the whole trip to avoid confrontation and potential misgendering?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:51:04.063822"
    },
    {
        "id": "1jtfo72",
        "title": "WIBTA If I told my friend to stop bringing his girlfriend to everything we do",
        "url": "/r/AmItheAsshole/comments/1jtfo72/wibta_if_i_told_my_friend_to_stop_bringing_his/",
        "body_summary": "OP wants alone time with his best friend, but the friend always brings his girlfriend. OP feels third-wheeled and that his friend prioritizes her, even when it inconveniences OP. OP asks: AITA for requesting friend stop bringing girlfriend to hangouts so they can have a day alone?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 14,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 14
        },
        "total_judged": 14,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:51:05.055337"
    },
    {
        "id": "1jt9zcv",
        "title": "AITA for refusing to meet my (36F)BFF's new boyfriend (40m)",
        "url": "/r/AmItheAsshole/comments/1jt9zcv/aita_for_refusing_to_meet_my_36fbffs_new/",
        "body_summary": "OP's friend jumps into relationships after a bad breakup. Now, friend's dating James, who \"does A LOT of cocaine.\" OP's moving closer, doesn't want to meet James, fearing his influence. AITA for refusing to meet her BF?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:51:06.044079"
    }
]