[
    {
        "id": "1msu3it",
        "title": "AITA for calling my husband an idiot because he keeps saying that I'm allowing my pregnancy rhinitis to ruin everything ?f",
        "url": "/r/AmItheAsshole/comments/1msu3it/aita_for_calling_my_husband_an_idiot_because_he/",
        "body_summary": "I (25f) am pregnant and I have pregnancy rhinitis. It feels like I have a permanent head cold. Yesterday, my husband (27m) wanted to hang out with me. He tried to get me to play video games. \n\nI played but I wasn't very enthusiastic. He tried to talk to me but I was so congested. He got frustrated with me and he repeated that I'm allowing my pregnancy rhinitis to ruin everything. I called him an idiot and I told him he can only criticize my attitude when he goes through pregnancy. He called me a big jerk. Am I the asshole ?",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 112,
            "ESH": 6,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 124
        },
        "total_judged": 124,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-18T05:16:38.194046"
    },
    {
        "id": "1mspbaw",
        "title": "AITA for asking my roommates to wait before they shower?",
        "url": "/r/AmItheAsshole/comments/1mspbaw/aita_for_asking_my_roommates_to_wait_before_they/",
        "body_summary": "OP has roommates in her flat, following rules she set. Mary broke the shower rule, causing OP cold water. OP confronted Mary, who called her controlling. OP asks if she's the asshole for enforcing the rule.\n...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 70,
            "ESH": 1,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-18T05:16:40.180099"
    },
    {
        "id": "1msm9ag",
        "title": "AITA for faking my orientation so my mom would let me read what I want?",
        "url": "/r/AmItheAsshole/comments/1msm9ag/aita_for_faking_my_orientation_so_my_mom_would/",
        "body_summary": "OP (16M) wants to read romance novels for English test prep, but his mom disapproved, fearing they'd negatively influence his behavior towards women. To appease her, OP implied he was gay. Now his mom allows him to read the books, but OP feels guilty for the lie. AITA?\n...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 37,
            "ESH": 8,
            "NAH": 4,
            "INFO": 3,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-18T05:16:41.815906"
    },
    {
        "id": "1mt2lye",
        "title": "Update- AITA for correcting my MIL at a family gathering that she didn't recommend my daughter's name, it was my favorite name",
        "url": "/r/AmItheAsshole/comments/1mt2lye/update_aita_for_correcting_my_mil_at_a_family/",
        "body_summary": "OP corrected MIL after MIL claimed to suggest OP's daughter's name. MIL complained to husband, so OP called MIL. OP explained the name's personal significance. MIL reiterated love for granddaughter. OP asks if she handled the situation well.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 4,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 6
        },
        "total_judged": 6,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2025-08-18T05:16:43.147651"
    },
    {
        "id": "1mt0mqm",
        "title": "AITA for telling my roommate’s boyfriend he has to pay £100 toward utilities or move out after his “one-week” stay hit five weeks?",
        "url": "/r/AmItheAsshole/comments/1mt0mqm/aita_for_telling_my_roommates_boyfriend_he_has_to/",
        "body_summary": "OP's roommate's BF has overstayed, using OP's utilities/food. OP asked for £100 and for him to stop using their belongings. BF refused, roommate defended him. OP issued a \"pay or leave\" ultimatum. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 77,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 79
        },
        "total_judged": 79,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-18T05:16:44.524869"
    },
    {
        "id": "1msup8f",
        "title": "AITA for telling my mom I won’t go on the “Christmas gift” trip if my siblings have to cover my flight?",
        "url": "/r/AmItheAsshole/comments/1msup8f/aita_for_telling_my_mom_i_wont_go_on_the/",
        "body_summary": "OP's parents planned a family trip but changed the terms. The dad refuses to fly, forcing a long drive. The mom now wants the kids to pay for their flights or drive. OP can't drive due to motion sickness. The mom expects the siblings to cover OP's ticket, calling OP \"ungrateful\" for considering not going. AITA for not wanting siblings to pay?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 115,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 118
        },
        "total_judged": 118,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-18T05:16:47.467253"
    },
    {
        "id": "1mtarwm",
        "title": "AITA for telling my bestfriend I understood why his fiancee is so disappointed that he proposed to her at the gym ?",
        "url": "/r/AmItheAsshole/comments/1mtarwm/aita_for_telling_my_bestfriend_i_understood_why/",
        "body_summary": "OP's best friend proposed at the gym, and his fiancee seemed unhappy. He vented to OP, who said she wouldn't like that either. The friend called OP shallow & a bad friend. AITA?\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 48,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 51
        },
        "total_judged": 51,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-18T05:16:48.724953"
    },
    {
        "id": "1mt5yg2",
        "title": "AITA for ignoring my friend’s work messages while I’m on maternity leave?",
        "url": "/r/AmItheAsshole/comments/1mt5yg2/aita_for_ignoring_my_friends_work_messages_while/",
        "body_summary": "OP's friend took over OP's social media job while OP's on maternity leave. The friend constantly messages OP about work and asks for help, even during visits. OP ignores work-related messages now to protect their leave, but wonders if AITA for not being supportive.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 22,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-18T05:16:49.714928"
    },
    {
        "id": "1mt7d3i",
        "title": "WIBTA for refusing to wake up early so my sister can go to therapy in a different room?",
        "url": "/r/AmItheAsshole/comments/1mt7d3i/wibta_for_refusing_to_wake_up_early_so_my_sister/",
        "body_summary": "OP (NB) wants to sleep in while their twin (F) has therapy in the study. The twin wants OP to wake up early and wear headphones, even though the rooms are separate and OP would likely be asleep. OP asks AITA for not wanting to wake up early.\n...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 61,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 71
        },
        "total_judged": 71,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-18T05:16:51.267911"
    },
    {
        "id": "1mt4u5n",
        "title": "AITAH for not treating my step siblings the same as my actual siblings ?",
        "url": "/r/AmItheAsshole/comments/1mt4u5n/aitah_for_not_treating_my_step_siblings_the_same/",
        "body_summary": "OP secretly saved money for his siblings, to be used at 18. He's upset they now plan to use it on family expenses due to pressure from his dad and stepmom, who feel OP favors his siblings over his stepsiblings. OP asks AITA for not supporting his stepsiblings financially.\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 35,
            "ESH": 1,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 46
        },
        "total_judged": 46,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-08-18T05:16:53.029476"
    }
]