[
    {
        "id": "1qg7sf3",
        "title": "AITA for refusing to give my parents my location after they stopped paying for my tuition?",
        "url": "/r/AmItheAsshole/comments/1qg7sf3/aita_for_refusing_to_give_my_parents_my_location/",
        "body_summary": "I [19F] am a sophomore in college. Until last semester my parents were paying for about 3/4 of my tuition and my housing. However they insisted I used the Life360 app showing my location to them at all times. It wasnt optimal but I figured its up to them since theyre paying for me. \n\nOver the holidays however my dad and I had a huge argument because I changed my major from Biology to Nursing. He told me I was throwing away a bigger opportunity but I feel like i can help more people this way. \n\nSince then Ive had to start working two jobs and take out multiple student loans. I pay for everything now, my parents give me $0.\n\nAnyways, last weekend I went on a roadtrip to another state and my mom started texting me non stop, demanding to know why i was in another state. I had forgotten about t...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 133,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-19T05:24:40.355676"
    },
    {
        "id": "1qg5w0m",
        "title": "AITA for not allowing my fiancé's family dictate my baby's life before it's even born...",
        "url": "/r/AmItheAsshole/comments/1qg5w0m/aita_for_not_allowing_my_fiancés_family_dictate/",
        "body_summary": "My fiancé (26 Male) and I (27 Female) have been engaged since the 16th of December 2025. Being of African culture, he made his way to my home to negotiate \"lobola\" (bride price), and all went well. \n\nI've met my soon-to-be SIL way before us getting engaged, she was kind, welcoming and seemed to be loving... Fast forward to the 30th of December 2025, I fly back to Gauteng from Eastern Cape to be with my fiancé. The next day we get an invite from my fiancé's mom for a New Years day lunch on the 1st of Jan and we accept. That same day, my fiancé took me to the hospital because I had a bad case of the flu and he didn't like that I wasn't getting much better. During that doctor's consultation, we find out that we're pregnant and are 5 months pregnant (I guess I'm one of the lucky ones who didn'...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 54,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-19T05:24:56.232481"
    },
    {
        "id": "1qgeatx",
        "title": "AITA for not giving my sister my old game console even tho she really wants it for her kid?",
        "url": "/r/AmItheAsshole/comments/1qgeatx/aita_for_not_giving_my_sister_my_old_game_console/",
        "body_summary": "\nkay so this is kinda dumb but its causing a huge fight.\n\nI have an original Nintendo Switch I bought like the year it came out. Its not even the cool new OLED one. But its special to me cause i saved up for it working a shitty part time job in college and me and my old roommates played smash and zelda on it for literally hundreds of hours. Its got stickers on it and the left joycon drifts a little but it works fine. I don’t really use it much now since i have a PS5 but i keep it on a shelf in my office mostly for nostalgia.\n\nMy sister (35f) has a 7 year old son, my nephew. He’s a good kid. Her husband lost his job last year and things have been tight for them, which i know and i help out sometimes like buying the kid cool birthday gifts or taking them out for dinner.\n\nLast weekend they we...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 121,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 131
        },
        "total_judged": 131,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-19T05:25:12.925991"
    },
    {
        "id": "1qgcng2",
        "title": "AITA for making a girl cry at my work?",
        "url": "/r/AmItheAsshole/comments/1qgcng2/aita_for_making_a_girl_cry_at_my_work/",
        "body_summary": "So I work at a grocery store, and I used to work as a courtesy clerk, which basically involved janitorial duties. I am a cashier now, but I still face the store before closing when it is not busy. I finished facing and cleaned my register early, and I noticed this girl, who has been working at the store for a few months as a courtesy clerk, was falling behind on her duties because she was yapping with the self-checkout guy all shift long. I told her 3 times specifically that I would do the manager's office trash to help out, keywords: manager's office. So I took out the manager's trash and finished that an hour before close, and I started doing other tasks like cleaning the back bathrooms of the store, since no one does that, cleaning the break room, and taking out the specific trash cans ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 17,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 18
        },
        "total_judged": 18,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-19T05:25:28.407430"
    },
    {
        "id": "1qgckrg",
        "title": "AITA for not letting my girlfriend's mother into my apartment?",
        "url": "/r/AmItheAsshole/comments/1qgckrg/aita_for_not_letting_my_girlfriends_mother_into/",
        "body_summary": "My girlfriend and I have been together for almost five years. We started dating in high school when we were 15. We're now 19 and live together in my apartment. Recently, her mother decided to visit us, but I told her I didn't want her in my apartment. Just so you understand, this woman has been ruining our lives and our relationship the entire time my GF and I were together. She forbade us from seeing each other, so my girlfriend had to lie and say she was going to see her friends so we could see each other. She hated me for no reason, saying I am crazy because I dyed my hair black and that I had mental issues because I didn't smile in photos. You know, this is complete nonsense. I'm not a junkie or a freak. I come from a normal family, I'm finishing college and have a well-paying job, but...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 13,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-19T05:25:44.129206"
    },
    {
        "id": "1qg24zb",
        "title": "AITA for saying something about my bf’s choice of restaurant?",
        "url": "/r/AmItheAsshole/comments/1qg24zb/aita_for_saying_something_about_my_bfs_choice_of/",
        "body_summary": "We’re both mid-20s and have been dating for a few years. This blew up into a bigger fight than I ever intended it to be. I’m posting mostly because I was so sure of myself at the time, but looking back now I’m really questioning if I should’ve kept my mouth shut. \n\nThis new restaurant recently opened up by our house and it’s all the rave around town. We had talked about trying it together but it’s hard because we only have 1 common day off (Sunday). Football has been on and we usually spend the whole day lounging. It just hadn’t panned out yet. \n\nTonight he texted me while I was at work that he and his parents were trying the restaurant. I texted back and said “you’re going to the place I wanted to try with you?” Then I sent another text that read “Wtf”\n\nSome context here, he has a history...",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 51,
            "ESH": 10,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 81
        },
        "total_judged": 81,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-19T05:26:00.149641"
    },
    {
        "id": "1qgalfx",
        "title": "WIBTAH if I lied to my parents about having a wedding ceremony and reception to keep them from attending/feeling left out?",
        "url": "/r/AmItheAsshole/comments/1qgalfx/wibtah_if_i_lied_to_my_parents_about_having_a/",
        "body_summary": "My girlfriend Tamara \\[F27\\] and I \\[M29\\] have been talking about marriage, which always leads back to thoughts about my parents \\[F60+, M60+\\]. We're close all things considered. We exchange gifts, check in on each other, and they invite me on vacations.\n\nMy parents are traditional Christians--not in the \"women must wear dresses\" way but in the \"gay and transgender people are immoral\" way.\n\nThis is relevant because I'm a transgender man. This isn't new to them. I've been \"socially out\" since childhood and medically transitioned as soon as possible. They believe I've damaged my body and am a confused woman, and to not feed into delusion they call me she/my birth name. Since I am dating a woman I am also gay in their eyes. To paraphrase my dad, \"the first one you're doing because you are a...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 47,
            "ESH": 3,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-19T05:26:16.309337"
    },
    {
        "id": "1qgett2",
        "title": "AITA for saying no when my coworker asked to switch shifts again?",
        "url": "/r/AmItheAsshole/comments/1qgett2/aita_for_saying_no_when_my_coworker_asked_to/",
        "body_summary": "so i work part time at a retail job while im in school. it’s nothing serious but it helps pay for stuff and i try to keep my schedule pretty organized.\n\none of my coworkers has asked me to switch shifts with them a lot over the past few months. at first i didn’t really mind. if i was free i’d just say yes and move things around.\n\nbut lately it’s been happening almost every week. sometimes they’ll ask the night before or the morning of and i already planned my homework or other stuff around my shift.\n\nlast week they asked again and i said no. i told them i just really need my schedule to stay more stable because switching all the time has been stressing me out.\n\nthey didn’t get mad but they were clearly annoyed and said something like “ok i’ll figure it out.” since then things at work have ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 36,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-19T05:26:31.909649"
    },
    {
        "id": "1qg5jey",
        "title": "AITA/ For not sharing gifted funds",
        "url": "/r/AmItheAsshole/comments/1qg5jey/aita_for_not_sharing_gifted_funds/",
        "body_summary": "I (33F) am a single mother with 2 boys (10y/o & 5y/o). I have no one to help me at home. ex hub apparently quit his job in Aug & he quit paying all his bills. my oldest (\"A\") was sent to St Jude on 11-19 (I rode with my ex & \"A\", which was a 9 hr drive) & diagnosed with cancer on 12-1. my friend started a gofundme on 11-20 to help relieve the financial burden I was about to go through. my ex (33M) lives with his gf, their son, and her entire immediate family (mother, brothers, sisters, in laws). my ex has made small comments about his bills- a car payment ($900/mo) & $300/m to his gf's mom. his gf has msgd me, cussing & blaming me for their car being up for repo bc I won't share the money raised on the GFM to pay a car note that was already 4mo behind before \"A\" was even diagnosed. His dad...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 13,
            "ESH": 5,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 22
        },
        "total_judged": 22,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-01-19T05:26:47.446226"
    },
    {
        "id": "1qge2dx",
        "title": "AITAH for refusing to put my landlords furniture in the shed?",
        "url": "/r/AmItheAsshole/comments/1qge2dx/aitah_for_refusing_to_put_my_landlords_furniture/",
        "body_summary": "It’s a really windy and cold day today. My (37f) landlord(40ish,m), aka the owner of the house I rent, has an above ground pool set up in the backyard that he built a raised wooden deck around. The deck has several cheap plastic lawn chairs and an aluminum table on it that belong to my landlord. I started hearing something tumbling around in the yard a few minutes ago, so I looked out the window and some of the furniture including the aluminum table has essentially taken flight and started crashing against the house. A piece of aluminum siding has come off the house as well due to the furniture crashing into it. That piece of siding is now flying around the yard as well. I called my landlord and told him about this and he said well can you just go out there and put all the pool furniture i...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 5,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 15
        },
        "total_judged": 15,
        "reddit_verdict": "YTA",
        "fetched_utc": "2026-01-19T05:27:03.079412"
    }
]