[
    {
        "id": "1ow2szs",
        "title": "AITA for dropping my kids off with my wife when she is with a grieving friend",
        "url": "/r/AmItheAsshole/comments/1ow2szs/aita_for_dropping_my_kids_off_with_my_wife_when/",
        "body_summary": "My wife’s best friend (Jessie) lost her husband about a month ago. My wife has been at her home almost every single day since.  My job has me being on call some nights and money is tight so I can’t not be on call.\n\n\n\nI know Jessie is struggling but it is stressing me out a ton to be a basically a single parent  since my wife is never home. I have talked to her about cutting back but that ends in an argument about me being heartless.\n\n\n\nYesterday I was on call and I actually got called in. I couldn’t leave our two daughters home alone ( 6 & 9) so I called my wife telling her she needs to head home now, I need to leave.  She told me no, and to figure it out. \n\n\n\nWe don’t have the money for a sitter,  my parents  live too far away, her parent aren’t allowed near the kids ( they suck) and my f...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 143,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-14T05:12:04.432236"
    },
    {
        "id": "1ow7372",
        "title": "AITA for not wanting to pay for FIL's and MIL's retirement home?",
        "url": "/r/AmItheAsshole/comments/1ow7372/aita_for_not_wanting_to_pay_for_fils_and_mils/",
        "body_summary": "Husband (45M) and I (45F) moved far from our families. We have two kids on the spectrum and have created a good life for ourselves. My family has always been helping financially, while his never gave him/us a dime. MIL and FIL have built two houses, one for them and the other for their younger son (who stayed to live close to them). They also bought a car for him and raised/supported his kids. I, on the other hand, did everything myself: raised the kids, homeschooled them, managed all the doctors, maintained the house...so that husband can build a career. With my family's money and his skills, he built a good business. And now, 15 years after we left, MIL and FIL (both 65) say that they want to go to a retirement home. Besides being too young for this, they are also both very healthy and a...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 116,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 118
        },
        "total_judged": 118,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-14T05:12:21.563875"
    },
    {
        "id": "1owhcwl",
        "title": "AITA/ my inlaws want to take only my husband to the bahamas for 11 days and leave me and the kids at home. Am i wrong for being angry?",
        "url": "/r/AmItheAsshole/comments/1owhcwl/aita_my_inlaws_want_to_take_only_my_husband_to/",
        "body_summary": "My inlaws asked my husband to go on vacation with them and said they wanted it \" just them and thier kids\" aka him and his 2 younger brothers. My husband claims they guilted him into it. Meanwhile me and our 3 children will be left at home and i will have to take on all the responsibilities of them. I work fulltime. And during that time our daughter has surgery on her eyes. Ive been angry with him for 3 days now for agreeing to go. He thinks i should be over it by now. Is he right? ",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 108,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-14T05:12:25.970194"
    },
    {
        "id": "1ow2lhu",
        "title": "AITA for not going to every single one of my husband’s shows?",
        "url": "/r/AmItheAsshole/comments/1ow2lhu/aita_for_not_going_to_every_single_one_of_my/",
        "body_summary": "I (30F) and my (31M) husband have gotten into many arguments over the years because he feels I don’t support his music career enough because I don’t go to every single show he has or buy tickets the moment they drop.\n\nFor context, he is a live guitarist in 2 different bands. I have gone to almost all of his shows whenever he plays in our state but there have been a few times when I haven’t gone because it was either A). Not in our state, B) on a weekday and I have work that day/the next day (I work a 9-5), or C) I just didn’t want to go because the venue was far and hard to get to. \n\nI want to say out of the like 100 shows he’s played in our home state, I’ve gone to 90-95 of them but because I didn’t go to all of them he feels I’m not supportive enough and compares me to the other bandmate...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 142,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-14T05:12:42.871034"
    },
    {
        "id": "1owjtrt",
        "title": "AITA for embarrassing my mom in front of the doctor?",
        "url": "/r/AmItheAsshole/comments/1owjtrt/aita_for_embarrassing_my_mom_in_front_of_the/",
        "body_summary": "So I (16f) and my mom (51f) went to my neurologist appointment yesterday because my migraines have been acting up like crazy lately. My mom is really into natural stuff and has giving me soooo many vitamins and random “natural” stuff she has found online for me to take. She gets upset if I refuse to take them.\n\nThe thing is I’m not doing that out of disrespect, I do my own research and some of the stuff she has me taking either won’t do anything for my migraines, or is to much. Like she has me taking almost 700 milligrams of magnesium a day that’s insane. I brought it up to her after doing my own teacher and finding that I really shouldn’t be having more than 40” milligrams a day and she got pissed at me. She also gets mad when I refuse to read the chat gpt “articles” she sends me but I do...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 50,
            "ESH": 3,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-14T05:12:59.204903"
    },
    {
        "id": "1ovvtgz",
        "title": "AITA for bailing out from helping my friend through her week she has to spend in her childhood trauma home because she flipped out when it turned out I'll only be there for 3 days (as I said from the start) ?",
        "url": "/r/AmItheAsshole/comments/1ovvtgz/aita_for_bailing_out_from_helping_my_friend/",
        "body_summary": "So I have this friend that comes from a trauma home and she agreed to pet-sit for her parents for over a week. It's devastating for her emotionally to be there, my advice was not very much not to agree, I really tried but she cant set a boundary. It's the 2nd time this year, I already went with her last time for 2 days. Now, I work remotely and free hours so technically I can do that, like she's not asking me to sacrifice my job.\n\nSo when she told me she agreed to pet-sit again for over a week and asked if I can come with her to help manage it I said okay, I can come for 2 days, maybe 3 maximum. From the start I said that. Now when we were supposed to go to the house, the day prior when I said I'm going back on Sunday because I have a fairly important social thing going on she flipped out ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 47,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 47
        },
        "total_judged": 47,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-14T05:13:14.997000"
    },
    {
        "id": "1ow4ii8",
        "title": "AITAH for wanting to step back from financially helping my parents?",
        "url": "/r/AmItheAsshole/comments/1ow4ii8/aitah_for_wanting_to_step_back_from_financially/",
        "body_summary": "My parents are not financially secure, no retirement. Classic immigrant story - they worked HARD but mostly low paying jobs, sacrificed everything to get us out of poverty, and prepared us for college. Fortunately, my brother (34M) and I(36F) ended up OK, high earning professionals.\n\nI've been helping my parents financially ever since I started working. My partner (also from an immigrant background) and I have a similar mindset so we just both work our butts off working weekends, juggling two jobs so we can afford to send 6k month to support both sets of parents (his and mine) - 3k to my parents, 3k to in-laws + we cover food, trips, shopping,etc. We just accepted the fact we can't prioritize mortgage and student loans like other people and we'll never live luxuriously but we are thankful ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 39,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-14T05:13:30.938967"
    },
    {
        "id": "1ovt318",
        "title": "AITA for calling my brother a prude because of a movie?",
        "url": "/r/AmItheAsshole/comments/1ovt318/aita_for_calling_my_brother_a_prude_because_of_a/",
        "body_summary": "My family and I (23 m) have a movie club like a book club where each family member will pick out a movie each week. It’s a good way for all of us to come together since we all live in different cities. Recently, we’ve decided to include mine and my twin brother’s significant others. My wife and his gf.\n\nWhen it was my brother’s gf time to pick the movie she chose Poor Things. I had seen it before and enjoyed it but I get it that it’s more on the artsy/surreal side and contains quite a bit of nudity.\n\nWe happened to all be in town this weekend so we decided to watch it together at my parents house. Before the film started I emphasized several times to my parents and brother that the film contained some graphic nudity and everyone said that they were fine and we went ahead and started watchi...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 55,
            "ESH": 29,
            "NAH": 1,
            "INFO": 2,
            "TotalJudged": 102
        },
        "total_judged": 102,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-14T05:13:47.915321"
    },
    {
        "id": "1ow23sk",
        "title": "AITA for not giving a kid a rare Pokemon?",
        "url": "/r/AmItheAsshole/comments/1ow23sk/aita_for_not_giving_a_kid_a_rare_pokemon/",
        "body_summary": "I (33M) play this game called Pokemon Go. It's a mobile game that is free to play (F2P) but has a ton of micro transactions. Some of the rarest Pokemon are only obtainable via raids, and raid tickets cost $1 for 1 or $2.50 for 3. Every day you get a free raid pass, but beyond that, it's locked behind a pay wall. There are ways to grind for free in-game currency, but it's tedious. I'll fully admit that I whale pretty hard for the game. There is an event this week where this really rare Pokemon is in raids. However there is a small chance that the Pokemon will have a special background. There is also a small chance for the Pokemon to be \"shiny\" which is an alternate color/skin of the original Pokemon, making it more rare.\n\n\nI spent a ton of money stocking up on raid tickets because my goal i...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 92,
            "ESH": 8,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 107
        },
        "total_judged": 107,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-14T05:14:05.017850"
    },
    {
        "id": "1ow3y1b",
        "title": "AITA for not wanting to stay at my in-laws house over Christmas",
        "url": "/r/AmItheAsshole/comments/1ow3y1b/aita_for_not_wanting_to_stay_at_my_inlaws_house/",
        "body_summary": "My in-laws live in Florida and it’s a 2 day drive from Missouri to get there. I told my wife I wanted to get a hotel instead of staying at there house because I don’t feel comfortable staying there. It turned into a major argument about how I don’t want to be a part of her family and that I’m a villain for saying anything about her family. There’s a lot of history that I’m not going to go into, but her dad has made me and my kids feel unwanted at his house in the past. Is it unreasonable to ask to stay at a hotel?I know it’s Christmas but I really feel uncomfortable staying there.\n\n  \nEdit - My wife and I have been together for nearly 20 years. Her dad is NOT a bad guy, he just doesn't like interruptions to his day to day activities. He has told us in the past to get a hotel rather than st...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 74,
            "ESH": 0,
            "NAH": 1,
            "INFO": 8,
            "TotalJudged": 87
        },
        "total_judged": 87,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-14T05:14:21.367659"
    }
]