[
    {
        "id": "1pgkeny",
        "title": "AITA for not realizing how much help my pregnant sibling needed?",
        "url": "/r/AmItheAsshole/comments/1pgkeny/aita_for_not_realizing_how_much_help_my_pregnant/",
        "body_summary": "I (40F) have a sister (38F) who is 7 months into her second pregnancy.\n\nShe is married and also has another child who is 3.\n\nRecently some extended family reached out about wanting to get together and we were supposed to go to a restaurant for dinner. \n\nMy sibling asked me about switching it to her house since it would be easier for her. \n\nWe decided we would order food so she didn't have to cook and briefly threw out some ideas.\n\nA few days before my sibling made a passive comment that she would be cooking because it would be too expensive to cater and I said I was confused bc we were all going to contribute. \n\nSibling still insisted on cooking so I rolled with it and we sorted out what I would bring. We chatted about other stuff up until the day before dinner everything was fine. \n\nThe d...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 144,
            "ESH": 1,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 147
        },
        "total_judged": 147,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-08T05:14:46.136123"
    },
    {
        "id": "1pgbhcr",
        "title": "AITA for turning off my brother’s “motivational” alarm that plays a speech every morning?",
        "url": "/r/AmItheAsshole/comments/1pgbhcr/aita_for_turning_off_my_brothers_motivational/",
        "body_summary": "My brother recently decided he is on a self improvement grind. For the past two weeks, his alarm has been a loud motivational speech about discipline, success, and waking up at 5 AM to “outwork everyone else.” The problem is, he does not wake up to it. I do. It goes off every single morning at 5 AM and plays for five straight minutes while he snoozes it again and again.\n\nI asked him multiple times to change it to something quieter, but he said the speech is “part of his mindset” and that I should respect his routine. This morning after five minutes of someone yelling about success and hustle, I got up and turned his phone completely off. He slept through his class and when he woke up he was furious.\n\nNow he says I sabotaged his personal growth and disrespected his goals. I feel like I just...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 48,
            "ESH": 2,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 53
        },
        "total_judged": 53,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-08T05:15:01.964915"
    },
    {
        "id": "1pgioy0",
        "title": "AITA for refusing to do my husband a favor, even if I was capable of doing it?",
        "url": "/r/AmItheAsshole/comments/1pgioy0/aita_for_refusing_to_do_my_husband_a_favor_even/",
        "body_summary": "I (25f) am a 4th year vet student married to my husband (27m). I have an exam in 4 days that I have been frantically studying for. \n\nThis morning I was actively typing/studying on my computer when my husband came in and asked if I could do him a favor. He said that he needed new work pants but when he tried to log in to his amazon account yesterday that he was locked out. He asked that I just buy the pants for him using my amazon account. He said that I had purhcased the pants before so the order info should be saved somewhere in my history. \n\nI told him that he has access to my amazon account on his computer and could use my account to get them for himself. I said that while I was physically capable of going and doing it for him, he could also do it just as easily, and it just wasn't a pr...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 142,
            "ESH": 1,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 150
        },
        "total_judged": 150,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-08T05:15:21.063482"
    },
    {
        "id": "1pgtil2",
        "title": "AITA - asking for separate checks at my bday dinner",
        "url": "/r/AmItheAsshole/comments/1pgtil2/aita_asking_for_separate_checks_at_my_bday_dinner/",
        "body_summary": "So just recently I had a bday dinner with my bf and a couple of my friends. I sent out an invite to go to a nice steakhouse to around 10-15 people to see if they wanted to come and I figured a few would and wouldn’t because who’s trying to drop money like that right now lol. Anyways , we ended up being a group of 6  people including my boyfriend and he was the only guy there. We all ordered our food, my bf and I shared a steak and salad while the rest of my friends had their full entrees. When it was time for the bill , all of my friends expected my bf to pay for all of them bc he was the only man at the table…He politely said no and that he has no obligations to them.  To which they called him broke and ungentlemanly because he didn’t want to pay. By then I was getting irritated with them...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 95,
            "ESH": 3,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 104
        },
        "total_judged": 104,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-08T05:15:39.528598"
    },
    {
        "id": "1pgg946",
        "title": "AITA for refusing to keep helping my friend with her side hustle after she kept taking advantage of me?",
        "url": "/r/AmItheAsshole/comments/1pgg946/aita_for_refusing_to_keep_helping_my_friend_with/",
        "body_summary": "So I have a long-time friend Rosa 27F. We’re not related, not dating, not coworkers   just friends who’ve known each other for years. Recently she started a small side hustle selling handmade skincare products. I was genuinely proud of her. At first, she asked if I could help her with occasional tasks like taking photos of her products, carrying boxes to her car, or helping set up her table at local pop-up markets. I said yes because we’re friends and it didn’t seem like a big deal at first. But then it became a pattern. Every weekend she’d need me for something:\n\n– Can you come early and help me rearrange my display?\n\n– Can you stay another hour? I’m behind.\n\n– Can you deliver this order? You drive faster than me.\n\n– Can you watch my booth while I go ‘network’?” (She’d disappear for 45 mi...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 59,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 60
        },
        "total_judged": 60,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-08T05:15:55.252310"
    },
    {
        "id": "1pggiox",
        "title": "AITA for disapproving of my in laws asking to borrow money when we just had a baby?",
        "url": "/r/AmItheAsshole/comments/1pggiox/aita_for_disapproving_of_my_in_laws_asking_to/",
        "body_summary": "I would be very grateful for any feedback regarding the following scenario. When I met my husband he had no money, only small debt. At the time he was trying to build a small business. One night he messaged me and suggested that we move to a popular coastal town, get married and have babies. I was very happy about this. I owned a property and had savings. I sold my property, we purchased a home together at the coastal town and discovered that I was pregnant. I was very happy about the pregnancy due to losing my mother in recent months. We stayed in the city until after our first child arrived and saved for my maternity leave and I paid off his small debt. My husband did not have enough money to purchase an engagement ring and therefore we delayed engagement and marriage. Soon after moving ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 29,
            "ESH": 2,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-08T05:16:11.013919"
    },
    {
        "id": "1pgdydo",
        "title": "WIBTA if I gave my grandson a wake-up call?",
        "url": "/r/AmItheAsshole/comments/1pgdydo/wibta_if_i_gave_my_grandson_a_wakeup_call/",
        "body_summary": "I have 4 adult grandsons, ranging in age from 20 - 27. 3 are employed;  the middle one is not. \"Bob\" says that he's trying, but nobody will hire him because he's disabled. His brothers say differently, that he makes no effort to avail himself of the assistance available, just eats and sleeps and plays video games.\n\nThing is, his younger brother has *exactly* the same disability, but has been employed since he was a senior in high school, first as a work-study intern, now as a part-time employee who expects to go to full-time as soon as his probation term is ended. He has already earned performance bonuses. \n\nHis father \"Jim\" is not in the greatest of health, and has a family history of early death from heart disease. Jim is taking the best care of his health that he can, and has already su...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-08T05:16:27.034927"
    },
    {
        "id": "1ph0xwk",
        "title": "WIBTA if I refused to shave my armpits for my friends wedding?",
        "url": "/r/AmItheAsshole/comments/1ph0xwk/wibta_if_i_refused_to_shave_my_armpits_for_my/",
        "body_summary": "BACKGROUND: So I (26f) stopped shaving my armpits a few years ago and found that I greatly prefer not having bald armpits. I'm a sweaty person, and having hair prevents my pits from getting swampy and sweating off every single deodorant/antiperspirant known to mankind. I also have sensitive skin and get horrible rashes and razor burn from shaving. My decision to not shave my armpits is primarily personal, but I am aware that it is going against a societal/gender norm, and is therefore inherently political or subject to being politicized. Under no circumstances though am I refusing to shave solely to make a political statement.\n\nISSUE: My friends are getting married next summer, and they've invited me to their wedding. It's also a destination wedding, and many of the wedding party events wi...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 124,
            "ESH": 0,
            "NAH": 1,
            "INFO": 3,
            "TotalJudged": 129
        },
        "total_judged": 129,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-08T05:16:47.040855"
    },
    {
        "id": "1pgngle",
        "title": "AITA for not waiting longer for my BIL & SIL, causing drama in the family?",
        "url": "/r/AmItheAsshole/comments/1pgngle/aita_for_not_waiting_longer_for_my_bil_sil/",
        "body_summary": "My husband(working abroad) and I have been married for 7 years & had a baby in 2024. Background:SIL lives with my MIL along with her 2 kids (14F, 7M). Her husband (my BIL) works abroad and hadn’t come home in the last 1.5 years, so he hadn’t met our baby yet.\n\nWe live in different cities, about a 3+hr drive apart. BIL's family home is just 30 minutes from mine.BIL returned from abroad and stayed at his home (near me), then went to MIL’s after a week. No visit or call about meeting the baby at that time. On Aug 30, I had a reception near my husband's hometown. My cousin recently had a baby and my uncle, just back from surgery, was nearby. Since I recently returned to work post-maternity, and with a small baby, I decided to make all the visits in 1 trip. I informed MIL in advance that I’d st...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 30,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-08T05:17:02.694510"
    },
    {
        "id": "1pgrcy8",
        "title": "AITA for not telling my friend about my dog dying.",
        "url": "/r/AmItheAsshole/comments/1pgrcy8/aita_for_not_telling_my_friend_about_my_dog_dying/",
        "body_summary": "I (28f) have been friends with my friend (28f) let's call her abby, since middle school.\n\nAbby recently had a baby 10 months ago. About a month ago, I was talking to Abby about some work drama and she was giving short responses. I asked if everything was ok and she kinda snapped on me and told me how hard it's been with the baby and how she doesn't have time for this and from now on, to only talk to her about something \"worthy of her time\" \n\nI totally get she's in deep being a mama (and she's rocking it!) but I'm a highly sensetive person and I honestly took a big offense to it. In turn I stopped talking about myself and my life completely. I started only talking to her about her, the baby, her family, topics pertaining to her. It didn't feel like she caught on too much as she hasn't asked...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 50,
            "ESH": 5,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 60
        },
        "total_judged": 60,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-08T05:17:18.539329"
    }
]