[
    {
        "id": "1pp4gfa",
        "title": "AITA for refusing my landlord’s \"mandatory\" maid and insisting my husband join our calls?",
        "url": "/r/AmItheAsshole/comments/1pp4gfa/aita_for_refusing_my_landlords_mandatory_maid_and/",
        "body_summary": "I (F20s) recently moved into a furnished studio apartment in the Caribbean. My husband is a co-tenant on the lease but is currently working abroad, so I am here alone most of the time. I work from home and have a very strict schedule.\n\nThe Conflict: Since I moved in, my landlord (let's call him J) has been pushing for a \"mandatory\" monthly maid service. When I checked my lease, it says he pays for a maid, but it never says I am required to let her in. When I questioned him, J admitted it was an \"oversight\" and not actually in the contract. I later found out the \"maid\" is actually his aunt. I feel like this is a \"spy mission\" to check up on me because he keeps telling me stories about how the \"last tenants broke a light switch.\"\n\nBecause I refused the maid, J now insists on coming in person...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 50,
            "ESH": 1,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 56
        },
        "total_judged": 56,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-18T05:15:38.510005"
    },
    {
        "id": "1poowy8",
        "title": "AITA for calling my bf absurd for being overly concerned about a coworker?",
        "url": "/r/AmItheAsshole/comments/1poowy8/aita_for_calling_my_bf_absurd_for_being_overly/",
        "body_summary": "I (27F) have been with my boyfriend (29M) for about two years. He works in tech. I do not, so I am only hearing this second hand.\n\nRecently he started talking about a woman he works with. He went on and on about how people at his company treat her unfairly and assume she is incompetent. He kept saying she is extremely smart and great to work with and that everyone else just “doesn’t see it.”\n\nHe then told me about a situation involving a code review. From what I understood, multiple people questioned or criticized her code, and according to him they were all wrong and she was right. He said later it was proven she had done the correct thing. While telling me this, he actually started crying. Like tears and shaking voice.\n\nI honestly did not know how to react. It felt absurd. This is a tech...",
        "reddit_judgments": {
            "YTA": 74,
            "NTA": 35,
            "ESH": 1,
            "NAH": 7,
            "INFO": 4,
            "TotalJudged": 121
        },
        "total_judged": 121,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-12-18T05:16:00.550497"
    },
    {
        "id": "1poz9wa",
        "title": "AITA for not decorating 🎄",
        "url": "/r/AmItheAsshole/comments/1poz9wa/aita_for_not_decorating/",
        "body_summary": "Today my boss asked us to supply her with a picture of our holiday decorations. For context, we are all remote employees on my team. Next week she's going to have a game where she shows the pictures and we have to guess who's decoration it is. I dont decorate, at all. I actually think decorating is kind of a waste of space/time. Not to mention, temporary seasonal decorations end up in a landfill. Permanent seasonal decorations must be rotated and stored. I can't be bothered. I guess in retrospect, I could have pulled a stock image and sent it to her from the internet. Being neurodivergent I told her I don't decorate and left it at that. She basically said I'm ruining the game... it isn't my job to decorate for her 💀🤷 I am also not Christian. I find no point in pretending to please others. ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 121,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 127
        },
        "total_judged": 127,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-18T05:16:18.005340"
    },
    {
        "id": "1pp8f7g",
        "title": "AITA for using gloves before applying a cream to my Girlfriend's back",
        "url": "/r/AmItheAsshole/comments/1pp8f7g/aita_for_using_gloves_before_applying_a_cream_to/",
        "body_summary": "We're students, living together but away from our respective parents. (20M, 20F). Germany.\n\nRecently she got a very mild skin infection (Some redness and itching) near her lumbar curve area in the back. Coin-sized area. Doctor said it's common, caused by sweat (most probably) as we both go to Gym. A common cream is prescribed to her to apply before sleep.\n\nObviously, she can't apply it properly at that area herself, so I'm doing it. But I cover my finger with piece of a plastic polythene. Because I'm a very squeamish person and get easily grossed out by certain things like visible infections, dandruff etc. I was born with this trait. I can't apply any type of cream to another person with bare hands, unless there's no other option.\n\nEverything went smooth for 2-3 days, but today she told me...",
        "reddit_judgments": {
            "YTA": 19,
            "NTA": 81,
            "ESH": 19,
            "NAH": 12,
            "INFO": 3,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-18T05:16:35.332017"
    },
    {
        "id": "1ppas75",
        "title": "AITAH for refusing to go to Christmas Dinner since my boyfriend is not invited ?",
        "url": "/r/AmItheAsshole/comments/1ppas75/aitah_for_refusing_to_go_to_christmas_dinner/",
        "body_summary": "My boyfriend(27m) and I (24f) have been together for 5 years and he hasn’t met most of my extended family on my dads side yet. My dad has 2 brothers and 2 sisters and 3 of his 4 siblings live far away and usually don’t come down for holidays. The sister that comes down every year has 3 kids a girl and 2 boys and they are all in there late twenties and early thirties. When they were in high school they always brought their partners to holidays and family get togethers 2 of them are married now and have kids of there own. My other cousins have brought there partners when they come down and there have been no issues at all. My boyfriend has met my grandparents and they are hosting Christmas dinner on Christmas Day and this year everyone is coming down on my dads side I told my boyfriend this ...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 99,
            "ESH": 0,
            "NAH": 0,
            "INFO": 14,
            "TotalJudged": 115
        },
        "total_judged": 115,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-18T05:16:52.233722"
    },
    {
        "id": "1pp7p4n",
        "title": "AITA for not wanting to take a government job just so my family can keep their house?",
        "url": "/r/AmItheAsshole/comments/1pp7p4n/aita_for_not_wanting_to_take_a_government_job/",
        "body_summary": "I’m 19. My dad works a senior government job and our family lives in an official government house. When he retires, we’re supposed to move out. We don’t own any other house.\n\nBecause of that, my family wants me to join government service at a lower scale so they can try to get the house transferred or re-allotted under my name. The thing is, I recently found out that if I do that, the house would be directly tied to my job. If I ever quit, resign, or get transferred, we’d lose the house again.\n\nI don’t actually want a government job. I’m not interested in that career path at all. The main reason they want me to do it is just so the house issue is delayed or “handled.” I feel like once I take the job, I’ll never be able to leave because the moment I do, it becomes “you made us homeless.”\n\nI...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 65,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 67
        },
        "total_judged": 67,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-18T05:17:08.096445"
    },
    {
        "id": "1pp64gs",
        "title": "AITA for reporting my ex’s dog after it keeps jumping on me while I’m recovering from cancer surgery?",
        "url": "/r/AmItheAsshole/comments/1pp64gs/aita_for_reporting_my_exs_dog_after_it_keeps/",
        "body_summary": "I (40F) live in an apartment building and dated a neighbor (39M). During our relationship, I was diagnosed with breast cancer and went through multiple surgeries, including a breast implant exchange about four weeks ago.\n\nOne ongoing issue in our relationship was boundaries with his dog. He jumped on me constantly, and at night would walk or dig at my chest if I wasn’t cuddling him. My ex would yell at me and dismissed my concerns, even after my mastectomy. This friction contributed to our breakup. Shortly after, I learned he had cheated.\n\nSince the breakup, whenever I see the dog in common areas (hallways, elevators, courtyard), he runs toward me and jumps on me. He’ll even back up to jump higher (I’m 5’5” and he can reach my rib cage). I’m still recovering from cancer surgery, I’m unstea...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 31,
            "ESH": 1,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 32
        },
        "total_judged": 32,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-18T05:17:23.707220"
    },
    {
        "id": "1ppcn9n",
        "title": "AITA for not sending money for a child that is not mine",
        "url": "/r/AmItheAsshole/comments/1ppcn9n/aita_for_not_sending_money_for_a_child_that_is/",
        "body_summary": "So back story: I 35/f had my first child last year and I am currently pregnant (another story for another time); well a few months ago my bd decided to just up and abandon us (another story for another time). Well, he reached out to me to \"apologize\" being that he knows he was wrong in why and how things ended. I listened to him and after being on the phone with him he asked me to borrow $40 cause he needed to feed his baby mama and her kids; of course I said no. I have to take care of my own kids and they are in need. Still buying baby stuff and stuff for my one year old. so I hadn't heard from him in about two weeks. He called and asked if I needed anything and I told him of course my baby just took his last bit of Tylenol and needed some more cause he had a fever. He said I'll get some ...",
        "reddit_judgments": {
            "YTA": 5,
            "NTA": 53,
            "ESH": 4,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 63
        },
        "total_judged": 63,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-18T05:17:39.830020"
    },
    {
        "id": "1ppdh7v",
        "title": "AITA for letting a stranded underage girl into my uni lobby to help her get home, against building policy?",
        "url": "/r/AmItheAsshole/comments/1ppdh7v/aita_for_letting_a_stranded_underage_girl_into_my/",
        "body_summary": "This happened earlier tonight and I want an outside opinion.\n\nMy girlfriend and I were leaving my university accommodation when a young girl who was probably no older than 16 approached us in the rain. She said her phone was water damaged and she couldn’t call a taxi to get home. She looked quite young and said she lived a few towns away.\n\nWe were hesitant at first but she seemed genuinely stuck, so we agreed to help. Since the building entrance was right next to us, we went into the main lobby so she could get out of the rain while we tried to arrange a taxi. For context, the lobby is keycard access only, and without a card you can’t get into any student areas, only the lobby itself.\n\nOnce inside, I asked the security receptionist if she could call a taxi for the girl. She said it wasn’t ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 63,
            "ESH": 0,
            "NAH": 2,
            "INFO": 1,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-18T05:17:55.846705"
    },
    {
        "id": "1pp47sz",
        "title": "AITA for just cooking for myself?",
        "url": "/r/AmItheAsshole/comments/1pp47sz/aita_for_just_cooking_for_myself/",
        "body_summary": "I live with my girlfriend an normally when we cook we’ll decide on something together then cook together. \n\nMy gf has gotten into the habit of pretty much refusing to have anything that we have in and will start looking for on apps to order food. This used to be just once every week or once every two weeks but now it’s multiple times a week. \n\nIt tends to be me who pays for most of the food we order and I’ve noticed I’ve started gaining weight so told my gf I wouldn’t be ordering our number and she agreed we needed to cut down. \n\nTonight has he did the same thing and refused anything we had and started looking on apps for food. I told her she could order if she wants but she will just be ordering for herself. She said there’s no point ordering for one and it’ll be too expensive since there...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 47,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 48
        },
        "total_judged": 48,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-12-18T05:18:11.414998"
    }
]