[
    {
        "id": "1r6dtoq",
        "title": "AITA for telling my DIL that I won’t use the tablet and she needs to actually make her kid read.",
        "url": "/r/AmItheAsshole/comments/1r6dtoq/aita_for_telling_my_dil_that_i_wont_use_the/",
        "body_summary": "My granddaughter is in 4th grade and she struggles in reading. She doesn’t have a learning disability, it is just a subject that she struggles in.\n\nRecently my daughter in law had to go back to work ( she was a SAHM) because of financial reasons. She started about two weeks ago and due to this I now babysit after school for an hour or two before they come and pick her up. \n\nI have been having her do her homework in that time. It has become very obvious she is a very poor reader ( I would say she is behind a grade in the subject). She asks me all the time to read a question for her, and I have started sitting down with her having her read out loud ( which she hates). \n\nShe doesn’t know how to sound stuff out if that makes sense and is extremely slow at it.  If the word is longer than like 4...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 140,
            "ESH": 1,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 143
        },
        "total_judged": 143,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-17T05:52:23.727708"
    },
    {
        "id": "1r6oupv",
        "title": "AITA for wanting a break?",
        "url": "/r/AmItheAsshole/comments/1r6oupv/aita_for_wanting_a_break/",
        "body_summary": "I (22F) and a friend (24F) have kids the same age (2). We recently did a girls' beach trip. I left my child at home with my husband for the first time and in consequence for the first time in two years was child-free (my husband does what he can regarding our kid and does a lot but is gone a lot for work so I’ve never been apart from my kid for more than a few hours before someone says I have a husband issue. That isn’t the issue here). My friend brought her child which no one in the group had a problem with at all. Except my friend has a habit of letting, or rather forcing, others to watch/parent her kid. \n\nEvery time we hang out she kinda checks out, goes on her phone or wonders off and sort of… dumps her kid on the friend group. Well, on this beach trip (overnight), she did just that to...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 72,
            "ESH": 4,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 80
        },
        "total_judged": 80,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-17T05:52:31.765833"
    },
    {
        "id": "1r6felg",
        "title": "AITA for not continuing to be a listening ear for my brother and sister's grief?",
        "url": "/r/AmItheAsshole/comments/1r6felg/aita_for_not_continuing_to_be_a_listening_ear_for/",
        "body_summary": "For context, my family lost my youngest brother last year in June. I've never lost a sibling before and it pretty much shattered our entire family. He was the youngest, but also struggled with alcoholism and substance abuse. \n\nHaving never lost a sibling, the impact was pretty hard on us all. I also want to stress that in our family dynamic and culture; therapy, asking for help, being vulnerable, isn't really a thing. \n\nI've been in therapy over 5 years, and after my brother's passing, was the only one that sought out a grief counselor in addition to my therapist. It's helped me personality, and I've tried to share with my siblings how much it's helped in the hopes that they would seek help too, but I feel like I've done this several times and I'm just met with a \"I don't need to talk to a...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 16,
            "ESH": 1,
            "NAH": 4,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-17T05:52:39.506629"
    },
    {
        "id": "1r6bjwl",
        "title": "AITAH for going on holiday to the same destination my sister went to on her honeymoon?",
        "url": "/r/AmItheAsshole/comments/1r6bjwl/aitah_for_going_on_holiday_to_the_same/",
        "body_summary": "Firstly, I apologise for any spelling/ grammar mistakes as English is not my native language. Last year I had planned to do a lot of solo travelling for 2026 as I have only been abroad a couple times in my life but now I’m approaching my 30s I want to travel to more fancy places before I settle down and have kids. One of the trips I have booked is to the Maldives. Truly a once in a lifetime experience and something I have wanted to do since I was a kid. I have saved up a decent amount of money and have paid a deposit and I will be going to in early 2026. This trip which I had planned for a long time has never been an issue with my family until quite recently my sister has said that I shouldn’t be going to the Maldives as this is where she went okay her honeymoon. I never thought that going...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 130,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 134
        },
        "total_judged": 134,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-17T05:52:48.121047"
    },
    {
        "id": "1r61udc",
        "title": "AITA for disinviting my aunt to my bday after a weird comment she made about me and my cousin?",
        "url": "/r/AmItheAsshole/comments/1r61udc/aita_for_disinviting_my_aunt_to_my_bday_after_a/",
        "body_summary": "Hi reddit, I’m using a throwaway for this.\n\nI’m turning 16 in 3 days. My birthday celebration is going to be booking out a restaurant with my whole family. My aunt, (45f) is a very opinionated person who talks before she thinks. It can be endearing and also very aggravating. This instance was aggravating.\n\nMe and my cousin are very close and have always been that way. I’ve never seen it to be a weird thing at all. We had a dinner last night to celebrate an anniversary of one of our uncles. Me and my cousin were sat at the table, laughing about inside jokes and whatever. My cousin grabbed my shoulder while we were laughing because he was like doubling over laughing, and my aunt made a face. I tried to ignore it and just assumed it wasn’t at me. But then she kept making jokes, saying we were...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 53,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 54
        },
        "total_judged": 54,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-17T05:52:55.988973"
    },
    {
        "id": "1r6ukhf",
        "title": "WIBTA If I didnt want to coparent my brother again.",
        "url": "/r/AmItheAsshole/comments/1r6ukhf/wibta_if_i_didnt_want_to_coparent_my_brother_again/",
        "body_summary": "The context is that I (M26) used to be like a co parent for my little brother (M13) for most of my teenage life until I moved out. From getting up at 5 am to prepare him to school, teaching him after work, solely cleaning the house most of the time and cooking for the family. Basically the usual oldest sibling responsibility and I've burnt out with juggling work, personal (if there was any) and home all by myself.\n\nHowever, now I have managed to move out and got my own apartment. Now since rent is expensive I decided to do a live in situation with my gf to share and half the bills. Additionally, I've started new work that requires me to drive an hour and a half one way. Aside from struggling from the daily drive, Im also struggling with the new work scope and responsibilities that requires...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 92,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 92
        },
        "total_judged": 92,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-17T05:53:04.310723"
    },
    {
        "id": "1r69vov",
        "title": "AITA for not wanting my husband to travel for a wedding a month before my due date?",
        "url": "/r/AmItheAsshole/comments/1r69vov/aita_for_not_wanting_my_husband_to_travel_for_a/",
        "body_summary": "TLDR: my husband is in a wedding that is exactly a month before my due date. I think it’s too close and don’t want him to go\n\nHi so my husband’s best friend moved away a few years ago. We have travelled together to see him once, and even before being pregnant, it was a tough trip (length of time for the direct flight was 14 hours). I can’t remember which came first, finding out my due date or finding out the date of the wedding, but basically the wedding is exactly 1 month before my due date. \n\nMy husband is one of the groomsmen in the wedding. I originally said to him that I would be ok to have him go for 3 days, but now, due to pressure from friends, his trip is 6 days long so he can spend time with his friend while out there. I’ve expressed my concerns because A. I’m already having extr...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 98,
            "ESH": 3,
            "NAH": 11,
            "INFO": 4,
            "TotalJudged": 118
        },
        "total_judged": 118,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-17T05:53:16.997768"
    },
    {
        "id": "1r6edqg",
        "title": "AITAH for not sending a thankyou card for a rock?",
        "url": "/r/AmItheAsshole/comments/1r6edqg/aitah_for_not_sending_a_thankyou_card_for_a_rock/",
        "body_summary": "I (43M) got married seven-ish years ago, a very quick service we wedged in 5 minutes before the normal church service, since all my friends attended that church anyways and my wife's family wasn't going to be able to attend (for immigration reasons). \n\nMy mother invited one of her friends to attend, and she came with her husband. Church was open to the public, so no big deal. I haven't seen them since\n\nFive years later, they mailed me a rock, about 2 inches, brown, smooth. Turns out my mother's friend's husband polishes rocks for a hobby in retirement. He picked this rock in his back yard,, polished it, and shipped it to me.\n\nI have no use for a small rock rock. It's nothing special, and seemed a bit weird that they mailed it to me.\n\nFast forward, and my mother's friend is pestering my mot...",
        "reddit_judgments": {
            "YTA": 19,
            "NTA": 30,
            "ESH": 2,
            "NAH": 2,
            "INFO": 2,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-17T05:53:25.420712"
    },
    {
        "id": "1r625k2",
        "title": "AITA for threatening to live with my dad while fighting with my mom?",
        "url": "/r/AmItheAsshole/comments/1r625k2/aita_for_threatening_to_live_with_my_dad_while/",
        "body_summary": "Throw away for privacy\n\nI (17F) and my mom (60F) have not had the greatest relationship for a while but it's come to a head recently and I'm wondering if I'm blowing this out of proportion.\n\nFor context, my parents have been divorced since I was 15. I live in Nevada and my dad lives in California. I'm also neurodivergent so emotional issues like this are very out of my element.\n\nRecently, we had a fight about my relationships after she mentioned that she doesn't have anything to tell her family about me. I told her she and her family don't ask about my life so I'm not surprised. She got upset, telling me I shouldn't expect family to ask about my personal life and should just tell them. I pointed out that her family would shut me down when I'd try or even express direct disinterest and just...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 16,
            "ESH": 2,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 27
        },
        "total_judged": 27,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-17T05:53:33.262491"
    },
    {
        "id": "1r6i5yx",
        "title": "AITA for not keeping my maiden name?",
        "url": "/r/AmItheAsshole/comments/1r6i5yx/aita_for_not_keeping_my_maiden_name/",
        "body_summary": "I’m planning to take my future husbands last name when we get married. I think it’s symbolic and it’s something that he’s asked for as well, so I don’t mind doing it. We want kids and I like the idea of having a family name. My current last name doesn’t hold value, isn’t cultural or anything like that. I have a good relationship with my dad but this is really straining it. \n\nMy dad is personally offended by me taking on a new last name for whatever reason. He thinks it’s disrespectful to him that I would “throw away” his last name. I have brothers who would “carry on the name” anyways. My dad has been married multiple times and all of his wives have taken his last name. I know at least one kept her maiden name as her middle name, I don’t know about the others. Several women in my family ha...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 99,
            "ESH": 0,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 105
        },
        "total_judged": 105,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-17T05:53:41.420865"
    }
]