[
    {
        "id": "1jt7ogm",
        "title": "AITA for not buying my stepdaughter a new car after she's repeatedly gotten into accidents?",
        "url": "/r/AmItheAsshole/comments/1jt7ogm/aita_for_not_buying_my_stepdaughter_a_new_car/",
        "body_summary": "OP's stepdaughter, a poor driver, has totaled three cars.  OP and husband helped buy her first car, but now she wants them to buy another after her third accident (not her fault). OP thinks she should walk, bike, or use ride-sharing, while husband wants to help buy another car and have her repay them. OP questions if she's the asshole for refusing.\n...",
        "reddit_judgments": {
            "YTA": 45,
            "NTA": 20,
            "ESH": 0,
            "NAH": 5,
            "INFO": 3,
            "TotalJudged": 73
        },
        "total_judged": 73,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:33:44.562758"
    },
    {
        "id": "1jt74ox",
        "title": "AITA for how I explained to SIL that she wouldn't be my son's godmother?",
        "url": "/r/AmItheAsshole/comments/1jt74ox/aita_for_how_i_explained_to_sil_that_she_wouldnt/",
        "body_summary": "OP and wife chose one godparent each (brother & wife's cousin) for their son, excluding brother's wife.  Brother's wife was upset, feeling OP implied their marriage would fail. OP called to explain their reasoning (avoiding repeat of OP's childhood experience), but she remained angry.  AITA?\n...",
        "reddit_judgments": {
            "YTA": 13,
            "NTA": 46,
            "ESH": 7,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 67
        },
        "total_judged": 67,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:33:46.069951"
    },
    {
        "id": "1jt0s1f",
        "title": "AITA for canceling my mom’s surprise farewell dinner because she called me messy?",
        "url": "/r/AmItheAsshole/comments/1jt0s1f/aita_for_canceling_my_moms_surprise_farewell/",
        "body_summary": "OP (27F) planned a surprise dinner for her mother (59F) but a fight erupted when the mother criticized OP's messiness.  The argument escalated with the mother calling OP names, leading OP to reveal the surprise and then cancel it after her mother refused to attend.  OP feels hurt and conflicted, questioning whether canceling the celebratory dinner makes her the asshole.\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 37,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 39
        },
        "total_judged": 39,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:33:47.417385"
    },
    {
        "id": "1jt9ifz",
        "title": "AITA for playing volleyball in the day of my sister's wedding?",
        "url": "/r/AmItheAsshole/comments/1jt9ifz/aita_for_playing_volleyball_in_the_day_of_my/",
        "body_summary": "18-year-old OP played in a volleyball match the morning of her 24-year-old sister's wedding.  Relatives attending the wedding independently chose to watch OP's game.  The sister felt OP made the wedding about herself by playing and mentioning the game. OP feels she's not at fault as she didn't invite anyone.  They haven't resolved the conflict. AITA?\n...",
        "reddit_judgments": {
            "YTA": 72,
            "NTA": 61,
            "ESH": 7,
            "NAH": 9,
            "INFO": 0,
            "TotalJudged": 149
        },
        "total_judged": 149,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:33:50.545262"
    },
    {
        "id": "1jtl8ua",
        "title": "AITA for sending my niece back home after lying multiple times and smoking in my home?",
        "url": "/r/AmItheAsshole/comments/1jtl8ua/aita_for_sending_my_niece_back_home_after_lying/",
        "body_summary": "OP and husband hosted their niece, setting clear rules against drugs and smoking.  After the niece violated these rules repeatedly, lying about her vaping and weed pen use, OP and husband sent her home.  The sister-in-law disagreed with their decision.  OP worries they made the situation worse by sending the niece home and questions whether they were the asshole.\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 23,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 26
        },
        "total_judged": 26,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:33:51.923937"
    },
    {
        "id": "1jtg6xv",
        "title": "AITA for refusing to keep sending money for my partner’s family",
        "url": "/r/AmItheAsshole/comments/1jtg6xv/aita_for_refusing_to_keep_sending_money_for_my/",
        "body_summary": "OP (29M) and his partner (28M) received financial help from partner's parents for a move.  Despite repaying the loan plus extra, the parents continuously request money for various expenses, from bills to luxury items, for three years.  OP feels financially drained and wants to set boundaries, but his partner refuses, believing OP is wrong and suggesting separate finances.  OP questions if he's wrong for refusing further financial support.\n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 27,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 29
        },
        "total_judged": 29,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:33:53.269764"
    },
    {
        "id": "1jt47m8",
        "title": "AITA for how I responded to my friend’s mom asking for more money after I already paid what she had said I owed her?",
        "url": "/r/AmItheAsshole/comments/1jt47m8/aita_for_how_i_responded_to_my_friends_mom_asking/",
        "body_summary": "OP shared a room, left halfway through the month, and paid what they were initially told was their share of rent and utilities ($280).  The roommate's mother now demands more money for utilities, claiming OP owes $87. OP refused, citing previous payment and limited usage of utilities.  The mother accused OP of being inconsiderate and invoked karma. OP retorted, questioning the additional charges and the mother's attitude.  AITA?  Were OP's responses inappropriate?\n...",
        "reddit_judgments": {
            "YTA": 7,
            "NTA": 13,
            "ESH": 4,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 24
        },
        "total_judged": 24,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:33:54.876338"
    },
    {
        "id": "1jt8t6i",
        "title": "AITA for refusing to take care of my ex’s dog even though I was the one who originally adopted him?",
        "url": "/r/AmItheAsshole/comments/1jt8t6i/aita_for_refusing_to_take_care_of_my_exs_dog_even/",
        "body_summary": "OP (28M) adopted a dog, Max, with his ex (30F).  After their breakup, he gave Max to his ex, who bonded strongly with him.  Now, his ex is struggling and asked him to temporarily take Max back.  OP refused due to his small apartment, allergies, and long work hours. His ex accuses him of abandoning Max. OP feels guilty but also manipulated, questioning if he's the asshole for refusing.\n...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 37,
            "ESH": 0,
            "NAH": 3,
            "INFO": 0,
            "TotalJudged": 42
        },
        "total_judged": 42,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:33:56.330791"
    },
    {
        "id": "1jtcizm",
        "title": "AITA for not sharing my savings account",
        "url": "/r/AmItheAsshole/comments/1jtcizm/aita_for_not_sharing_my_savings_account/",
        "body_summary": "I’m not a big writer, but basically one of my family members is upset with me because I have grown a savings account & they feel like I should be helping them. Mind you they are older than me. Has a steady job and all. They want to spend their money on new vehicles and gadgets. I’m saving to buy my first house. But im over here being guilt tripped. ",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 39,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 40
        },
        "total_judged": 40,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:33:56.813864"
    },
    {
        "id": "1jtmfwg",
        "title": "AITA for taking over my parents’ condo and offering to give my siblings today’s value when I sell it?",
        "url": "/r/AmItheAsshole/comments/1jtmfwg/aita_for_taking_over_my_parents_condo_and/",
        "body_summary": "OP offered to take over their parents' valuable condo, handling all costs, and promised siblings a share of the current market value upon sale.  Family thinks this is unfair, suggesting OP buy it below market value. OP feels they're doing the responsible thing and asks if they're the asshole.\n...",
        "reddit_judgments": {
            "YTA": 41,
            "NTA": 8,
            "ESH": 0,
            "NAH": 2,
            "INFO": 4,
            "TotalJudged": 55
        },
        "total_judged": 55,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:33:58.562316"
    },
    {
        "id": "1jt00a7",
        "title": "AITA for not going to my grandma's 85th birthdaydinner probably 2 weeks to a month postpartum?",
        "url": "/r/AmItheAsshole/comments/1jt00a7/aita_for_not_going_to_my_grandmas_85th/",
        "body_summary": "OP (28F) is expecting her first child, a month before her grandma's 85th birthday dinner.  Mom wants a restaurant near OP's home (10-minute drive), despite grandparents living 1.5 hours away. OP explained she may not be ready postpartum due to recovery, breastfeeding, and baby's unvaccinated status, suggesting a compromise. Mom thinks OP is unreasonable, citing past practices.  AITA?\n...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 49,
            "ESH": 0,
            "NAH": 5,
            "INFO": 0,
            "TotalJudged": 58
        },
        "total_judged": 58,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:34:00.434590"
    },
    {
        "id": "1jte15o",
        "title": "WIBTA If I asked my friends to pay the full amount?",
        "url": "/r/AmItheAsshole/comments/1jte15o/wibta_if_i_asked_my_friends_to_pay_the_full_amount/",
        "body_summary": "OP paid for a large Korean BBQ birthday dinner.  He later requested partial reimbursement from everyone except the birthday celebrants. Two guests, a soon-to-be-married couple, paid only for their drinks, citing budgeting concerns.  OP, learning they went to another venue afterward, wonders if he's wrong for requesting the full dinner cost from them.  He already covered his wife, himself, and the birthday people's share.\n...",
        "reddit_judgments": {
            "YTA": 17,
            "NTA": 39,
            "ESH": 3,
            "NAH": 3,
            "INFO": 4,
            "TotalJudged": 66
        },
        "total_judged": 66,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:34:02.894167"
    },
    {
        "id": "1jtfwsc",
        "title": "AITA for not including my husbands siblings in life events for our kids?",
        "url": "/r/AmItheAsshole/comments/1jtfwsc/aita_for_not_including_my_husbands_siblings_in/",
        "body_summary": "OP and husband went no-contact with his parents after a hurtful conversation where the parents blamed the husband for past grievances.  They initially excluded the husband's siblings from family events to avoid further tension with the parents.  Now, the siblings are upset about being excluded and refuse to attend future events unless OP reconciles with their parents. OP wonders if they are the assholes for prioritizing boundary setting over family relationships.\n...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 18,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 28
        },
        "total_judged": 28,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:34:04.085485"
    },
    {
        "id": "1jtkwl8",
        "title": "AITA Mom wants me to give her money she gifted me back",
        "url": "/r/AmItheAsshole/comments/1jtkwl8/aita_mom_wants_me_to_give_her_money_she_gifted_me/",
        "body_summary": "OP's mom gifted her $40K, then demanded $8K back due to unforeseen expenses.  OP needs the money for debt and housing, but her mom is calling her selfish and threatens to report the gift as fraudulent.  Mom favored OP's sister, who also received a gift but wasn't asked to return any.  OP feels conflicted but is hesitant to return the money given her mom's history of emotional abuse and outstanding debts to OP.  AITA?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 16,
            "ESH": 0,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 17
        },
        "total_judged": 17,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:34:05.504758"
    },
    {
        "id": "1jt1okq",
        "title": "AITA for lying to my family so I don’t have to help my sick grandmother?",
        "url": "/r/AmItheAsshole/comments/1jt1okq/aita_for_lying_to_my_family_so_i_dont_have_to/",
        "body_summary": "OP (30F) lied to her mother about a pet emergency to avoid helping her abusive grandmother move.  Grandma's house is condemned, and OP hasn't spoken to her in a decade due to the grandmother's past abuse of OP's father.  OP's mother knows the history and pressured OP to help.  Feeling guilty after lying, OP asks if she's the asshole.\n...",
        "reddit_judgments": {
            "YTA": 14,
            "NTA": 6,
            "ESH": 0,
            "NAH": 0,
            "INFO": 3,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-04-07T16:34:06.697210"
    },
    {
        "id": "1jti7gp",
        "title": "AITA for getting mad about my MIL coming to stay with us for 4 days?",
        "url": "/r/AmItheAsshole/comments/1jti7gp/aita_for_getting_mad_about_my_mil_coming_to_stay/",
        "body_summary": "OP and her fiancé live in a small trailer with two dogs.  Fiancé, without consulting OP, invited his mother for a weekend visit.  OP is upset due to lack of space and privacy for work, the mother's dislike of the dogs, and her own smoking habit (secret from the mother).  She questions her fiancé's consideration and asks if she's wrong to be angry.\n...",
        "reddit_judgments": {
            "YTA": 15,
            "NTA": 54,
            "ESH": 6,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 76
        },
        "total_judged": 76,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:34:09.005495"
    },
    {
        "id": "1jtm96u",
        "title": "AITA for ditching my dad’s funeral?",
        "url": "/r/AmItheAsshole/comments/1jtm96u/aita_for_ditching_my_dads_funeral/",
        "body_summary": "A 13-year-old girl (OP) left her abusive father's funeral after hearing her mother praise him.  Her father, while financially providing, was emotionally abusive to OP and her mother.  Sisters and mother are angry at OP for leaving.  OP questions if she's the asshole for leaving the funeral given her father's history of abuse.\n...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 43,
            "ESH": 0,
            "NAH": 10,
            "INFO": 0,
            "TotalJudged": 61
        },
        "total_judged": 61,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:34:10.909878"
    },
    {
        "id": "1jsxvup",
        "title": "AITA If I ignored my uncle on my Birthday Trip?",
        "url": "/r/AmItheAsshole/comments/1jsxvup/aita_if_i_ignored_my_uncle_on_my_birthday_trip/",
        "body_summary": "18M OP, transgender, is going to a convention. Mom bought multi-person tickets, insisting OP bring someone; friend and dad are unavailable.  Mom suggests transphobic uncle. OP doesn't want him along due to past behavior but mom insists tickets are non-refundable. OP plans to ignore uncle but worries about upsetting mom.  AITA for ignoring uncle at the convention?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:34:17.001162"
    },
    {
        "id": "1jtfo72",
        "title": "WIBTA If I told my friend to stop bringing his girlfriend to everything we do",
        "url": "/r/AmItheAsshole/comments/1jtfo72/wibta_if_i_told_my_friend_to_stop_bringing_his/",
        "body_summary": "OP (m23) and his best friend (m22) are having issues because the best friend prioritizes his new girlfriend.  OP feels sidelined, especially after instances where his friend prioritized his girlfriend over pre-existing plans with OP.  He's now considering asking his friend to have some alone time, but worries about jeopardizing their friendship.  AITA for wanting a day with just his friend?\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 14,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 14
        },
        "total_judged": 14,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:34:28.291625"
    },
    {
        "id": "1jt9zcv",
        "title": "AITA for refusing to meet my (36F)BFF's new boyfriend (40m)",
        "url": "/r/AmItheAsshole/comments/1jt9zcv/aita_for_refusing_to_meet_my_36fbffs_new/",
        "body_summary": "OP's BFF, after an abusive relationship, quickly started dating a man who uses cocaine.  OP, living far away, feels strongly against meeting him due to her own life priorities and discomfort around drug use.  Though she loves her friend, OP worries her BFF isn't healing properly and is exhausted by the situation.  She asks if she's wrong for refusing to meet the new boyfriend.\n...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 12,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 12
        },
        "total_judged": 12,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-04-07T16:34:29.630604"
    }
]