[
    {
        "id": "1p2sicn",
        "title": "AITA for yelling at my friend about her B.O. after literally throwing up?",
        "url": "/r/AmItheAsshole/comments/1p2sicn/aita_for_yelling_at_my_friend_about_her_bo_after/",
        "body_summary": "For context, I’ve been in college classes with this girl for the last year. We’re in the same degree program and have become friendly. I don’t hate her at all; I’ve just reached my limit and might’ve gone too far.\nThis semester we have the exact same schedule, so we ended up sitting next to each other in every class. At first I chalked a smell coming from her up to stress and assumed it was a temporary slip in hygiene. It happens. But it has been every. Single. Day.\nThe best way I can describe the smell is like strong barn-type body odor, as if she worked outside on a hot humid summer day and didn’t shower. She has long, pretty hair but it’s visibly oily from roots to ends. By our third class of the day I’m nauseous and trying not to gag.\nAfter a month of this not getting better, another f...",
        "reddit_judgments": {
            "YTA": 12,
            "NTA": 88,
            "ESH": 3,
            "NAH": 3,
            "INFO": 2,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-22T05:10:58.446790"
    },
    {
        "id": "1p3393s",
        "title": "AITA for giving a secret family recipe to a family member?",
        "url": "/r/AmItheAsshole/comments/1p3393s/aita_for_giving_a_secret_family_recipe_to_a/",
        "body_summary": "I married into a family that has a secret pasta and red sauce recipe. When I got married the recipe was one of the gifts. Whenever there are family functions we switch up who makes the recipe, each of us putting our own twist on it.\n\nSince getting married, I have gotten close to my spouse’s cousin. We hang out often, she’s a bit of a mentor to me. I asked when it would be her turn to make the recipe because she’s a great cook and I want to try her twist on it.\n\nShe never got the secret recipe. It’s only passed down to *married* members of the family (I learned my spouse didn’t get a copy until marriage). She has asked for the recipe but keeps getting told “when you get married” She’s in her early 50’s and has repeatedly expressed no interest in marriage (I think she’s aromantic/asexual). \n...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 134,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 137
        },
        "total_judged": 137,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-22T05:11:18.772032"
    },
    {
        "id": "1p2wcmd",
        "title": "AITA for telling my husband I won’t live under the same roof as his grandmother anymore?",
        "url": "/r/AmItheAsshole/comments/1p2wcmd/aita_for_telling_my_husband_i_wont_live_under_the/",
        "body_summary": "My husband and I have been together for several years and married for one. When I moved in, I moved into his long-standing family setup. He has lived on this property for 13 years. His grandmother lives in the larger lower-level unit, and we live in the smaller upper unit. It functions like a split-level duplex, but he always refers to it as “one house,” even though it’s really two separate living spaces connected.\n\nWhen I first moved in, there wasn’t enough room upstairs, so my son had to sleep downstairs in his grandmother’s unit. He shared a bedroom with my stepson. I hated the setup, but at the time I didn’t feel like I had the power to demand changes.\n\nOnce we got married, I told my husband I was no longer comfortable with my son living on a different floor, especially in someone else...",
        "reddit_judgments": {
            "YTA": 63,
            "NTA": 22,
            "ESH": 18,
            "NAH": 0,
            "INFO": 5,
            "TotalJudged": 108
        },
        "total_judged": 108,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-22T05:11:36.519846"
    },
    {
        "id": "1p31eqr",
        "title": "AITA for refusing to keep babysitting my best friend’s kids and basically feeding them every week?",
        "url": "/r/AmItheAsshole/comments/1p31eqr/aita_for_refusing_to_keep_babysitting_my_best/",
        "body_summary": "I 26F have best friend 27F since high school. She has two kids 5 and 3. I love them, and before this all blew up, I genuinely enjoyed spending time with them. Over the past year, Lilly has been relying on me more and more for quick favors that slowly turned into full childcare. At first it was Can you watch them for an hour while I run to the store? Then it became Can they just stay with you until dinner? I’m exhausted.\nAnd recently it is I’ll drop them off before work. You’re home anyway.\nFor context I work from home. I don’t have kids. I’m not their emergency contact. And I’m definitely not financially in a place where feeding two extra children multiple times a week is easy. The thing is, Lilly never packs them food ever, no snacks, no diapers half the time. And when I ask, she says her...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 147,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 150
        },
        "total_judged": 150,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-22T05:11:54.399364"
    },
    {
        "id": "1p2qzec",
        "title": "AITA for how I responded to my stepfather's comment?",
        "url": "/r/AmItheAsshole/comments/1p2qzec/aita_for_how_i_responded_to_my_stepfathers_comment/",
        "body_summary": "This happened a year ago but I(19) still think about it. My mom, stepfather and I were at a bookstore together. We saw a shelf with LGBT fiction and my stepfather said that it's because people 'have an agenda' and 'try to convert others to their degenerate lifestyle.' I was never surprised by his stance on our community since he's from a country where homosexuality is still illegal but it still pissed me off. So I told him how I grew up watching hetero movies like Twilight and they didn't turn me straight.\n\nHe and my mom had a massive argument about how she kept my orientation a secret. I left that night and have been living with my grandma ever since.\n\nEver since leaving, I've only met my mom at the mall and not at her house. Last month, she told me that by coming out I put her in a diffi...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 36,
            "ESH": 0,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 36
        },
        "total_judged": 36,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-22T05:12:10.084324"
    },
    {
        "id": "1p3e6ql",
        "title": "AITA for telling my wife she was being difficult due to a seating issue at the restaurant?",
        "url": "/r/AmItheAsshole/comments/1p3e6ql/aita_for_telling_my_wife_she_was_being_difficult/",
        "body_summary": "On Sunday, my wife and I were out for a date night, my sister was babysitting our two year old daughter, so we had the night free. I was busy with some friends in the afternoon so I had texted my wife to make reservations at the restaurant, and a few minutes later she told me it was done.\n\nWhen we got there, and were taken to our table, she said that during the phone call she had asked for a table next to the windows and that the lady who'd taken down her reservation had said she'd noted it down. The guy said there wasn't anything written, and there wasn't any window-side table free, so if we could be seated at the current table for now, he'd see what he can do. That table was good too, and honestly I wasn't fussed over the window, so we sat down.\n\nA few minutes later, she told me she saw ...",
        "reddit_judgments": {
            "YTA": 77,
            "NTA": 43,
            "ESH": 7,
            "NAH": 17,
            "INFO": 1,
            "TotalJudged": 145
        },
        "total_judged": 145,
        "reddit_verdict": "YTA",
        "fetched_utc": "2025-11-22T05:12:28.199163"
    },
    {
        "id": "1p2vwdj",
        "title": "AITA for refusing to buy a Christmas gift for my brother and sister in law, and making my husband do it instead?",
        "url": "/r/AmItheAsshole/comments/1p2vwdj/aita_for_refusing_to_buy_a_christmas_gift_for_my/",
        "body_summary": "I(34F) normally do all the Christmas shopping for mine and my husband's families because my husband (36M) works longer hours than I do. We have two children, and I am currently on maternity leave with the youngest. Because money is tighter this year due to the new baby, I asked my husband to please suggest to his brother that we want to only do gifts for the kids this year (they also have children) so please don't buy us anything, and we won't get anything for them. For other family members (eg our parents, and other siblings) who don't have children we would be doing gifts as normal.\n\nMy husband doesn't want to, because he thinks it'll come across as cheap and that it's also unfair since we're buying other siblings gifts. I think that it's perfectly fair, since they don't have to get us a...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 34,
            "ESH": 7,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 44
        },
        "total_judged": 44,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-22T05:12:44.131427"
    },
    {
        "id": "1p2wn6d",
        "title": "AITA for turning down a chance to celebrate my birthday",
        "url": "/r/AmItheAsshole/comments/1p2wn6d/aita_for_turning_down_a_chance_to_celebrate_my/",
        "body_summary": "I a 21M as i am writing this post today is my birthday, i don't make a big deal about birthdays since i was 12 after a terrible experience on my 12th birthday which was not so great on every level. since i was 12 no birthday celebrations and my family was okay with that decision of mine as they were also not so keen on birthdays after i turned 11. today i went to my friend's house, lets call him Sam to study for tomorrow's semester exam along with another friend and lets call him Yann. we were studying for the exam and i told friend a friend to take my phone and open a chat to get the last exam question paper for reference and he saw that it was my birthday in that chat that chat was of a classmate who remembers by birthday since we are only a few days apart in terms of the birthday. Sam s...",
        "reddit_judgments": {
            "YTA": 4,
            "NTA": 13,
            "ESH": 1,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 20
        },
        "total_judged": 20,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-22T05:12:59.806114"
    },
    {
        "id": "1p337v3",
        "title": "AITA for not cancelling my children’s medical insurance?",
        "url": "/r/AmItheAsshole/comments/1p337v3/aita_for_not_cancelling_my_childrens_medical/",
        "body_summary": "So my ex and I are in the middle of a divorce. Long story short he moved 6 hours away from where we lived together with the kids. I couldn’t afford the rent on our old apartment so I had to move in with my mom for a while. I had no one to watch the kids while I worked. My sister helped for a while but then our grandmother got sick and she had to leave the state to go take care of her. My husband works a job that lets him choose his own hours. So I made the decision to let him take the kids. \n\nI’ve covered both boys with Kaiser for over a year now. The thing with Kaiser is that you can only use the insurance with a Kaiser hospital/facility. The problem is the town he lives in is very small and far from any major cities.  The nearest Kaiser hospital is 5 hours from his home. So he decided he...",
        "reddit_judgments": {
            "YTA": 8,
            "NTA": 13,
            "ESH": 3,
            "NAH": 2,
            "INFO": 3,
            "TotalJudged": 29
        },
        "total_judged": 29,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-22T05:13:16.023270"
    },
    {
        "id": "1p32qf2",
        "title": "AITA For Not Feeling Sympathy for a Friend (30M) Who is “Poor”",
        "url": "/r/AmItheAsshole/comments/1p32qf2/aita_for_not_feeling_sympathy_for_a_friend_30m/",
        "body_summary": "Hello, I’ll cut to the chase. So I (30F) have a friend (30M) Teddy who hasn’t been employed for 2 years and is being supported by family at the moment while they go into a training program. They have a Bachelor’s degree that’s not very useful without a higher level. \n\nWe like to play video games and talk online together every once in a while. However things have been getting kind of awkward recently with a lot of new games coming out and me purchasing stuff after getting another job.\n\nBasically I can tell they get jealous when I get new stuff. There’s dirty looks, comments and irritation. I usually brush it off. \n\nHowever last week we got into an argument after he noticed some new figures in the shelf in the background. Teddy kind of snapped and asked if it was smart of me to spend money o...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 35,
            "ESH": 0,
            "NAH": 2,
            "INFO": 0,
            "TotalJudged": 37
        },
        "total_judged": 37,
        "reddit_verdict": "NTA",
        "fetched_utc": "2025-11-22T05:13:32.217114"
    }
]