[
    {
        "id": "1qxg0fs",
        "title": "AITA for canceling a trip because my friends changed the plan to something I couldn't afford?",
        "url": "/r/AmItheAsshole/comments/1qxg0fs/aita_for_canceling_a_trip_because_my_friends/",
        "body_summary": "I think ruined a group trip that was planned for months and even though I feel terrible about it, there’s nothing I could do.\n\nI and two friends went on a group trip January 2025 and it was so fun that by September we started talking about planning another for 2026. So we did but then we realized that the plans we had for the trip would require a group of four and since we were three, one of us decided to bring in another friend of hers which we all accepted. This was towards the end of November and preparations was going well until one day in December, the new girl suggested that we change our original destination to someplace else because our original destination wouldn’t be ideal for the trip of four. The friend that brought her in supported her and the other opposed with me so we were ...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 131,
            "ESH": 3,
            "NAH": 1,
            "INFO": 5,
            "TotalJudged": 143
        },
        "total_judged": 143,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-07T05:34:35.317405"
    },
    {
        "id": "1qxxjh1",
        "title": "AITA for telling my sister to stop mommyjacking every conversation and to let me talk about myself?",
        "url": "/r/AmItheAsshole/comments/1qxxjh1/aita_for_telling_my_sister_to_stop_mommyjacking/",
        "body_summary": "My sister has 2 kids, 4 and 1. Ever since she got pregnant about 5 years ago, she pivots every conversation to pregnancy, breast feeding, her kids, etc. We have a family group chat and it happens any time I try to text about something, no matter how important. When people are responding to me, she brings up something about being a mother and everyone drops what I was saying and moves on to her. \n\nIt’s been annoying me for a while. This has happened for pretty much any conversation that happens. It only doesn’t happen if she is asleep or not on her phone, so that’s not often. She did it after I got engaged, when I was talking about my new job, when I am talking about my health, when I bought a house, etc. \n\nAt the start of this week I found out intense restructuring is happening at the comp...",
        "reddit_judgments": {
            "YTA": 10,
            "NTA": 97,
            "ESH": 5,
            "NAH": 2,
            "INFO": 5,
            "TotalJudged": 119
        },
        "total_judged": 119,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-07T05:34:44.699559"
    },
    {
        "id": "1qxfklb",
        "title": "AITA for ignoring my mother-in-law’s calls after she told people I asked her for money and twisted our private conversation?",
        "url": "/r/AmItheAsshole/comments/1qxfklb/aita_for_ignoring_my_motherinlaws_calls_after_she/",
        "body_summary": "I (F) have a complicated relationship with my mother-in-law. From the beginning she didn’t like me when I joined the family. She told my brother-in-law that I was only with my husband because he is successful and rich, that I don’t genuinely love him, and that our marriage wouldn’t last. About a year later she suddenly changed her tone and started saying I’m a good daughter-in-law and “like the daughter she finally has,” but she still makes negative comments about me behind my back instead of saying anything directly to me.\n\nSome background: my in-laws are separated but not divorced. MIL lives alone. My husband, my brother-in-law, and I live with my father-in-law. For a while I thought MIL and I were getting closer. We hung out a few times and I opened up to her about small frustrations re...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 33,
            "ESH": 1,
            "NAH": 0,
            "INFO": 1,
            "TotalJudged": 35
        },
        "total_judged": 35,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-07T05:34:52.294948"
    },
    {
        "id": "1qxqvbh",
        "title": "UPDATE: AITA for not allowing my dad and sister to live with us after I just had a baby and their home was ruined by a neighbor's house fire?",
        "url": "/r/AmItheAsshole/comments/1qxqvbh/update_aita_for_not_allowing_my_dad_and_sister_to/",
        "body_summary": "Original post here: [AITA for not allowing my dad and sister to live with us after I just had a baby and their home was ruined by a neighbor's house fire? : r/AmItheAsshole](https://www.reddit.com/r/AmItheAsshole/comments/1qu42vz/aita_for_not_allowing_my_dad_and_sister_to_live/)\n\nUpdate: Thank you all for your feedback, words of encouragement, blunt honesty, and reminders to set firm boundaries and to take care of my husband and son first.  \n  \nI refused to allow my father and his medical equipment into our home. There were no arguments there, especially when it came down to the safety and cleanliness of my baby's living environment.  \n  \nThe cat allergies became severe for not only my husband, but myself. I held firm that my sister and her cat had to be gone from our home immediately for ...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 1,
            "ESH": 0,
            "NAH": 1,
            "INFO": 1,
            "TotalJudged": 3
        },
        "total_judged": 3,
        "reddit_verdict": "Mixed / Few Judgments",
        "fetched_utc": "2026-02-07T05:34:59.735953"
    },
    {
        "id": "1qxjtjh",
        "title": "AITA for selling my Pokémon card collection to help pay bills even though my wife is mad about it?",
        "url": "/r/AmItheAsshole/comments/1qxjtjh/aita_for_selling_my_pokémon_card_collection_to/",
        "body_summary": "My wife (30F) and I (32M) have been going through a rough financial patch over the last few months. Nothing catastrophic, but between rising bills, groceries, and some unexpected expenses, money has been tighter than we are used to. We have had several conversations about needing to cut back on spending and be more careful financially.\nFor context, I have had a Pokémon card collection since I was a kid. Over the years I added to it, took good care of it, and it honestly means a lot to me sentimentally. Some of the cards are worth decent money now, but I never really planned on selling them unless I absolutely had to.\nRecently, I realized we were starting to fall behind on a couple bills, so I decided to sell part of my collection. It was not an easy decision, but I figured helping stabiliz...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 105,
            "ESH": 6,
            "NAH": 4,
            "INFO": 4,
            "TotalJudged": 122
        },
        "total_judged": 122,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-07T05:35:08.330688"
    },
    {
        "id": "1qxnldn",
        "title": "WIBTA if i asked my roommates girlfriend with ibs to pitch in cleaning the bathroom?",
        "url": "/r/AmItheAsshole/comments/1qxnldn/wibta_if_i_asked_my_roommates_girlfriend_with_ibs/",
        "body_summary": "My roommates girlfriend has basically moved in at this point which is its own problem, but i’m still working out how to approach them on that because they can both be very defensive.\n\nOne of the issues i’ve been having is about the bathroom. She has some digestive issues and can sometimes take up the bathroom for 20-30 minutes at a time, I know this isn’t something she can control but it can be frustrating at times. It’s not a super sensitive or vulnerable subject, my roommate teases her and jokes to me about it, it’s just awkward for me who doesn’t know her well and I don’t know how she’d feel if I was one to mention it too.\n\nWhen cleaning the bathroom, i’ve noticed the toilet is a lot dirtier now than when it was just the two of us. And there’s what I can describe as “splatters,” sometim...",
        "reddit_judgments": {
            "YTA": 2,
            "NTA": 46,
            "ESH": 0,
            "NAH": 1,
            "INFO": 0,
            "TotalJudged": 49
        },
        "total_judged": 49,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-07T05:35:16.152390"
    },
    {
        "id": "1qxbq3k",
        "title": "AITA for telling my best friend that her fiancé isn't my friend?",
        "url": "/r/AmItheAsshole/comments/1qxbq3k/aita_for_telling_my_best_friend_that_her_fiancé/",
        "body_summary": "My (27F) best friend (Lucy 27F) and I live in different countries and have had regular long catchup calls for years. Since she started dating (3 years ago), her boyfriend has become a permanent presence in our calls. At first it was occasional, which was fine. But now it's the default. Lucy often doesn't tell me he's going to be there, and I'll find out when I join the video call or later that I was on speaker and he was in the room.\n\nThe first time I \"met\" him was without warning. Lucy brought him into a video call when I was in PJs and had just had a big fight with my family (they're abusive - long story). She knew I planned to talk about it during this call. I ended up venting in front of him anyway cuz I was an emotional wreck. Lucy thought it was a great bonding moment until I told he...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 21,
            "ESH": 0,
            "NAH": 0,
            "INFO": 2,
            "TotalJudged": 23
        },
        "total_judged": 23,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-07T05:35:23.681887"
    },
    {
        "id": "1qxf9sa",
        "title": "AITA for \"making things uncomfortable\" for the friend group after one of them repeatedly disappeared when I needed support?",
        "url": "/r/AmItheAsshole/comments/1qxf9sa/aita_for_making_things_uncomfortable_for_the/",
        "body_summary": "In college (I'm 27F now), I was close with 2 girls, Julie (28F) and Casey (29F). We were all part of the same friend group. After graduating, Casey and I moved to different countries, Julie stayed in her hometown. Now, around that time, my home life had become really bad (abusive family situation - which was why I left). I was really depressed and lonely in a new country and I tried to stay in touch with Julie and Casey, especially during that 1st year.\n\nJulie is famously \"bad at texting/calling\". Messages would go unopened for days if not weeks. Calls had to be planned a week in advance at least. We'd schedule calls around time zones and then the day would come and I'd be the only one online. I'd text to check in, get no response, and sometimes wouldn't hear back for days. Casey was movin...",
        "reddit_judgments": {
            "YTA": 0,
            "NTA": 26,
            "ESH": 0,
            "NAH": 6,
            "INFO": 2,
            "TotalJudged": 34
        },
        "total_judged": 34,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-07T05:35:31.178843"
    },
    {
        "id": "1qxxc7f",
        "title": "AITA backing out of the baby shower of my brother's girlfriend who is also my pregnant best friend of 22 years?",
        "url": "/r/AmItheAsshole/comments/1qxxc7f/aita_backing_out_of_the_baby_shower_of_my/",
        "body_summary": "I'll try to keep this as concise as possible. My (33f) best friend since age 12 (33f) is pregnant with my little brother's (27m) baby.\n\nWhen they started dating I was over the moon! They have been crushing on each other for more than a decade and everything aligned and they finally got together. Her IUD failed and now they're going to have a baby.\n\nThe baby situation is messy and complicated, but only slightly relevant. She has a 12 year old that refuses to see her and didn't take good care of him when she did have him a few years back. She struggles with mental health but refuses to seek treatment and finds every reason possible to skip work, stay in bed, neglect obligations, My brother didn't want kids, ever, but stood by her decision to keep it. My brother has a great career and is supe...",
        "reddit_judgments": {
            "YTA": 1,
            "NTA": 27,
            "ESH": 2,
            "NAH": 0,
            "INFO": 0,
            "TotalJudged": 30
        },
        "total_judged": 30,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-07T05:35:38.684238"
    },
    {
        "id": "1qxctz7",
        "title": "AITA for telling my friend that I can't join her Bachelorette trip because of my baby?",
        "url": "/r/AmItheAsshole/comments/1qxctz7/aita_for_telling_my_friend_that_i_cant_join_her/",
        "body_summary": "Hey, sorry for my English, it's not my first language.\n\nMy (f, 31)best friend (f, 31) is getting married next year and she wants to go on a weekend Bachelorette trip to Oslo. We live in northern Germany. At the time of the trip my baby will probably be around 6 months old. I saw how difficult it was for my sister to leave her baby alone within the first year of it's life and I told her, that I might not be able to join the trip and that we maybe can do something else instead or plan a day trip a bit closer or make accommodations for me to bring my baby. She responded very surprised and talked about other friends who left their baby easily from very early on and that it depends on how you train your baby and that it's important to not let the baby be super dependent on you.\n\nI told her, tha...",
        "reddit_judgments": {
            "YTA": 3,
            "NTA": 62,
            "ESH": 0,
            "NAH": 12,
            "INFO": 0,
            "TotalJudged": 77
        },
        "total_judged": 77,
        "reddit_verdict": "NTA",
        "fetched_utc": "2026-02-07T05:35:46.702453"
    }
]